[{"date": "", "archive_date": "2025-12-15", "text": "Marc Stein on Chris Paul: \"They're going to try to get him somewhere. It's so interesting — in the summer, if you remember, the Bucks, the Mavs, the Hornets — these were all teams that registered interest in Chris Paul. And at that time, Chris Paul was telling teams, 'I want to be in L.A. I've been away from my family for the last five or six years. They've stayed back in L.A. while I’ve played for all these various teams.' His message in the summer was, 'I don’t want to be any farther from L.A. than Phoenix.' Phoenix was as far away as he was willing to go.Now, because things went so poorly with the Clippers, I think he’s open. He’d be open to a variety of destinations.I think he just wants to go somewhere he can have a role and put together a final chapter that he’s happy with — because obviously, the way his second stint with the Clippers went is not how he wants to go out.\"YouTube", "quote": "Now, because things went so poorly with the Clippers, I think he’s open. He’d be open to a variety of destinations.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=UVXunDHX5zU", "tags": ["Charlotte Hornets", "Los Angeles Clippers", "Milwaukee Bucks", "Brooklyn Nets", "Phoenix Suns", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-15", "text": "Chris B. Haynes says that a “handful” of teams have reached out to Chris Paul & he’ll have options.“There have been a handful of teams that have reached out & want to see what he’s trying to do. So he’ll have some options.”x.com", "quote": "“There have been a handful of teams that have reached out & want to see what he’s trying to do. So he’ll have some options.”", "outlet": "x.com", "source_url": "https://x.com/cp3region/status/1999952702797689322?s=46", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-15", "text": "Blake Griffin, now an analyst for Amazon Prime’s NBA coverage, was teammates with Paul on the Clippers during their “Lob City” era. Does he think a Knicks-Paul pairing would work? “What’s crazy is you’ve seen him get to Oklahoma City and see him be a leader, a mentor, a guy who is sort of teaching and helping guys learn the game,” Griffin said. “He did that for us with the Clippers. Houston was sort of a different situation. He went to Phoenix and it was the first time in forever Phoenix really had true success, with Chris Paul at the point guard. Chris Paul left, and so Phoenix fizzled. CP was in San Antonio and sort of did the same thing. So time and time again, he’s proved — that’s been my biggest thing with this whole situation.Time and time again, he’s proved that he’s gone to a team and kind of fit the role that he needed to fit. Played less minutes. Did this, did that. So it’d be great for the Knicks.”New York Post", "quote": "Time and time again, he’s proved that he’s gone to a team and kind of fit the role that he needed to fit. Played less minutes. Did this, did that. So it’d be great for the Knicks.”", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/14/sports/blake-griffin-thinks-chris-paul-would-be-great-fit-for-knicks/", "tags": ["Houston Rockets", "Los Angeles Clippers", "New York Knicks", "Oklahoma City Thunder", "Phoenix Suns", "San Antonio Spurs", "Chris Paul", "Blake Griffin"]}, {"date": "", "archive_date": "2025-12-15", "text": "Chris Haynes: I think the Knicks have interest in Giannis—strong interest. The Miami Heat have interest in Giannis. The Golden State Warriors have had interest in Giannis for a long time. The San Antonio Spurs. The Minnesota Timberwolves. The list goes on and on.Ultimately, for Giannis, wherever he lands, I think he'd prefer some sun, probably a big market.Outside of that, he wants to be on a team that can contend for a championship. He's been very clear that this is a top priority for him throughout his career.\"YouTube", "quote": "Ultimately, for Giannis, wherever he lands, I think he'd prefer some sun, probably a big market.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=JUpjR_KNdEs", "tags": ["Golden State Warriors", "Miami Heat", "Minnesota Timberwolves", "New York Knicks", "San Antonio Spurs", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-15", "text": "How sour are you that the NBA has the 65 game rule and that you miss out on almost $50 million because you can't make All-NBA now and it affects your contract? Jalen Williams: I'll make it back somewhere else. So, I'm not too worried about it. But I mean I think honestly the way I was thinking about it was if I come back and I play hurt, right? Then I risk you don't want to do that. I risk messing my hand up and kind of wasting a lot of the work that my team and our training staff I put into the summer. So if it wasn't time for me to play, it wasn't time for me to play.That's that's more of like a God's plan thing and I'm just kind of rolling with it. I'll never be salty over the money. we obviously will be able to use that elsewhere, which will be even nicer to keep our team together. Um, it's very generous. Yeah, I mean I made a lot of money over over the summer, too. So, I'm never gonna be too greedy. Um, again, it's one of those things where like coming from like a small school, I never thought I would make the amount of money that I'm making now anyway. So, I'm I'm not too concerned over it. It's It's about the goal for me is about winning before it is about money.YouTube", "quote": "That's that's more of like a God's plan thing and I'm just kind of rolling with it. I'll never be salty over the money", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=JUpjR_KNdEs", "tags": ["Oklahoma City Thunder", "Salaries", "Jalen Williams"]}, {"date": "", "archive_date": "2025-12-15", "text": "With their rookie class developing as well as any in the league, the Charlotte Hornets are starting to rethink things. According to NBA insider Michael Scotto,the Charlotte Hornets now view Kon Knueppel as the face of the franchise.Although they intend to build around Knueppel, the Hornets are hopeful to see success from a core including Knueppel, Brandon Miller and LaMelo Ball.Sporting News", "quote": "the Charlotte Hornets now view Kon Knueppel as the face of the franchise.", "outlet": "Sporting News", "source_url": "https://www.sportingnews.com/us/nba/charlotte-hornets/news/kon-knueppel-labeled-face-hornets-nba-insider/49d2ae0e7b11f2e739f421d3", "tags": ["Charlotte Hornets", "Brandon Miller", "LaMelo Ball", "Kon Knueppel"]}, {"date": "", "archive_date": "2025-12-15", "text": "ALL NBA Podcast: \"There's an important rule in the new CBA that says, anyone who is trade by [Tuesday December 16th]... is eligible to be repackaged in a subsequent trade on deadline day\" -@TheSteinLine on why he believes a trade will happen THIS Monday or Tuesdayx.com", "quote": "@TheSteinLine on why he believes a trade will happen THIS Monday or Tuesday", "outlet": "x.com", "source_url": "https://x.com/ALLCITY_NBA/status/2000455096430452805", "tags": ["Trade"]}, {"date": "", "archive_date": "2025-12-15", "text": "Trail Blazers PR: OFFICIAL: The@trailblazers have assigned center Yang Hansen and guard/forward Rayan Rupert to the @ripcityremix.x.com", "quote": "@trailblazers have assigned center Yang Hansen and guard/forward Rayan Rupert to the @ripcityremix", "outlet": "x.com", "source_url": "https://x.com/TrailBlazersPR/status/2000436424105979981", "tags": ["Portland Trail Blazers", "G League", "Rayan Rupert", "Yang Hansen"]}, {"date": "", "archive_date": "2025-12-15", "text": "Dwyane Wade: I had a one-on-one with Riles about it. Yeah. So it went a little bit like this. Riles came in and talked to me about the possibility of trading for Allen Iverson. And that’s one of my favorite players and I love him. I was like, \"Bet. Let’s do it.\" He was like, \"You in?\"I said, \"I'm in.\" He's like, \"We’re going to have to trade UD.\" I said, \"I'm out.\"I'm out. That was it. I was out.YouTube", "quote": "I said, \"I'm in.\" He's like, \"We’re going to have to trade UD.\" I said, \"I'm out.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=vfTjmN2xqWk", "tags": ["Dwyane Wade", "Allen Iverson", "Udonis Haslem"]}, {"date": "", "archive_date": "2025-12-15", "text": "Brooks capped a wild fourth-quarter comeback from the Suns by hitting a three-point shot, only to run down the court, intentionally bump into James and earn his second technical foul of the game, causing his ejection.“He’s going to compete. I’m going to compete,” James said. “We’re going to get up in each other’s face. Try not to go borderline with it. I don’t really take it there. But we’re just competing and did that almost all the way to the end of the game.”New York Times", "quote": "“He’s going to compete. I’m going to compete,” James said. “We’re going to get up in each other’s face. Try not to go borderline with it. I don’t really take it there. But we’re just competing and did that almost all the way to the end of the game.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6890277/2025/12/14/suns-lakers-result-brooks-james-fouls/?source=emp_shared_article", "tags": ["Los Angeles Lakers", "Phoenix Suns", "LeBron James", "Dillon Brooks"]}, {"date": "", "archive_date": "2025-12-15", "text": "Oh No He Didn't: Lebron on taking the technical free throw:\"Shit I just walked up to the free throw line. Why wouldn't I?\"x.com", "quote": "\"Shit I just walked up to the free throw line. Why wouldn't I?\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000423668686671970", "tags": ["Los Angeles Lakers", "LeBron James"]}, {"date": "", "archive_date": "2025-12-15", "text": "Duane Rankin:\"She said I hit his wrist, which is a lie. I rewatched it.\"Devin Booker on his PF on LeBron James 3 with 3 seconds left as he's talking about referee Jenna Schroeder. Suns challenge ruled unsuccessful. 2 of 3 FTs gave L.A. 115-114 lead. Lakers won 116-114 #Suns #LakeShowx.com", "quote": "\"She said I hit his wrist, which is a lie. I rewatched it.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2000435944852451695", "tags": ["Los Angeles Lakers", "Phoenix Suns", "LeBron James", "Officiating", "Devin Booker"]}, {"date": "", "archive_date": "2025-12-15", "text": "Ott pointed out that Brooks’ second technical foul didn’t cost the Suns because James missed the foul shot. Still, it was not a smart decision. And it kept Phoenix’s best defender off the court for the Lakers’ final possession.“We’re with him,” Ott said of Brooks, who arrived in Phoenix this season as part of the Kevin Durant blockbuster trade with the Houston Rockets. “He’s brought so much to this city and this franchise. His energy, his passion, his hard work, his attitude every single day — we love him.”New York Times", "quote": "“We’re with him,” Ott said of Brooks, who arrived in Phoenix this season as part of the Kevin Durant blockbuster trade with the Houston Rockets. “He’s brought so much to this city and this franchise. His energy, his passion, his hard work, his attitude every single day — we love him.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6890342/2025/12/15/dillon-brooks-stats-ejected-suns-lakers/?source=emp_shared_article", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Dillon Brooks", "Jordan Ott"]}, {"date": "", "archive_date": "2025-12-15", "text": "Brooks battled foul trouble against the Lakers. He finished with 18 points — 11 coming in the fourth quarter — in 24 minutes. Booker called his new teammate the “ultra-competitor.”“He’s always on the more ‘push the edge’ side, and I’d rather it be that way than the other way,” Booker said. “We’re still going to rally behind him. He still was effective.He still hit some big shots for us. And he hit what should’ve been the game winner if I didn’t foul.”New York Times", "quote": "“He’s always on the more ‘push the edge’ side, and I’d rather it be that way than the other way,” Booker said. “We’re still going to rally behind him. He still was effective.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6890342/2025/12/15/dillon-brooks-stats-ejected-suns-lakers/?source=emp_shared_article", "tags": ["Phoenix Suns", "Devin Booker", "Dillon Brooks"]}, {"date": "", "archive_date": "2025-12-15", "text": "In the final minute, Smart again made a bad decision, driving for a layup early in the shot clock only to be blocked at the rim by Suns center Mark Williams, leading to Brooks’ go-ahead 3 — and the ensuing technical. “it didn’t matter if he had one already or not, that’s definitely a tech,” James said. “If it was a tech on me in the (third quarter), then it was a tech on him right here, too.” Brooks didn’t speak to the media following the game.“There’s history there,” Booker said. “I love to see it. People always say everything’s too friendly in the NBA, and then Dillon comes around and now it’s too much. I’d rather it be too much.”New York Times", "quote": "“There’s history there,” Booker said. “I love to see it. People always say everything’s too friendly in the NBA, and then Dillon comes around and now it’s too much. I’d rather it be too much.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6890277/2025/12/14/suns-lakers-result-brooks-james-fouls/?source=emp_shared_article", "tags": ["Phoenix Suns", "Devin Booker", "Dillon Brooks"]}, {"date": "", "archive_date": "2025-12-15", "text": "Duane Rankin:\"LeBron and Dillon were physical with each other the whole game. It's tricky to be in a one-point game and 10 seconds left on the clock and to get a tech, I feel like you got to really earn your tech in that situation to pick one up.\" Grayson Allen after Suns loss to Lakers. On Devin Booker's foul on LeBron James 3: \"I haven't seen the up close and slow mo. I do know in that situation, and what we've been told throughout the year is that if person is holding the ball, you hit the hand, it's not a foul.\" #Suns #LakeShowx.com", "quote": "\"LeBron and Dillon were physical with each other the whole game. It's tricky to be in a one-point game and 10 seconds left on the clock and to get a tech, I feel like you got to really earn your tech in that situation to pick one up.\" Grayson Allen after Suns loss to Lakers", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2000461899335655521", "tags": ["Los Angeles Lakers", "Phoenix Suns", "LeBron James", "Grayson Allen", "Devin Booker"]}, {"date": "", "archive_date": "2025-12-15", "text": "Oh No He Didn't: Vando on Dillon Brooks going at it with LeBron:\"He brought his antics, tonight it cost him\"x.com", "quote": "\"He brought his antics, tonight it cost him\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000457583589478488", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Dillon Brooks", "Jarred Vanderbilt"]}, {"date": "", "archive_date": "2025-12-15", "text": "Dan Woike: Deandre Ayton, when asked about playing Phoenix... \"Yeah, it always feels good to be in Phoenix.They always added some type of fuel to my fire. It's blue fire now. I think that's the hottest fire.\"x.com", "quote": "They always added some type of fuel to my fire. It's blue fire now. I think that's the hottest fire.\"", "outlet": "x.com", "source_url": "https://x.com/DanWoikeSports/status/2000436168228519966", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Deandre Ayton"]}, {"date": "", "archive_date": "2025-12-15", "text": "Legion Hoops: BREAKING:Steph Curry now officially has the most career 40-point games after turning 30,passing Michael Jordan Legend. (h/t @bballforever_ )x.com", "quote": "Steph Curry now officially has the most career 40-point games after turning 30,", "outlet": "x.com", "source_url": "https://x.com/LegionHoops/status/2000419327304995124", "tags": ["Golden State Warriors", "Michael Jordan", "Stephen Curry", "Statistics"]}, {"date": "", "archive_date": "2025-12-15", "text": "For Curry, getting Butler more involved is the least of their worries given his caliber. “It's not just the Jimmy thing,” Curry said. “He's such a unique player because he can dominate a game even if it doesn't show in the statsheet. He's going to find ways to get everyone else involved;we just got to be organized around him. But tonight, I don't think it was him offensively at all; it was us collectively, defensively. You score 130+, you should win. Too many breakdowns on that front.”Clutch Points", "quote": "we just got to be organized around him. But tonight, I don't think it was him offensively at all; it was us collectively, defensively. You score 130+, you should win. Too many breakdowns on that front.”", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/golden-state-warriors/warriors-news-steve-kerr-identifies-need-jimmy-butler", "tags": ["Golden State Warriors", "Stephen Curry", "Jimmy Butler"]}, {"date": "", "archive_date": "2025-12-15", "text": "You don't get a lot of playing time, and you're also part of a team that's competing for the title. There are a lot of players ahead of you. How do you manage to find a balance between learning from your more experienced teammates while remaining ready in case the coach decides to call upon your services?Pacôme Dadiet: Right now, I'm trying to arrive before everyone else and leave after everyone else. I also have the G-League to stay ready, to keep my rhythm.It's more about managing the mental aspect to be ready when they call my name. That said, is it difficult to put into practice? Pacôme Dadiet: It's definitely not easy, because I want to play. But that's part of basketball. It's not the first time I've been in this situation. I'm used to being a young player on a professional team. I know what it's like and I know how hard it takes to earn playing time.Basket USA", "quote": "Pacôme Dadiet: Right now, I'm trying to arrive before everyone else and leave after everyone else. I also have the G-League to stay ready, to keep my rhythm.", "outlet": "Basket USA", "source_url": "https://www.basketusa.com/news/797009/interview-pacome-dadiet-ca-fait-plaisir-de-pouvoir-parler-francais-dans-le-vestiaire/", "tags": ["New York Knicks", "Pacome Dadiet"]}, {"date": "", "archive_date": "2025-12-15", "text": "Introducing... a new defensive tradition ??Tiago Splitter explains how the best defensive player each night will put their name in THE BOX. Sidy starts us off tonight ??x.com", "quote": "Tiago Splitter explains how the best defensive player each night will put their name in THE BOX", "outlet": "x.com", "source_url": "https://x.com/trailblazers/status/2000450377238589879", "tags": ["Portland Trail Blazers", "Tiago Splitter", "Coaching", "Frivolities"]}, {"date": "", "archive_date": "2025-12-15", "text": "Grady said the \"Alien\" nickname agreed with Wembanyama. But Van Gundy was quick to call for a change.\"The only thing is, in the current political environment, you gotta watch that word, Michael Grady,\" Van Gundy said. \"They deport those. We do not want Victor Wembanyama deported. Let's go with a different nickname.\"Grady laughed it off.FOXnews.com", "quote": "\"The only thing is, in the current political environment, you gotta watch that word, Michael Grady,\" Van Gundy said. \"They deport those. We do not want Victor Wembanyama deported. Let's go with a different nickname.\"", "outlet": "FOXnews.com", "source_url": "https://www.foxnews.com/sports/nba-broadcaster-calls-spurs-star-change-alien-nickname-they-deport-those", "tags": ["San Antonio Spurs", "Stan Van Gundy", "Politics", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-14", "text": "At halftime, they trailed by 17 points. By the end of the third quarter, the Nets’ lead ballooned to 28 points. Less than three minutes into the fourth quarter, it was up over 30 and ultimately stopped at 45 points (tying the Nets’ largest win in franchise history) as the buzzer sounded to end Sunday’s embarrassing effort. It was only the fourth time in franchise history the Bucks have lost by 45 or more points and their worst margin of defeat since a 114-69 loss to the Detroit Pistons on Dec. 31, 2007.“No question. Absolutely,” Kuzma said when asked by The Athletic if he viewed this as the low point of the Bucks’ season. “Lost by 45 points to a team that’s trying to lose. They got four wins, five wins, whatever it is now. “No disrespect at all because that’s the beauty of this league, right? There’s so much talent, and if you’re not ready, you’re gonna get your butt whooped. By any team. And we were proof of that tonight.”New York Times", "quote": "“No question. Absolutely,” Kuzma said when asked by The Athletic if he viewed this as the low point of the Bucks’ season. “Lost by 45 points to a team that’s trying to lose. They got four wins, five wins, whatever it is now", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6889675/2025/12/14/bucks-blowout-loss-nets-doc-rivers/", "tags": ["Milwaukee Bucks", "Brooklyn Nets", "Kyle Kuzma"]}, {"date": "", "archive_date": "2025-12-14", "text": "After starting the season with an 8-5 record, the Bucks have lost 11 of their last 14 games. They desperately need to find their way out of the hole they have dug for themselves and find a way to start winning games again, even with Antetokounmpo sidelined with a strained right calf.“Each guy has to look in the mirror and say, ‘What can I do better to help the team? What can I do better to impact winning? What can I do better to help us get back to .500?’” Bobby Portis (10 points, three rebounds) said. “Then, we can start rolling again. “I just think that should be the mindset. One game at a time, obviously, but we have about seven games left (until 2026). Six and one, right back at .500, so I think that should just be the goal, man.”New York Times", "quote": "“Each guy has to look in the mirror and say, ‘What can I do better to help the team? What can I do better to impact winning? What can I do better to help us get back to .500?’” Bobby Portis (10 points, three rebounds) said. “Then, we can start rolling again", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6889675/2025/12/14/bucks-blowout-loss-nets-doc-rivers/", "tags": ["Milwaukee Bucks", "Bobby Portis"]}, {"date": "", "archive_date": "2025-12-14", "text": "“I heard one of the guys said, ‘Man, we’re down that much to this team?’” Rivers recounted. “It’s like, ‘This team? What about our team? We’re 11-16. What are you talking about?’“We need all of us — including me, it starts with me — but I gotta get these guys right because clearly tonight was not the right night.”New York Times", "quote": "“I heard one of the guys said, ‘Man, we’re down that much to this team?’” Rivers recounted. “It’s like, ‘This team? What about our team? We’re 11-16. What are you talking about?’", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6889675/2025/12/14/bucks-blowout-loss-nets-doc-rivers/", "tags": ["Milwaukee Bucks", "Doc Rivers"]}, {"date": "", "archive_date": "2025-12-14", "text": "Matt Infield: GOOD NEWS for the Grizzlies.Brandon Clarke is listed as doubtful for tomorrow night’s game with the Clippers. He might get an extra game to ramp up, but I’d imagine this puts him in position to return by this Saturday against the Wizards at the latest.x.com", "quote": "Brandon Clarke is listed as doubtful for tomorrow night’s game with the Clippers", "outlet": "x.com", "source_url": "https://x.com/Matt_Infield/status/2000370613496566186?s=20", "tags": ["Memphis Grizzlies", "Injuries", "Brandon Clarke"]}, {"date": "", "archive_date": "2025-12-14", "text": "Dave McMenamin:“Luka should have shot that.” - JJ Redick on LeBron James taking the technical free throw after Dillon Brooks was tossed with 12.2 seconds left.x.com", "quote": "“Luka should have shot that.” - JJ Redick on LeBron James taking the technical free throw after Dillon Brooks was tossed with 12.2 seconds left", "outlet": "x.com", "source_url": "https://x.com/mcten/status/2000417967138594966?s=20", "tags": ["Los Angeles Lakers", "LeBron James", "JJ Redick", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-14", "text": "Joey Linn:James Harden is questionable for tomorrow’s game against Memphis with a left calf contusion.x.com", "quote": "James Harden is questionable for tomorrow’s game against Memphis with a left calf contusion", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/2000370125606944811?s=20", "tags": ["Los Angeles Clippers", "James Harden", "Injuries"]}, {"date": "", "archive_date": "2025-12-14", "text": "Jon Krawczynski:Rudy Gobert is OUT for the rest of the game for personal reasons, the team says. Hope everything is OK for him.x.com", "quote": "Rudy Gobert is OUT for the rest of the game for personal reasons, the team says. Hope everything is OK for him", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/2000379264051646514?s=20", "tags": ["Minnesota Timberwolves", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-14", "text": "Erik Slater:Jordi Fernandez tested positive for the flu but is doing well, per assistant Steve Hetzel.x.com", "quote": "Jordi Fernandez tested positive for the flu but is doing well, per assistant Steve Hetzel", "outlet": "x.com", "source_url": "https://x.com/erikslater_/status/2000314205568893280?s=20", "tags": ["Health", "Steve Hetzel", "Jordi Fernandez"]}, {"date": "", "archive_date": "2025-12-14", "text": "Joey Linn: Kawhi Leonard on the Clippers parting ways with Chris Paul:“Surprised at it. He’s always been a willing teammate when I’ve spoke to him. Only thing I could talk about is our conversations. And they’ve always been positive and team-forward. I didn’t have nothing to do with it. I didn’t even know what was going on.”x.com", "quote": "“Surprised at it. He’s always been a willing teammate when I’ve spoke to him. Only thing I could talk about is our conversations. And they’ve always been positive and team-forward. I didn’t have nothing to do with it. I didn’t even know what was going on.”", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/2000302116943081976", "tags": ["Los Angeles Clippers", "Chris Paul", "Kawhi Leonard"]}, {"date": "", "archive_date": "2025-12-14", "text": "Joey Linn: Ty Lue on the relationship between he and Lawrence Frank, specifically as NBA trade season begins:“We always work close together. Lawrence has been a great partner. Us trying to be on the same page, understanding what we need, what we wanna do. We’ve always been on the same page… He understands the game, he’s been a coach…We’ve always been on the same page as far as the talent you wanna get, who you wanna try to get, the players you wanna try to get. It doesn’t workout all the time. You can’t get the guys you want every single year… It’s a tough business. We always stay locked in, and we’re hand in hand.”x.com", "quote": "“We always work close together. Lawrence has been a great partner. Us trying to be on the same page, understanding what we need, what we wanna do. We’ve always been on the same page… He understands the game, he’s been a coach…", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/2000306350899990677", "tags": ["Los Angeles Clippers", "Lawrence Frank", "Tyronn Lue"]}, {"date": "", "archive_date": "2025-12-14", "text": "Interested teams continue to wait for the Bucks to signal that they've made Giannis Antetokounmpo available. To date Milwaukee has not and has even countered with whispered messaging that it remains in the market for roster upgrades to help Antetokounmpo, who remains sidelined indefinitely by the scourge of the NBA: A calf strain.There is a growing belief among trade-trackers that San Antonio and Houston, like Oklahoma City, do not plan to join the chase for Antetokounmpo even if the Bucks ultimately do decide to consider in-season proposals for their two-time MVP. All three of those teams, as you can imagine, like what they have going.marcstein.substack.com", "quote": "There is a growing belief among trade-trackers that San Antonio and Houston, like Oklahoma City, do not plan to join the chase for Antetokounmpo even if the Bucks ultimately do decide to consider in-season proposals for their two-time MVP. All three of those teams, as you can imagine, like what they have going", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/", "tags": ["Houston Rockets", "Milwaukee Bucks", "Oklahoma City Thunder", "San Antonio Spurs", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-14", "text": "League sources say that the Lakers would naturally like to be in the 3-and-D market this Trade Season, but it's a very limited market at this juncture, essentially headlined by Sacramento's Keon Ellis despite the fact that Ellis is playing seven fewer minutes per game this season under Kings coach Doug Christie than he did last season. We mentioned the other day that the Pelicans would insist on a significant haul to part with Herb Jones It's a price point is presumed to be beyond the Lakers’ current trade means.marcstein.substack.com", "quote": "League sources say that the Lakers would naturally like to be in the 3-and-D market this Trade Season, but it's a very limited market at this juncture, essentially headlined by Sacramento's Keon Ellis despite the fact that Ellis is playing seven fewer minutes per game this season under Kings coach Doug Christie than he did last season", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/", "tags": ["Los Angeles Lakers", "New Orleans Pelicans", "Sacramento Kings", "Trade", "Doug Christie", "Herb Jones", "Keon Ellis"]}, {"date": "", "archive_date": "2025-12-14", "text": "Michael A. Scotto:There is expected to be significant interest in Darius Garland leading up to the trade deadline, as some teams believe he could be a difference-maker as their primary option,per @MikeAScotto on The YES Network.x.com", "quote": "There is expected to be significant interest in Darius Garland leading up to the trade deadline, as some teams believe he could be a difference-maker as their primary option,", "outlet": "x.com", "source_url": "https://x.com/APH00PS/status/2000345603868635171?s=20", "tags": ["Cleveland Cavaliers", "Trade", "Darius Garland"]}, {"date": "", "archive_date": "2025-12-14", "text": "Mr. BuckBuck: Scotto:The Milwaukee Bucks are operating as if Giannis Antetokounmpo will remain with the team past the trade deadline and have been active on the trade market to continue building around him.x.com", "quote": "The Milwaukee Bucks are operating as if Giannis Antetokounmpo will remain with the team past the trade deadline and have been active on the trade market to continue building around him", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2000350186720424070?s=20", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-14", "text": "Mr. BuckBuck: Shai Gilgeous-Alexander on Thunder/Spurs becoming a rivalry:“Possibly, yeah, there’s a good chance. They’re young, really good, have a lot of talent, play the right way. Yeah, definitely a possibility. I’ve noticed that anything can happen in a couple of years.”x.com", "quote": "“Possibly, yeah, there’s a good chance. They’re young, really good, have a lot of talent, play the right way. Yeah, definitely a possibility. I’ve noticed that anything can happen in a couple of years.”", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2000343113559343313?s=20", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-14", "text": "Mr. BuckBuck:Scotto: Kon Knueppel is now viewed as the face of the Charlotte Hornets, but the franchise remains eager to evaluate the roster with LaMelo Ball, Brandon Miller, and Miles Bridges all healthy.x.com", "quote": "Scotto: Kon Knueppel is now viewed as the face of the Charlotte Hornets, but the franchise remains eager to evaluate the roster with LaMelo Ball, Brandon Miller, and Miles Bridges all healthy", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2000350292190413193?s=20", "tags": ["Charlotte Hornets", "Brandon Miller", "LaMelo Ball", "Miles Bridges", "Kon Knueppel"]}, {"date": "", "archive_date": "2025-12-14", "text": "Duane Rankin:\"We told them to stop throwing lobs against them.\"JJ Redick on facing Suns big Mark Williams.x.com", "quote": "\"We told them to stop throwing lobs against them.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2000350582629077360?s=20", "tags": ["Los Angeles Lakers", "Phoenix Suns", "JJ Redick", "Mark Williams"]}, {"date": "", "archive_date": "2025-12-14", "text": "Marc Stein:The Timberwolves have ruled out Anthony Edwards tonight against Sacramento with right foot soreness.x.com", "quote": "The Timberwolves have ruled out Anthony Edwards tonight against Sacramento with right foot soreness", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2000350466883125730?s=20", "tags": ["Minnesota Timberwolves", "Injuries", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-14", "text": "Marc Stein:The Mavericks are listing Anthony Davis as questionable for Monday's game in Utah with a left calf contusion. Davis has appeared in Dallas' past six games after missing 14 consecutive games with a left calf strain.x.com", "quote": "The Mavericks are listing Anthony Davis as questionable for Monday's game in Utah with a left calf contusion", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2000350028825768150?s=20", "tags": ["Dallas Mavericks", "Injuries", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-14", "text": "Kellan Olson:Devin Booker (right groin strain) and Dillon Brooks (left Achilles soreness) will go through their pregame warmups before the Suns decide if they are in or out, per Jordan Ott.x.com", "quote": "Devin Booker (right groin strain) and Dillon Brooks (left Achilles soreness) will go through their pregame warmups before the Suns decide if they are in or out, per Jordan Ott", "outlet": "x.com", "source_url": "https://x.com/KellanOlson/status/2000344764009660922?s=20", "tags": ["Phoenix Suns", "Injuries", "Devin Booker", "Dillon Brooks", "Jordan Ott"]}, {"date": "", "archive_date": "2025-12-14", "text": "New Orleans Pelicans:Zion Williamson (right adductor strain) is AVAILABLE tonight vs. Chicagox.com", "quote": "Zion Williamson (right adductor strain) is AVAILABLE tonight vs. Chicago", "outlet": "x.com", "source_url": "https://x.com/PelicansNBA/status/2000343599691727275?s=20", "tags": ["New Orleans Pelicans", "Injuries", "Zion Williamson"]}, {"date": "", "archive_date": "2025-12-14", "text": "Shams Charania:Kristaps Porzingis was diagnosed with the autonomic condition, postural orthostatic tachycardia syndrome (POTS), last season in Boston. He and doctors found solutions over the summer to manage his health and he entered the Hawks season in good condition -- before recent bout of illness.x.com", "quote": "Kristaps Porzingis was diagnosed with the autonomic condition, postural orthostatic tachycardia syndrome (POTS), last season in Boston. He and doctors found solutions over the summer to manage his health and he entered the Hawks season in good condition -- before recent bout of illness", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/2000310490829078570?s=20", "tags": ["Atlanta Hawks", "Injuries", "Kristaps Porzingis"]}, {"date": "", "archive_date": "2025-12-14", "text": "Greg Finberg:FINAL | WAS 108, IND 89Bagley: 23 PTS McCollum: 18 PTS Johnson: 14 PTS A dominant performance from the Wiz, who hold a team under 90 for the first time since 2021. Bagley was terrific down low. Career-high 14 REB from Champagnie. Contributions from Tre/CJ. Impressive. 4-20.x.com", "quote": "FINAL | WAS 108, IND 89", "outlet": "x.com", "source_url": "https://x.com/GregFinberg/status/2000332836734386295?s=20", "tags": ["Washington Wizards", "Statistics", "CJ McCollum", "Marvin Bagley"]}, {"date": "", "archive_date": "2025-12-14", "text": "Shams Charania:Atlanta Hawks C/F Kristaps Porzingis (illness) will miss the next two weeks and undergo further evaluations,sources tell ESPN. Both sides are prioritizing the long term of the season for Porzingis, who has missed seven of the last eight games.x.com", "quote": "Atlanta Hawks C/F Kristaps Porzingis (illness) will miss the next two weeks and undergo further evaluations,", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/2000307665407479999?s=20", "tags": ["Atlanta Hawks", "Injuries", "Kristaps Porzingis"]}, {"date": "", "archive_date": "2025-12-14", "text": "Michael Scotto:Brooklyn Nets head coach Jordi Fernández will miss tonight’s game vs. Milwaukee due to illness. Assistant Coach Steve Hetzel will coach in his place.x.com", "quote": "Brooklyn Nets head coach Jordi Fernández will miss tonight’s game vs. Milwaukee due to illness. Assistant Coach Steve Hetzel will coach in his place", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000294984868843731?s=20", "tags": ["Brooklyn Nets", "Health", "Steve Hetzel", "Jordi Fernandez"]}, {"date": "", "archive_date": "2025-12-14", "text": "Josh Lewenberg:Jamison Battle (ankle) has been upgraded to probable for tomorrow’s game in Miami. RJ Barrett remains out.x.com", "quote": "Jamison Battle (ankle) has been upgraded to probable for tomorrow’s game in Miami. RJ Barrett remains out", "outlet": "x.com", "source_url": "https://x.com/JLew1050/status/2000283328168292451?s=20", "tags": ["Miami Heat", "Toronto Raptors", "Injuries", "RJ Barrett", "Jamison Battle"]}, {"date": "", "archive_date": "2025-12-14", "text": "Varun Shankar: Rick Carlisle about #Wizards rookie Bub Carrington:\"He’s a terrific young player. He’s had a lot of good games against us … he’s skilled, he’s big, he’s versatile, he can play different positions. I think he’s a good defender, his shooting is the real deal.\"x.com", "quote": "\"He’s a terrific young player. He’s had a lot of good games against us … he’s skilled, he’s big, he’s versatile, he can play different positions. I think he’s a good defender, his shooting is the real deal.\"", "outlet": "x.com", "source_url": "https://x.com/ByVarunShankar/status/2000294205969850576?s=20", "tags": ["Indiana Pacers", "Washington Wizards", "Rick Carlisle", "Carlton Carrington"]}, {"date": "", "archive_date": "2025-12-14", "text": "Varun Shankar:I asked Carlisle if he had any player comps for Bub and he turned the question back on me. I said an upper echelon version could be Derrick White (doesn't get to the rim, shoots well, defends well). \"I agree with that,\" Carlsile said. (2/x)x.com", "quote": "I asked Carlisle if he had any player comps for Bub and he turned the question back on me. I said an upper echelon version could be Derrick White (doesn't get to the rim, shoots well, defends well)", "outlet": "x.com", "source_url": "https://x.com/ByVarunShankar/status/2000294207093723496?s=20", "tags": ["Boston Celtics", "Indiana Pacers", "Washington Wizards", "Rick Carlisle", "Derrick White", "Carlton Carrington"]}, {"date": "", "archive_date": "2025-12-14", "text": "Varun Shankar\"And also you know the opportunity to play alongside CJ McCollum, who's a really tremendous player ... CJ is a is a scoring guard that can run a team too.\"x.com", "quote": "\"And also you know the opportunity to play alongside CJ McCollum, who's a really tremendous player ... CJ is a is a scoring guard that can run a team too.\"", "outlet": "x.com", "source_url": "https://x.com/ByVarunShankar/status/2000294208201203765?s=20", "tags": ["Indiana Pacers", "Washington Wizards", "Rick Carlisle", "CJ McCollum", "Carlton Carrington"]}, {"date": "", "archive_date": "2025-12-14", "text": "Varun Shankar:Alex Sarr has not progressed to doing live work in practice,per Brian Keefe.x.com", "quote": "Alex Sarr has not progressed to doing live work in practice,", "outlet": "x.com", "source_url": "https://x.com/ByVarunShankar/status/2000277528380858602?s=20", "tags": ["Washington Wizards", "Brian Keefe", "Injuries", "Alex Sarr"]}, {"date": "", "archive_date": "2025-12-14", "text": "David Adelman said Julian Strawther “went pretty hard” at practice today. He’s going to check in with medical tomorrow before the Rockets game.“I’m very very hopeful that this week is the week,” Adelman said.x.com", "quote": "“I’m very very hopeful that this week is the week,” Adelman said", "outlet": "x.com", "source_url": "https://x.com/BrendanVogt/status/2000286069959655670?s=20", "tags": ["Denver Nuggets", "Houston Rockets", "Injuries", "David Adelman", "Julian Strawther"]}, {"date": "", "archive_date": "2025-12-14", "text": "Jon Krawczynski:Anthony Edwards remains out. He was limping noticeably in San Francisco. I still don’t think there’s concern about it being a long term issue, but always notable when a player who never misses games has now missed two straightx.com", "quote": "Anthony Edwards remains out. He was limping noticeably in San Francisco. I still don’t think there’s concern about it being a long term issue, but always notable when a player who never misses games has now missed two straight", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/2000284042504417431?s=20", "tags": ["Minnesota Timberwolves", "Injuries", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-14", "text": "Struggling for playing time with the New York Knicks, Guerschon Yabusele spoke about the tough season he is experiencing with the American franchise.The French international, who will play in the NBA Cup final next Tuesday, notably regrets a “complicated” communication with the coaching staff. “I don’t want to lie to you, it’s very difficult,” Guerschon Yabusele admitted on Saturday,December 13, in Las Vegas. The French forward is currently stuck with the New York Knicks, where his playing time in the NBA has been very limited.Ouest France", "quote": "The French international, who will play in the NBA Cup final next Tuesday, notably regrets a “complicated” communication with the coaching staff. “I don’t want to lie to you, it’s very difficult,” Guerschon Yabusele admitted on Saturday,", "outlet": "Ouest France", "source_url": "https://www.ouest-france.fr/sport/basket/guerschon-yabusele/nba-cest-tres-difficile-linternational-francais-guerschon-yabusele-dans-limpasse-avec-les-knicks-ff8e478e-d8c6-11f0-9f4a-0c1392737a7e", "tags": ["New York Knicks", "Mike Brown", "Guerschon Yabusele", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "“I don’t want to lie, it’s very difficult. I’m a competitor first and foremost, and this isn’t the situation I thought I’d be in when I arrived,” he said again. His coach, Mike Brown, said he would be “patient” with the Frenchman, whom he has used at several positions, including backup center (No. 5).“Last year, I spent most of the season playing center, so it’s not too complicated for me,” replied the player nicknamed “the Dancing Bear,” while regretting a “complicated” communication with the staff, which he notes is generally more individualistic in the NBA than in Europe.Ouest France", "quote": "“Last year, I spent most of the season playing center, so it’s not too complicated for me,” replied the player nicknamed “the Dancing Bear,” while regretting a “complicated” communication with the staff, which he notes is generally more individualistic in the NBA than in Europe", "outlet": "Ouest France", "source_url": "https://www.ouest-france.fr/sport/basket/guerschon-yabusele/nba-cest-tres-difficile-linternational-francais-guerschon-yabusele-dans-limpasse-avec-les-knicks-ff8e478e-d8c6-11f0-9f4a-0c1392737a7e", "tags": ["New York Knicks", "Mike Brown", "Guerschon Yabusele", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "Tony Allen: That man gave me $1,000 a dunk when he first met me.Zach Randolph: Well, you were trying to dunk, you were athletic? Paul Pierce: He had like five dunks that day. Randolph: He wanted to give you money. Oh, it was the Summer League. Allen: He had just won at the tables. He just won at the tables. He walked in. Pierce: I said ‘I won about 50,000. Allen: He just walked in with the bankroll like, ‘Yeah, I just won at the tables. I need some excitement. I got $1,000. I heard dunk? I said, ‘What? A thousand?’ And you know, November ain't hit yet. It's Summer League. I don't have an NBA dollar. That man said a thousand? I had five dunks in a row. No cap.YouTube", "quote": "Tony Allen: That man gave me $1,000 a dunk when he first met me.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=6O0jnE4vWSA&t=4459s", "tags": ["Boston Celtics", "Paul Pierce", "Zach Randolph", "Summer League", "Tony Allen"]}, {"date": "", "archive_date": "2025-12-14", "text": "Paul Pierce: I hated to lose. So when we came in, we started losing that f*cked with me. I have always been winning. In Inglewood, I went to Kansas, and I won. I didn't win a national championship, but we won a lot of games.Then so when my first time getting to the NBA and I'm under .500, I ain't never experienced that. So it was like, damn, we're 33 and 50. Like, you know what I'm saying? I was like, what the f*ck?Like, what is this? Yo, I want to get traded! Who wants to be here? So I signed a max contract. I walk into the locker room, like, all right, we are a losing team. Who wants to be here? Because I'm tired of losing.  I'm over here cuz I'm about to be here for the next five years.YouTube", "quote": "Then so when my first time getting to the NBA and I'm under .500, I ain't never experienced that. So it was like, damn, we're 33 and 50. Like, you know what I'm saying? I was like, what the f*ck?", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=6O0jnE4vWSA&t=1310s", "tags": ["Boston Celtics", "Paul Pierce"]}, {"date": "", "archive_date": "2025-12-14", "text": "Iman Shumpert: All in or all out; we will not have an American MVP for the next five years. Nate Robinson: Oh, that’s… I'm all in on that. I'm gonna tell you right now. Why? Because you got all the Canadians balling, you got the Greek Freak, you got Joker. I don't think there's going to be an American MVP in a while. Shumpert: So no Cade Cunningham, no Anthony Edwards. Robinson: They’ll have to deal with Wemby.I want Edwards to win, but if they play like the World versus USA, I feel like they have the upper hand right now.YouTube", "quote": "I want Edwards to win, but if they play like the World versus USA, I feel like they have the upper hand right now", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=D4CdrZsRf1A&t=694s", "tags": ["Detroit Pistons", "Minnesota Timberwolves", "Nate Robinson", "Iman Shumpert", "Anthony Edwards", "Cade Cunningham"]}, {"date": "", "archive_date": "2025-12-14", "text": "Nate Robinson:Steph Curry on his way out. Kevin Durant on his way out. Unless they just have some magical sprinkle fairy dust like they're Peter Pan and they can fly with them happy thoughts.Please explain to me who who’s gonna take over because Joker's averaging triple double. You got Luka Doncic going crazy. Triple-doubles. The Greek Freak is killing. You got Wemby who is about to come and take over, like who else is going to do that American-wise?YouTube", "quote": "Steph Curry on his way out. Kevin Durant on his way out. Unless they just have some magical sprinkle fairy dust like they're Peter Pan and they can fly with them happy thoughts.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=D4CdrZsRf1A&t=825s", "tags": ["Golden State Warriors", "Houston Rockets", "Los Angeles Lakers", "Kevin Durant", "Nate Robinson", "Stephen Curry", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-14", "text": "Iman Shumpert: If the NBA could expand to one more city, is Seattle a better pick than Vegas? Nate Robinson: All in for sure. Yes. We have better fans. Vegas are all tourists. That'sit. That's all it is. Seattle will be sold out every single night. No, hear me out. Shumpert: Again, if you live in Vegas, born and raised. I don't know why that man is talking like that. Robinson: Listen, because I'm from Seattle for one, and I'm a little biased. I know that if they open up the floodgates and say we have a team, we'll be sold out for years to come. We got fans that will put up the money.YouTube", "quote": "Iman Shumpert: If the NBA could expand to one more city, is Seattle a better pick than Vegas? Nate Robinson: All in for sure. Yes. We have better fans. Vegas are all tourists. That's", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=D4CdrZsRf1A&t=1126s", "tags": ["Nate Robinson", "Seattle SuperSonics", "Iman Shumpert"]}, {"date": "", "archive_date": "2025-12-14", "text": "Dirk Nowitzki did not hide his annoyance with Victor Wembanyama’s comments while speaking as a panelist Saturday on the Spurs-Thunder pregame show.“I do want to say, I didn’t love his answer about Chet Holmgren,” Nowitzki admitted. “I wish he would’ve given him a little bit of credit. You can say, ‘Hey, they have the MVP. Shai’s incredible, but Chet’s gotten better every year. He’s a champ.I want to play hard against them.’ “I didn’t love that answer. To me, it’s too swaggy, too dismissive of Chet.”Larry Brown Sports", "quote": "“I do want to say, I didn’t love his answer about Chet Holmgren,” Nowitzki admitted. “I wish he would’ve given him a little bit of credit. You can say, ‘Hey, they have the MVP. Shai’s incredible, but Chet’s gotten better every year. He’s a champ.", "outlet": "Larry Brown Sports", "source_url": "https://larrybrownsports.com/basketball/dirk-nowitzki-called-victor-wembanyama-out-chet-holmgren-comments/731135", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Dirk Nowitzki", "Victor Wembanyama", "Chet Holmgren"]}, {"date": "", "archive_date": "2025-12-14", "text": "NBA Courtside: Dirk did not like Wemby answer on Chet Holmgren.\"I wish he would've gave him a little credit. I didn't love that answer. To me it was too swaggy, too dismissive\"Twitter", "quote": "\"I wish he would've gave him a little credit. I didn't love that answer. To me it was too swaggy, too dismissive\"", "outlet": "Twitter", "source_url": "http://twitter.com/NBA__Courtside/status/2000022503859888633", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Dirk Nowitzki", "Victor Wembanyama", "Chet Holmgren"]}, {"date": "", "archive_date": "2025-12-14", "text": "NBA Courtside: Victor Wembanyama on his mactup with Chet Holmgren\"The MVP is on that court, he's our main focus. Anybody is hard to guard when the MVP is on the court\" ?Twitter", "quote": "\"The MVP is on that court, he's our main focus. Anybody is hard to guard when the MVP is on the court\" ?", "outlet": "Twitter", "source_url": "http://twitter.com/NBA__Courtside/status/2000021722104291814", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Shai Gilgeous-Alexander", "Victor Wembanyama", "Chet Holmgren"]}, {"date": "", "archive_date": "2025-12-14", "text": "Tim MacMahon: You guys obviously defending champs. Still an extraordinarily young team. The Spurs have a pretty impressive young core,too. Do you anticipate this becoming maybe the best rivalry in the league? Shai Gilgeous-Alexander: Possibly. Yeah, there's a good chance. They,like you said, are young, really good, have a lot of talent, play the right way, they play good brand of basketball. But yeah. Yeah, definitely, definitely is a possibility. I've noticed that like anything could happen in a couple years. So like yeah, it's definitely a possibility. Not 100%, but definitely a possibility for sure.YouTube", "quote": "too. Do you anticipate this becoming maybe the best rivalry in the league? Shai Gilgeous-Alexander: Possibly. Yeah, there's a good chance. They,", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=SdgW62nxPx8&t=345s", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Shai Gilgeous-Alexander", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-14", "text": "The Thunder's 16-game winning streak, which was a franchise record, was snapped with the loss. It's a rare feeling for OKC (24-2), which is on pace for a historically-great season.“We can’t be spoiled,\" Gilgeous-Alexander said. \"We can’t think we’re above anything. Us along with every team in the league, if you show up on a night and don’t do the necessary things to win, you probably won’t win.No matter how talented (you are). No matter what your record looks like. And that was the case for us tonight.\"The Oklahoman", "quote": "“We can’t be spoiled,\" Gilgeous-Alexander said. \"We can’t think we’re above anything. Us along with every team in the league, if you show up on a night and don’t do the necessary things to win, you probably won’t win.", "outlet": "The Oklahoman", "source_url": "https://www.oklahoman.com/story/sports/nba/thunder/2025/12/13/thunder-vs-spurs-score-nba-cup-shai-gilgeous-alexander-victor-wembanyama-stats/87757092007/", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-14", "text": "San Antonio Spurs big man Victor Wembanyama pondered a burning question after helping his team knock off the defending champion Oklahoma City Thunder 111-109 on Saturday night to advance to Tuesday's Emirates NBA Cup final. Playing in his first game in nearly a month, Wembanyama came off the bench for the first time in his career and entered the game at the start of the second quarter.\"Can you win the MVP and the Sixth Man [of the Year award] in the same year?\" he asked, smiling.ESPN", "quote": "\"Can you win the MVP and the Sixth Man [of the Year award] in the same year?\" he asked, smiling", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47300435/victor-wembanyama-spurs-shock-thunder-make-nba-cup-final", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "Ben Golliver: Spurs’ Victor Wembanyama after upsetting the Thunder in the NBA Cup semifinals:“I’m just glad to be part of something that’s growing to be so beautiful — pure and ethical basketball.”Twitter @BenGolliver", "quote": "“I’m just glad to be part of something that’s growing to be so beautiful — pure and ethical basketball.”", "outlet": "Twitter @BenGolliver", "source_url": "https://hoopshype.com/social/", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "Victor Wembanyama racked up 22 points, nine rebounds and two blocks in just 21 minutes. He posted a team-high plus-minus of 21. \"Huge, obviously,\" Daigneault said of Wembanyama's impact.\"He's got great two-way impact. He's obviously a rim deterrent. He's a problem on the glass and certainly was early. And then he caught his rhythm offensively and made some really tough shots down the stretch. Credit to him and them.\"The Oklahoman", "quote": "Victor Wembanyama racked up 22 points, nine rebounds and two blocks in just 21 minutes. He posted a team-high plus-minus of 21. \"Huge, obviously,\" Daigneault said of Wembanyama's impact.", "outlet": "The Oklahoman", "source_url": "https://www.oklahoman.com/story/sports/nba/thunder/2025/12/13/thunder-vs-spurs-score-nba-cup-shai-gilgeous-alexander-victor-wembanyama-stats/87757092007/", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "If the Spurs could play that well without their superstar — the player whom so many of their peers regard as the future face of the NBA — what could they accomplish when he ultimately returned? Now they and the Thunder and the rest of the NBA have an idea. And they did it on a large stage.“This (was) not a typical regular-season game, because we know that if we lose, we’re out,” Wembanyama said. “Some people are built for these moments, some aren’t.But we definitely are, and it shows, because it’s not against (just) anybody that we won that game. So it’s just, again, I feel lucky. I’m glad we have this group, because everybody buys into this and everybody is built for these moments.”New York Times", "quote": "“This (was) not a typical regular-season game, because we know that if we lose, we’re out,” Wembanyama said. “Some people are built for these moments, some aren’t.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6887164/2025/12/14/victor-wembanyama-return-nba-cup/", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "MrBuckBuck: Stephon Castle full postgame interview, after the Spurs beat the Thunder and secured a place in the NBA Cup Finals“People say [the Thunder] are unbeatable, but we come into every game feeling like we’re unbeatable too.”Twitter", "quote": "“People say [the Thunder] are unbeatable, but we come into every game feeling like we’re unbeatable too.”", "outlet": "Twitter", "source_url": "http://twitter.com/MrBuckBuckNBA/status/2000078747781767391", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "NBA Cup", "Stephon Castle"]}, {"date": "", "archive_date": "2025-12-14", "text": "NBA TV:“I’m having the most efficient year of my career.” ? De'Aaron Fox spoke with @ChrisBHaynes after dropping 22 PTSin the Spurs' @Emirates NBA Cup semifinal win!Twitter", "quote": "“I’m having the most efficient year of my career.” ? De'Aaron Fox spoke with @ChrisBHaynes after dropping 22 PTS", "outlet": "Twitter", "source_url": "http://twitter.com/NBATV/status/2000097696695071215", "tags": ["San Antonio Spurs", "De'Aaron Fox", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-14", "text": "The Thunder had a chance to send the game into overtime in the final second, but Caruso wasn't able to make what would have been a miraculous tip-in of Williams' intentionally missed free throw. Caruso and others in an Oklahoma City uniform thought there was contact on the play that could have merited a foul call, but Caruso said he didn't expect to get that kind of whistle with the game on the line.\"I don't know, maybe,\" Daigneault said when asked if there should have been a foul called on the play. \"But when we play like that, I just am not going to come up in here and rail about the officiating.No one wants to hear that, to be honest with you.\"ESPN", "quote": "\"I don't know, maybe,\" Daigneault said when asked if there should have been a foul called on the play. \"But when we play like that, I just am not going to come up in here and rail about the officiating.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47301200/thunder-shrug-loss-spurs-excited-challenge", "tags": ["Oklahoma City Thunder", "Referees", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-14", "text": "Yahoo Sports:\"F***ing dumb.\" ? Alex Caruso was not happy following the loss to the Spurs.Twitter", "quote": "\"F***ing dumb.\" ? Alex Caruso was not happy following the loss to the Spurs.", "outlet": "Twitter", "source_url": "http://twitter.com/YahooSports/status/2000074684042485978", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Referees", "Alex Caruso", "Isaiah Hartenstein"]}, {"date": "", "archive_date": "2025-12-14", "text": "Tyler Kolek finished a team-best plus-17. It was likely his best game of the season — and perhaps career.“Tyler did a fantastic job today, our young fella, of impacting winning,” Karl-Anthony Towns said.“He did that on a big stage tonight. I think one of his finest games as an NBA player was tonight, and may not show up on the stats sheet, but everybody in our locker room knows how important he was to us tonight. And if you were watching the game as a Knicks fan or just a fan of basketball, he showed what it is to be ready and to be ready for his opportunity, and he maximized it tonight.”New York Post", "quote": "“Tyler did a fantastic job today, our young fella, of impacting winning,” Karl-Anthony Towns said.", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/14/sports/tyler-kolek-delivers-a-knicks-statement-with-miles-mcbride-out/", "tags": ["New York Knicks", "Karl-Anthony Towns", "Tyler Kolek"]}, {"date": "", "archive_date": "2025-12-14", "text": "Asked about the Los Angeles Clippers' decision to waive Chris Paul last week, Fox reflected on how the future Hall of Famer welcomed him to the Spurs last February.\"CP was great,\" said Fox, who came to the Spurs from Sacramento in a three-team trade. \"He was a professional. He was a vet. As soon as I got here, he asked me, where do I want the ball, what spots do I like, things of that nature.Things you've seen from him through his prime when he was in New Orleans, when he first got to L.A. \"Those are the things that I kind of expected from him, and being that vet and being the person that everybody called 'Point God.' \"San Antonio Express-News", "quote": "\"CP was great,\" said Fox, who came to the Spurs from Sacramento in a three-team trade. \"He was a professional. He was a vet. As soon as I got here, he asked me, where do I want the ball, what spots do I like, things of that nature.", "outlet": "San Antonio Express-News", "source_url": "https://www.expressnews.com/sports/spurs/article/mitch-johnson-touts-tough-nba-cup-competition-21240691.php", "tags": ["Los Angeles Clippers", "San Antonio Spurs", "Chris Paul", "De'Aaron Fox"]}, {"date": "", "archive_date": "2025-12-14", "text": "Jalen Suggs and the Magic will head back to Orlando on Sunday, and he is expected to be evaluated to see how long he could be sidelined. \"It's the part that sucks the most,\" Suggs said of having to miss time with an injury. \"I truly tried [to play].There's nowhere else I would have rather been than on the court battling with my guys, especially in a close game. But [God] be having other plans, and I can't be mad at his plans.\" Suggs, who struggled to get to his feet and walk out of the locker room after the game, otherwise shut down any questions about being forced to leave the game. \"I don't even know,\" he said when asked what happened. \"We'll figure out what it is.\"ESPN", "quote": "Jalen Suggs and the Magic will head back to Orlando on Sunday, and he is expected to be evaluated to see how long he could be sidelined. \"It's the part that sucks the most,\" Suggs said of having to miss time with an injury. \"I truly tried [to play].", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47299287/magic-suggs-awaits-tests-limping-hip-injury", "tags": ["Orlando Magic", "Injuries", "Jalen Suggs"]}, {"date": "", "archive_date": "2025-12-14", "text": "But unlike Victor Wembanyama? This famous Frenchman had the decades of perspective to recognize how familiar it all looks.“The DNA is still there,” Tony Parker told the Express-News this weekend of a Spurs franchise trying to revive its glory days. “It’s the culture and everything we built for 20 years. But it’s kind of a modern way.”San Antonio Express-News", "quote": "“The DNA is still there,” Tony Parker told the Express-News this weekend of a Spurs franchise trying to revive its glory days. “It’s the culture and everything we built for 20 years. But it’s kind of a modern way.”", "outlet": "San Antonio Express-News", "source_url": "https://www.expressnews.com/sports/spurs/article/tony-parker-stephon-castle-dylan-harper-21240376.php", "tags": ["San Antonio Spurs", "Tony Parker", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-14", "text": "It's about the reigning Rookie of the Year and the most recent No. 2 pick in the NBA draft making their forebearers proud, too.“They’re so fearless,” Parker said of Stephon Castle and Dylan Harper. “That’s how I was. That’s how Manu (Ginobili) was.”San Antonio Express-News", "quote": "“They’re so fearless,” Parker said of Stephon Castle and Dylan Harper. “That’s how I was. That’s how Manu (Ginobili) was.”", "outlet": "San Antonio Express-News", "source_url": "https://www.expressnews.com/sports/spurs/article/tony-parker-stephon-castle-dylan-harper-21240376.php", "tags": ["San Antonio Spurs", "Tony Parker", "Manu Ginobili", "Stephon Castle", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-14", "text": "We asked Brian Windhorst how he views NBA Europe and how much it’s talked about in the United States. “Very little. The NBA will do what it wants. I don’t believe it will be successful, because I think there isn’t enough talent in the EuroLeague right now.I also think it will be very challenging to create teams from scratch and expect results. I completely understand why the NBA is doing this, and I’m sure they’ll try. I hope it succeeds, because I think that if there were a very strong European championship, competitions could be created with the NBA, with Africa, Australia, and Asia, and that would be fantastic.”mozzartsport.com", "quote": "We asked Brian Windhorst how he views NBA Europe and how much it’s talked about in the United States. “Very little. The NBA will do what it wants. I don’t believe it will be successful, because I think there isn’t enough talent in the EuroLeague right now.", "outlet": "mozzartsport.com", "source_url": "https://www.mozzartsport.com/ko%C5%A1arka/vesti/intervju-brajan-vindhorst-jokic-je-savladao-kosarku-a-tek-ulazi-u-najbolje-godine/530794", "tags": ["Euroleague", "Brian Windhorst", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-14", "text": "Still, he doesn’t hide that he’s skeptical. “I’m skeptical because I’ve spent a lot of time in Europe, and Europeans don’t experience basketball the way Americans do. You can’t just take an American league, put it in Europe, and say: ‘Here, play.’It simply doesn’t work that way. And from what I’ve heard about this league, they’re trying to transfer the American league to Europe. That’s why I understand why they’re doing it. I hope it works, because if you’re investing in basketball in Europe, that’s probably a good thing. You could also argue the opposite: the reason European basketball isn’t stronger is that there hasn’t been enough investment, and someone has to do that—and it hasn’t been done enough in Europe. Americans believe there’s a lot of untapped potential and that they can develop it.”mozzartsport.com", "quote": "Still, he doesn’t hide that he’s skeptical. “I’m skeptical because I’ve spent a lot of time in Europe, and Europeans don’t experience basketball the way Americans do. You can’t just take an American league, put it in Europe, and say: ‘Here, play.’", "outlet": "mozzartsport.com", "source_url": "https://www.mozzartsport.com/ko%C5%A1arka/vesti/intervju-brajan-vindhorst-jokic-je-savladao-kosarku-a-tek-ulazi-u-najbolje-godine/530794", "tags": ["Euroleague", "Brian Windhorst", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-14", "text": "We also asked him for his opinion on the All-Star Game, where this year Team USA will play against Team World. The NBA’s goal is to make the game itself more interesting. “I hope that’s true, but I’m skeptical it will happen. It would be great for the All-Star Game if Team World won. But I’ve given up on the All-Star Game. I don’t go anymore.Last year I didn’t even watch it. I couldn’t tell you a single thing that happened in last year’s All-Star Game. If the Americans play at full intensity and the World—basically Europeans and Canadians—play at full strength and the World wins, that would be great. I think the NBA would secretly love for the World to win, so there’d be a little shame among the Americans. But my problem is that I know there actually wouldn’t be any shame. When it comes to an exhibition game, Americans are just there to have fun.”mozzartsport.com", "quote": "We also asked him for his opinion on the All-Star Game, where this year Team USA will play against Team World. The NBA’s goal is to make the game itself more interesting. “I hope that’s true, but I’m skeptical it will happen. It would be great for the All-Star Game if Team World won. But I’ve given up on the All-Star Game. I don’t go anymore.", "outlet": "mozzartsport.com", "source_url": "https://www.mozzartsport.com/ko%C5%A1arka/vesti/intervju-brajan-vindhorst-jokic-je-savladao-kosarku-a-tek-ulazi-u-najbolje-godine/530794", "tags": ["Brian Windhorst", "All-Star"]}, {"date": "", "archive_date": "2025-12-14", "text": "Tyrese Haliburton attended John Cena’s final WWE match at Saturday Night’s Main Event in Washington, D.C., watching alongside his father as the legendary wrestler closed the book on a historic career. Cena’s farewell match came against Gunther, with the WWE icon putting his body on the line one last time in front of a packed Capital One Arena. Cena was driving the match and the night valiantly, but the moment that stunned fans, and Haliburton, came when he ultimately tapped out of Gunther's sleeper hold, in his final appearance, with Haliburton’s visible reaction reflecting the shock felt throughout the arena.Clutch Points", "quote": "Tyrese Haliburton attended John Cena’s final WWE match at Saturday Night’s Main Event in Washington, D.C., watching alongside his father as the legendary wrestler closed the book on a historic career", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/indiana-pacers/pacers-news-tyrese-haliburton-john-cenas-wwe-match-snme", "tags": ["Indiana Pacers", "Wrestling", "WWE", "Tyrese Haliburton", "John Cena"]}, {"date": "", "archive_date": "2025-12-14", "text": "WWE:Speechless. ?Twitter", "quote": "Speechless. ?", "outlet": "Twitter", "source_url": "http://twitter.com/WWE/status/2000040303940509775", "tags": ["Indiana Pacers", "Wrestling", "WWE", "Tyrese Haliburton", "John Cena"]}, {"date": "", "archive_date": "2025-12-14", "text": "So when Kevin needed to make it look like there was a hoppin’ Christmas party happening at his house when the Wet Bandits pulled up, he strapped a cardboard Michael Jordan “Measure Up” standee growth chart to a toy train to make it look like it was moving around the house. Now, this growth chart came in two forms: cardboard standee and traditional poster. The McCallisters had both, as the poster version was visible in Buzz’s room early in the film.The poster has sold for anywhere from $58-$275 on eBay recently, while the cardboard standee commands a premium, selling for $300-$560.Of course, Kevin mangled the one in his house, cutting off the basketball, measurement graphic and right arm at the elbow (which he then reattached), thus reducing its resale value.New York Times", "quote": "The poster has sold for anywhere from $58-$275 on eBay recently, while the cardboard standee commands a premium, selling for $300-$560.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6885885/2025/12/14/home-alone-michael-jordan-starting-lineup/", "tags": ["Michael Jordan", "Memorabilia", "eBay"]}, {"date": "", "archive_date": "2025-12-14", "text": "Ben Golliver: Spurs'Stephon Castle on eliminating the Thunder from the NBA Cup: \"It shows we’re serious. ... People were saying they were unbeatable.\"Twitter @BenGolliver", "quote": "Stephon Castle on eliminating the Thunder from the NBA Cup: \"It shows we’re serious. ... People were saying they were unbeatable.\"", "outlet": "Twitter @BenGolliver", "source_url": "https://hoopshype.com/social/", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Stephon Castle"]}, {"date": "", "archive_date": "2025-12-14", "text": "Tim MacMahon:“Party in the USA” is blaring from the Spurs’ locker room after they snapped the Thunder’s 16-game winning streak.Twitter", "quote": "“Party in the USA” is blaring from the Spurs’ locker room after they snapped the Thunder’s 16-game winning streak", "outlet": "Twitter", "source_url": "http://twitter.com/BannedMacMahon/status/2000070802495193366", "tags": ["Oklahoma City Thunder", "San Antonio Spurs"]}, {"date": "", "archive_date": "2025-12-14", "text": "Justin Martinez:Mark Daigneault on what led to OKC’s offense becoming stagnant at times tonight: “It wasn’t our sharpest night. I thought certainly our attacks weren’t as sharp as they’ve been.That did get it to be stagnant. They’re a good team. Credit them. They played great.”Twitter", "quote": "Mark Daigneault on what led to OKC’s offense becoming stagnant at times tonight: “It wasn’t our sharpest night. I thought certainly our attacks weren’t as sharp as they’ve been.", "outlet": "Twitter", "source_url": "http://twitter.com/Justintohoops/status/2000074718314213597", "tags": ["Oklahoma City Thunder", "Coaching", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-14", "text": "Manu Ginobili: What a game by the @spurs! Great work by the whole team.Super proud of these guys! Intense game!Twitter @manuginobili", "quote": "Manu Ginobili: What a game by the @spurs! Great work by the whole team.", "outlet": "Twitter @manuginobili", "source_url": "https://hoopshype.com/social/tweets/", "tags": ["San Antonio Spurs", "Manu Ginobili", "Social Media"]}, {"date": "", "archive_date": "2025-12-14", "text": "Marc Stein:The Victor Wembanyama-led Spurs hang on to win 111-109 ... dropping the Thunder to 24-2 and bringing a halt to OKC's 16-game win streak. Either San Antonio or New York will be the NBA's third NBA Cup champion.Twitter @TheSteinLine", "quote": "The Victor Wembanyama-led Spurs hang on to win 111-109 ... dropping the Thunder to 24-2 and bringing a halt to OKC's 16-game win streak", "outlet": "Twitter @TheSteinLine", "source_url": "https://hoopshype.com/social/", "tags": ["New York Knicks", "Oklahoma City Thunder", "San Antonio Spurs", "Statistics", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-13", "text": "Tim Reynolds: Josh Hart on Jalen Brunson's ranking as a scorer: \"Barely 6-foot guard. Not physically impressive, not athletic ... big head so he has a big brain.He's able to figure out angles and find himself in position to be successful. Inch for inch, I think he's probably the best one.\"Twitter @ByTimReynolds", "quote": "He's able to figure out angles and find himself in position to be successful. Inch for inch, I think he's probably the best one.\"", "outlet": "Twitter @ByTimReynolds", "source_url": "https://hoopshype.com/social/", "tags": ["New York Knicks", "Josh Hart", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-13", "text": "Tom Orsborn: Per Spurs media relations staffer Jordan Howenstine:As of today, Spurs have been on the road for 20 of the last 22 days. Since Nov. 20, they’ve played just one home game. Nevada is the 10th state in that stretch they’ve played in.It’s a journey that’s covered more than 5,000 miles.Bluesky", "quote": "As of today, Spurs have been on the road for 20 of the last 22 days. Since Nov. 20, they’ve played just one home game. Nevada is the 10th state in that stretch they’ve played in.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/tomorsborn.bsky.social/post/3m7w2inegc22i", "tags": ["San Antonio Spurs", "Statistics", "NBA Schedule"]}, {"date": "", "archive_date": "2025-12-13", "text": "NBA on Prime:De'Aaron Fox surprises @Blake Griffin with a Luke Kornet t-shirt#NBAonPrimeTwitter", "quote": "De'Aaron Fox surprises @Blake Griffin with a Luke Kornet t-shirt", "outlet": "Twitter", "source_url": "http://twitter.com/NBAonPrime/status/2000030327419322472", "tags": ["San Antonio Spurs", "Blake Griffin", "Frivolities", "De'Aaron Fox", "Luke Kornet"]}, {"date": "", "archive_date": "2025-12-13", "text": "Jason Beede: #Magic coachJamahl Mosley said Jalen Suggs is dealing with a sore hip (as the team said earlier). “We’re going to look at it when we get back,but at the end of the day, he’s a warrior for being out there dealing with what he’s been dealing with,” Mosley said of Suggs.Twitter @therealBeede", "quote": "Jamahl Mosley said Jalen Suggs is dealing with a sore hip (as the team said earlier). “We’re going to look at it when we get back,", "outlet": "Twitter @therealBeede", "source_url": "https://hoopshype.com/social/", "tags": ["Orlando Magic", "Coaching", "Injuries", "Jamahl Mosley", "Jalen Suggs"]}, {"date": "", "archive_date": "2025-12-13", "text": "Boston Celtics:A statement from the Boston Celtics.Twitter @celtics", "quote": "A statement from the Boston Celtics", "outlet": "Twitter @celtics", "source_url": "http://twitter.com/celtics/status/2000030055108636957", "tags": ["Boston Celtics", "Law", "Social Media"]}, {"date": "", "archive_date": "2025-12-13", "text": "Chris Haynes: Future Hall of FamerChris Paul will be in attendance for tonight’s matchup between the San Antonio Spurs and Oklahoma City Thunder.Paul played for both teams.Twitter @ChrisBHaynes", "quote": "Chris Paul will be in attendance for tonight’s matchup between the San Antonio Spurs and Oklahoma City Thunder.", "outlet": "Twitter @ChrisBHaynes", "source_url": "https://hoopshype.com/social/", "tags": ["Los Angeles Clippers", "Oklahoma City Thunder", "San Antonio Spurs", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-13", "text": "NBA on Prime:\"I work way too hard not to be confident ... my game is unique.\" Jalen Brunson tells the crew about the parts of his game that keep getting better.Twitter", "quote": "\"I work way too hard not to be confident ... my game is unique.\" Jalen Brunson tells the crew about the parts of his game that keep getting better", "outlet": "Twitter", "source_url": "http://twitter.com/NBAonPrime/status/2000021187255013653", "tags": ["New York Knicks", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-13", "text": "Josh Robbins: After today's game, Magic coachJamahl Mosley said Moe Wagner will not play on the Magic’s upcoming trip to Denver, Salt Lake City, San Francisco and Portland.Wagner tore his ACL nearly one year ago and has been working his way back.Twitter @JoshuaBRobbins", "quote": "Jamahl Mosley said Moe Wagner will not play on the Magic’s upcoming trip to Denver, Salt Lake City, San Francisco and Portland.", "outlet": "Twitter @JoshuaBRobbins", "source_url": "https://hoopshype.com/social/", "tags": ["Orlando Magic", "Injuries", "Moritz Wagner"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mike Finger:Victor Wembanyama will not start tonight. Coming off the bench for the first time in his NBA career.Bluesky", "quote": "Victor Wembanyama will not start tonight. Coming off the bench for the first time in his NBA career", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/mikefinger.bsky.social/post/3m7vyvypu7c2l", "tags": ["San Antonio Spurs", "Victor Wembanyama"]}]