[{"date": "", "archive_date": "2025-12-09", "text": "Iisalo tagged up when he led teams in Germany and France before coming to the NBA. He’s implemented many of those concepts in his new home. The Grizzlies send at least three crashers to the glass on 18.8 percent of their shots, the fourth-highest frequency in the league.“It’s very hard to get into the low 120s in offensive rating (points per 100 possessions) without the offensive rebounding,” Iisalo said.“That’s what it takes to be an elite offensive team nowadays.”New York Times", "quote": "“It’s very hard to get into the low 120s in offensive rating (points per 100 possessions) without the offensive rebounding,” Iisalo said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["Memphis Grizzlies", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-09", "text": "For years, NBA teams made a choice: Either go for offensive boards or favor transition defense. By the 2010s, just about every organization had chosen the latter strategy. This is why Henare stood out. Not only did his teams maul the offensive glass, sending all five guys to the paint when the shot went up, but they also weren’t allowing easy buckets on the other end. So, leading into the Tokyo Olympics in 2021, Brown set up a video call with Henare. He wanted to learn about the strategy referred to as “tagging up,” in which everyone crashes the offensive boards, though not recklessly. There are fundamentals behind tagging up, as Henare explained to Brown. When players crash, they aren’t golden retrievers playing fetch.Instead, they approach defenders at specific areas of the floor, meeting from behind, pinning those defenders into wherever they’re planted and blocking their pathways to leak out in transition or to retrieve long rebounds, which have grown more common with the popularity of the 3-pointer. The opposite effect held true, too. The more crashers there were, the more defenders had to stay back to box them out.New York Times", "quote": "Instead, they approach defenders at specific areas of the floor, meeting from behind, pinning those defenders into wherever they’re planted and blocking their pathways to leak out in transition or to retrieve long rebounds, which have grown more common with the popularity of the 3-pointer", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["New York Knicks", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-09", "text": "Maine went even more radical than the summer Celtics did, routinely crashing four guys for offensive rebounds, a strategy the squad’s head coach, Alex Barlow, was hesitant to implement at first. With encouragement from a member of the Celtics’ analytics department, Drew Cannon, as well as from his coaching analytics-focused assistant in the G League, Alex Merg, he changed his mind. “Our whole philosophy was, let’s send everybody and let’s see how it works,” Barlow said. “Let’s see if the trade-off is a net positive.” The outcome was decisive.Maine won rebounding battle after rebounding battle, creating extra shooting chances more nights than not, all while its transition defense remained in the top half of the league.The team wasn’t tagging up, the strategy where it pins those opponents from behind, but a stampede of crashers meant the enemy couldn’t scamper in the opposite direction. Doing so would increase the chances of another offensive rebound.New York Times", "quote": "Maine won rebounding battle after rebounding battle, creating extra shooting chances more nights than not, all while its transition defense remained in the top half of the league.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["Boston Celtics", "G League"]}, {"date": "", "archive_date": "2025-12-09", "text": "In the first three seasons of tracking data in the mid-2010s, plays featuring a post-up at any point averaged just 89 points per 100 chances. Since 2022-23, however, that number is 103 points per 100 chances -- about four ticks higher than the average half-court play overall.This season, that gap is even wider: 103.9 points per 100 plays with a post-up versus 99.0 points per 100 half-court plays overall, a difference of 4.9 points.ESPN", "quote": "This season, that gap is even wider: 103.9 points per 100 plays with a post-up versus 99.0 points per 100 half-court plays overall, a difference of 4.9 points.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["Statistics", "Analytics"]}, {"date": "", "archive_date": "2025-12-09", "text": "And Jokic was so dominant in such a large share of post-ups that he alone raised the entire league's post-up efficiency by 1.1 points per 100 possessions. This relationship between falling post-up frequency and rising post-up efficiency reveals the trend's first broad lesson: Stars play by different rules, and rather than dictate a one-size-fits-all strategy, analytics work best when they account for individual player profiles.\"If you've got guys that are uniquely gifted,\" Detroit Pistons coach J.B. Bickerstaff said, \"you've got to try your best to put them in positions of strength, even if it may be a zag from what the rest of the league is doing.\"ESPN", "quote": "\"If you've got guys that are uniquely gifted,\" Detroit Pistons coach J.B. Bickerstaff said, \"you've got to try your best to put them in positions of strength, even if it may be a zag from what the rest of the league is doing.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["Denver Nuggets", "Detroit Pistons", "Nikola Jokic"]}, {"date": "", "archive_date": "2025-12-09", "text": "But as San Antonio Spurs coach Mitch Johnson noted, Wembanyama's post opportunities typically come higher up the floor near the elbow, giving him more space to operate and work off the teammates orbiting him on the perimeter. \"Us walking up the basketball and throwing it to him on the low block and everybody staring at him to make everything happen probably isn't something that we're [going to do],\" Johnson said. \"I think sometimes we blur the traditional sense of what we view as a post-up.\"Most teams follow that philosophy in 2025: According to tracking data, a much higher percentage of post-ups start on the move now, compared to a decade ago, while the number that start with a staid, traditional entry pass has plummeted.ESPN", "quote": "Most teams follow that philosophy in 2025: According to tracking data, a much higher percentage of post-ups start on the move now, compared to a decade ago, while the number that start with a staid, traditional entry pass has plummeted", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["San Antonio Spurs", "Statistics", "Analytics", "Mitch Johnson", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-09", "text": "Vucevic said he tells younger players they should still invest practice time honing those post-up basics, even if they've become a less important part of the sport overall. And some team executives agree with these veteran centers. They don't expect a major uptick in post-up frequency anytime soon.But because so much of modern NBA offense is about attacking mismatches, they view a capable post-up scorer as the \"ultimate release valve,\" as one Eastern Conference executive said.ESPN", "quote": "But because so much of modern NBA offense is about attacking mismatches, they view a capable post-up scorer as the \"ultimate release valve,\" as one Eastern Conference executive said", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["Chicago Bulls", "Nikola Vucevic", "Statistics", "Analytics"]}, {"date": "", "archive_date": "2025-12-09", "text": "“People are going to call us crazy, but I think we’re a contender,” Adebayo said. “We’re going to be called delusional. But how I look at delusion [is] if you ask how many people could be NBA players, what is the percentage of that?So, you’ve got to have a little bit of delusion when it comes to speaking stuff into existence. “Like I always say, ‘Speak stuff into existence that matters.’ Manifest things that matter. Being able to just dream about that, write it down and keep looking at that. That goes a long way. And some of that is real. So, I think we’re contenders when we’re fully healthy.”Andscape", "quote": "So, you’ve got to have a little bit of delusion when it comes to speaking stuff into existence", "outlet": "Andscape", "source_url": "https://andscape.com/features/bam-adebayo-in-the-drivers-seat-for-miami-heat/", "tags": ["Miami Heat", "Bam Adebayo"]}, {"date": "", "archive_date": "2025-12-09", "text": "Bennett Durando: David Adelman: \"I think we don't freak out as much as maybe the outside noise does. I know losing at home is never good. But winning on the road this many times is also very good. ...There's only one OKC right now. Then there's us, Lakers, Houston, San Antonio & you keep going.\"x.com", "quote": "There's only one OKC right now. Then there's us, Lakers, Houston, San Antonio & you keep going.\"", "outlet": "x.com", "source_url": "https://x.com/BennettDurando/status/1998546339425362056", "tags": ["Houston Rockets", "Los Angeles Lakers", "San Antonio Spurs", "David Adelman"]}, {"date": "", "archive_date": "2025-12-09", "text": "Josh Lewenberg:Immanuel Quickley will miss tonight’s NBA Cup quarterfinals game with an illness.Jamal Shead is available (and will presumably get plenty of run with IQ out).x.com", "quote": "Immanuel Quickley will miss tonight’s NBA Cup quarterfinals game with an illness.", "outlet": "x.com", "source_url": "https://x.com/JLew1050/status/1998540119771435413", "tags": ["Toronto Raptors", "Injuries", "Immanuel Quickley", "Jamal Shead", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Brandon Rahbar:Shai Gilgeous-Alexander is available to play tomorrow vs the Suns. Lu Dort and Alex Caruso are back. Merry Christmas, Thunder fans.x.com", "quote": "Shai Gilgeous-Alexander is available to play tomorrow vs the Suns", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998535987635331531", "tags": ["Oklahoma City Thunder", "Phoenix Suns", "Injuries", "Alex Caruso", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-09", "text": "Kellan Olson:Devin Booker (right groin strain) has been upgraded to questionable for the Suns tomorrow against the Thunder in the NBA Cup quarterfinals.x.com", "quote": "Devin Booker (right groin strain) has been upgraded to questionable for the Suns tomorrow against the Thunder in the NBA Cup quarterfinals", "outlet": "x.com", "source_url": "https://x.com/KellanOlson/status/1998535800863306011", "tags": ["Oklahoma City Thunder", "Phoenix Suns", "Injuries", "Devin Booker", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Ira Winderman:Pelle Larsson with a sprained left ankle, questionable to return.x.com", "quote": "Pelle Larsson with a sprained left ankle, questionable to return", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/1998546290410742220", "tags": ["Miami Heat", "Injuries", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-09", "text": "DLLS Mavs:Ryan Nembhard donated $5,000 to the local Boys and Girls Club!x.com", "quote": "Ryan Nembhard donated $5,000 to the local Boys and Girls Club!", "outlet": "x.com", "source_url": "https://x.com/DLLS_Mavs/status/1998540203154096269", "tags": ["Dallas Mavericks", "Philanthropy", "Ryan Nembhard"]}, {"date": "", "archive_date": "2025-12-09", "text": "Thankfullyfor all involved, it sounds like Iisalo will be leaning into Jackson Jr.'s offensive skillset a bit more now that Edey is settled into the rotations. “There are several components there that make (Jackson Jr.) a great player,” noted the Finnish tactician.“He is a very good player on the perimeter, very good player on the inside, it's just a matter of time before (his stats) are up again.”Clutch Points", "quote": "Thankfully", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/memphis-grizzlies/grizzlies-being-stubborn-passing-up-jaren-jackson-jr-offense", "tags": ["Memphis Grizzlies", "Jaren Jackson Jr", "Zach Edey", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-09", "text": "Though Sabonis has missed a significant amount of time due to a partially torn meniscus in his knee, his name has been thrown in trade speculation. However, NBA insider Sam Amick would say on FanDuel's “Run It Back” show that he spoke to Sabonis' camp, and there was not an expectation that he would be dealt at the trade deadline.“I’ve talked to his camp recently. It does not sound like they anticipate being moved at the deadline,” Amick said.“It’s more a message of patience. And he really likes living in the area, and as far as quality of life, he’s doing okay.”Clutch Points", "quote": "“I’ve talked to his camp recently. It does not sound like they anticipate being moved at the deadline,” Amick said.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/sacramento-kings/kings-news-domantas-sabonis-camp-sends-clear-signal-trade-buzz", "tags": ["Sacramento Kings", "Trade", "Domantas Sabonis"]}, {"date": "", "archive_date": "2025-12-09", "text": "Kevin Gray Jr.: I’ve reached out to multiple sources with knowledge regarding the report that Mavericks C Dwight Powell intends to retire at the end of the year.At this time those sources say they can not confirm the report that Powell intends to retire with one source saying it was “news to them.”#MFFLx.com", "quote": "At this time those sources say they can not confirm the report that Powell intends to retire with one source saying it was “news to them.”", "outlet": "x.com", "source_url": "https://x.com/KevinGraySports/status/1998521592683323805", "tags": ["Dallas Mavericks", "Dwight Powell"]}, {"date": "", "archive_date": "2025-12-09", "text": "Dave McMenamin:“To be back reintroduced to it can definitely, I guess you can say, had me be a reborn person.Like a little kid on the first day of school again.” — Marcus Smart on what being a part of LAL this season has done for him after his career took a detour from stability after Bostonx.com", "quote": "“To be back reintroduced to it can definitely, I guess you can say, had me be a reborn person.", "outlet": "x.com", "source_url": "https://x.com/mcten/status/1998504586135613700", "tags": ["Los Angeles Lakers", "Marcus Smart"]}, {"date": "", "archive_date": "2025-12-09", "text": "Clemente Almanza: Ajay Mitchell on his ‘Belgian Waffle’ moment:“They asked me to do 2 — 1 serious, 1 funny… Didn’t expect them to put it out…People from my school were a little upset. Gotta shoutout UC Santa Barbara.”x.com", "quote": "“They asked me to do 2 — 1 serious, 1 funny… Didn’t expect them to put it out…", "outlet": "x.com", "source_url": "https://x.com/CAlmanza1007/status/1998454404693823944", "tags": ["Oklahoma City Thunder", "Frivolities", "Ajay Mitchell"]}, {"date": "", "archive_date": "2025-12-09", "text": "Damichael Cole:On 12/12, No. 12 (Ja Morant) for the Grizzlies is treating fans with 250 tickets. More details ??x.com", "quote": "On 12/12, No. 12 (Ja Morant) for the Grizzlies is treating fans with 250 tickets", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1998430419877007369", "tags": ["Memphis Grizzlies", "Philanthropy", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-09", "text": "Mike Curtis:#Mavs rookie Ryan Nembhard made a surprise visit to East Dallas Boys & Girls Club this afternoon.x.com", "quote": "#Mavs rookie Ryan Nembhard made a surprise visit to East Dallas Boys & Girls Club this afternoon", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/1998528657657315838", "tags": ["Dallas Mavericks", "Philanthropy", "Ryan Nembhard"]}, {"date": "", "archive_date": "2025-12-09", "text": "As he looks ahead, Paul says he’s still waiting to see exactly how the rest of the season unfolds. But one feeling has caught him off guard.“I’m actually at peace with everything,” he says.“More than anything, I’m excited about being around and getting a chance to play a small role in whatever anything looks like next.”People", "quote": "“I’m actually at peace with everything,” he says.", "outlet": "People", "source_url": "https://people.com/chris-paul-opens-up-after-getting-cut-from-clippers-exclusive-11864716", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-09", "text": "Law Murray: Tyronn Lue:\"When we first came into the season, we thought we had a great team, we thought we had a great chance.And so when you lose Bradley Beal, when you lose Kawhi, you lose Derrick Jones, you lose Bogie, things can get hard. And so they have been hard for us\"x.com", "quote": "\"When we first came into the season, we thought we had a great team, we thought we had a great chance.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1998507330523246973", "tags": ["Los Angeles Clippers", "Tyronn Lue", "Kawhi Leonard", "Bradley Beal", "Bogdan Bogdanovic", "Derrick Jones"]}, {"date": "", "archive_date": "2025-12-09", "text": "Law Murray: Lue continued:\"But now we gotta figure out, what we wanna do, how we wanna get out of this rut.Our guys have taken a step in the right direction, putting it in the time.\"x.com", "quote": "\"But now we gotta figure out, what we wanna do, how we wanna get out of this rut.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1998507633314246861", "tags": ["Los Angeles Clippers", "Tyronn Lue"]}, {"date": "", "archive_date": "2025-12-09", "text": "Law Murray: Asked Nicolas Batum about practice, then later about communicating with Tyronn Lue Batum:\"He's doing a great job to keep us engaged. It's not easy to find sometimes a new speech, a new something new to keep us engaged, and he's doing it.\"x.com", "quote": "\"He's doing a great job to keep us engaged. It's not easy to find sometimes a new speech, a new something new to keep us engaged, and he's doing it.\"", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1998512631574049061", "tags": ["Los Angeles Clippers", "Tyronn Lue", "Nicolas Batum"]}, {"date": "", "archive_date": "2025-12-09", "text": "Justin Russo: Tyronn Lue told gathered media this afternoon at practice that both Jordan Miller and Bogdan Bogdanović practiced today with the team.Derrick Jones Jr., who has been out since his Dec. 16 MCL injury, is doing individual workouts.x.com", "quote": "Derrick Jones Jr., who has been out since his Dec. 16 MCL injury, is doing individual workouts", "outlet": "x.com", "source_url": "https://x.com/FlyByKnite/status/1998510452352102455", "tags": ["Los Angeles Clippers", "Injuries", "Tyronn Lue", "Derrick Jones", "Jordan Miller"]}, {"date": "", "archive_date": "2025-12-09", "text": "Eric Nehm:Following today's practice, Bucks coach Doc Rivers told reporters that Taurean Prince, Giannis Antetokounmpo and AJ Green did not participate in today's practice. Rivers said there is a chance that AJ Green could play on Thursday vs. Boston.x.com", "quote": "Following today's practice, Bucks coach Doc Rivers told reporters that Taurean Prince, Giannis Antetokounmpo and AJ Green did not participate in today's practice", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/1998514984092119200", "tags": ["Boston Celtics", "Milwaukee Bucks", "Doc Rivers", "Injuries", "Giannis Antetokounmpo", "Taurean Prince", "AJ Green"]}, {"date": "", "archive_date": "2025-12-09", "text": "Jason Beede:#Magic coach Jamahl Mosley confirmed Paolo Banchero is still on a minutes restriction for tonight’s NBA Cup quarterfinal vs. Miami, when I asked pre-game. Banchero’s minutes have looked as follows in his first two games back from missing 10: - 20:12 - 24:28x.com", "quote": "#Magic coach Jamahl Mosley confirmed Paolo Banchero is still on a minutes restriction for tonight’s NBA Cup quarterfinal vs. Miami, when I asked pre-game", "outlet": "x.com", "source_url": "https://x.com/therealBeede/status/1998505839364022507", "tags": ["Miami Heat", "Orlando Magic", "Jamahl Mosley", "Paolo Banchero", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Joey Linn: Ty Lue says the report about him and Chris Paul not speaking for weeks isn’t true: “That ain’t true. How he gonna play and I’m not talking to him? There was a stretch when he wasn’t gonna play and be out of the rotation, it was tough for him because he’s a competitor.” Lue said he wasn’t part of that final conversation with CP3, Clippers players aren’t happy about the decision, and he has “no problem with Chris.”On why the situation was unable to be reconciled: “You gotta ask Lawrence.”x.com", "quote": "On why the situation was unable to be reconciled: “You gotta ask Lawrence.”", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/1998501497928298958", "tags": ["Los Angeles Clippers", "Chris Paul", "Tyronn Lue"]}, {"date": "", "archive_date": "2025-12-09", "text": "Joey Linn: John Collins on Chris Paul: “It didn’t workout for whatever reason. But somebody who I looked up to. Wake Forest guy, Clipper legend. Somebody I had a relationship with before I was even drafted. So all love and respect out to my guy CP… Definitely was a lot quieter without him here today. So I’ll leave it at that. Wishing him well in whatever he chooses to do in his next steps.” On working alongside CP3:“Intense. He’s a leader. Somebody that wants the best for everybody. It was extremely hard.Whether it was me not being in perfect sync with him, or him seeing that I gave 95% effort instead of 100%. He wants greatness and that’s what he demands. That was the biggest thing. Him being a leader and me trying to play to that standard that he expects me to.”x.com", "quote": "“Intense. He’s a leader. Somebody that wants the best for everybody. It was extremely hard.", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/1998493633658642796", "tags": ["Los Angeles Clippers", "Chris Paul", "John Collins"]}, {"date": "", "archive_date": "2025-12-09", "text": "Joey Linn: Nicolas Batum on Chris Paul: “I texted him the first day that happened… I obviously have a ton of respect for him… 21 years and a Hall ofFamer… I got a chance to play with a lot of great players. He’s one of them. So just wanted to text him and thank him for the time I had with him.”On the reports that certain Clippers players wanted CP3 gone: “They didn’t ask me. Like everybody else, I just woke up and found out about the news. It is what it is, the situation upstairs… If something happened, I don’t really know about it… It’s sad sometimes to be part of that. On both sides. The fans too. Just wish the best for CP.”x.com", "quote": "Famer… I got a chance to play with a lot of great players. He’s one of them. So just wanted to text him and thank him for the time I had with him.”", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/1998491261926592890", "tags": ["Los Angeles Clippers", "Chris Paul", "Hall of Fame", "Nicolas Batum"]}, {"date": "", "archive_date": "2025-12-09", "text": "Oh No He Didn't: Bam Adebayo:\"People are gonna call us crazy but I think we're a contender...when we're fully healthy\"x.com", "quote": "\"People are gonna call us crazy but I think we're a contender...when we're fully healthy\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/1998493414896341414", "tags": ["Miami Heat", "Bam Adebayo"]}, {"date": "", "archive_date": "2025-12-09", "text": "Dave McMenamin: “I can to do way more than that. … That’s mediocre to me. …14 and 12 ain’t nothing to me. ... That’s a mandatory thing to do for this team.”- Deandre Ayton after becoming the 1st LAL starter ever to have a double-double while not missing a shot (7-of-7) and zero turnovers.x.com", "quote": "14 and 12 ain’t nothing to me. ... That’s a mandatory thing to do for this team.”", "outlet": "x.com", "source_url": "https://x.com/mcten/status/1998495396566540543", "tags": ["Los Angeles Lakers", "Deandre Ayton"]}, {"date": "", "archive_date": "2025-12-09", "text": "Dave McMenamin:JJ Redick philosophized about the additional requirements of coaching in the age of social media and the differences in the value of each possession in the NBA vs. the NFL at the end of practice today.Worth the 2 1/2 minutes.x.com", "quote": "JJ Redick philosophized about the additional requirements of coaching in the age of social media and the differences in the value of each possession in the NBA vs. the NFL at the end of practice today.", "outlet": "x.com", "source_url": "https://x.com/mcten/status/1998490327397888171", "tags": ["Los Angeles Lakers", "JJ Redick", "Social Media"]}, {"date": "", "archive_date": "2025-12-09", "text": "Pelicans Film Room: \"He is always trying to get everybody involved. Especially with cuts, he sees a lot of things a lot of bigs dont usually see...It's good to have somebody that is looking for those cuts\"-- Herb Jones on playing with Derik Queenx.com", "quote": "It's good to have somebody that is looking for those cuts\"", "outlet": "x.com", "source_url": "https://x.com/PelsFilmRoom/status/1998504323987259798", "tags": ["New Orleans Pelicans", "Herb Jones", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-09", "text": "Sean Highkin:Yang Hansen wasn’t feeling well today and didn’t practice.Also will not play tonight for the Remix. Rayan Rupert and Javonte Cooke are expected to play.x.com", "quote": "Yang Hansen wasn’t feeling well today and didn’t practice.", "outlet": "x.com", "source_url": "https://x.com/highkin/status/1998500907605205188", "tags": ["Portland Trail Blazers", "Injuries", "Rayan Rupert", "Javonte Cooke", "Yang Hansen"]}, {"date": "", "archive_date": "2025-12-09", "text": "Sean Highkin: Latest updates on injured guys:Matisse Thybulle, Jrue Holiday and Scoot Henderson are doing non-contact stuff but still haven’t been fully cleared.Donovan Clingan did some drills but not full practice. Robert Williams III returned to practice after getting sick Sunday.x.com", "quote": "Matisse Thybulle, Jrue Holiday and Scoot Henderson are doing non-contact stuff but still haven’t been fully cleared.", "outlet": "x.com", "source_url": "https://x.com/highkin/status/1998498252593967231", "tags": ["Portland Trail Blazers", "Injuries", "Jrue Holiday", "Robert Williams", "Matisse Thybulle", "Robert Williams III", "Scoot Henderson", "Donovan Clingan"]}, {"date": "", "archive_date": "2025-12-09", "text": "Dalton Johnson:Jonathan Kuminga’s trade market will heat up in the coming weeks. The Kings and Suns, his two biggest suitors in the offseason, remain interested,sources say There are still five-plus weeks until Kuminga can be traded. The Warriors have 16 games until he becomes trade eligibleBluesky", "quote": "Jonathan Kuminga’s trade market will heat up in the coming weeks. The Kings and Suns, his two biggest suitors in the offseason, remain interested,", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/daltonjohnson.bsky.social/post/3m7lfvgrrgs24", "tags": ["Phoenix Suns", "Sacramento Kings", "Trade", "Jonathan Kuminga", "Golden State Warrior"]}, {"date": "", "archive_date": "2025-12-09", "text": "League sources sayChris Paul had interest from teams such as the Bucks, Knicks, Mavericks and Suns, but he was determined to stay as near to his family as possibleeven after playing (and starting) all 82 games in his lone season as a San Antonio Spur.marcstein.substack.com", "quote": "Chris Paul had interest from teams such as the Bucks, Knicks, Mavericks and Suns, but he was determined to stay as near to his family as possible", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/dec-15-is-almost-here-and-that-means", "tags": ["Dallas Mavericks", "Los Angeles Clippers", "Milwaukee Bucks", "New York Knicks", "Phoenix Suns", "San Antonio Spurs", "Trade", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-09", "text": "Myles Turner's old team inIndiana is expected to shop the in-season trade market for big men and likewise believed to hold interest in Dallas Mavericks center Daniel Gaffordas a potential pick-and-roll lob threat before Tyrese Haliburton's return from an Achilles tear next season.marcstein.substack.com", "quote": "Indiana is expected to shop the in-season trade market for big men and likewise believed to hold interest in Dallas Mavericks center Daniel Gafford", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/dec-15-is-almost-here-and-that-means", "tags": ["Dallas Mavericks", "Indiana Pacers", "Daniel Gafford", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-09", "text": "NBA Communications: Toronto Raptors two-way playerAlijah Martin has been named the NBA G League Player of the Weekfor games played Monday, Dec. 1 through Sunday, Dec. 7.Twitter", "quote": "Alijah Martin has been named the NBA G League Player of the Week", "outlet": "Twitter", "source_url": "http://twitter.com/NBAPR/status/1998490356015571308", "tags": ["Toronto Raptors", "G League", "Awards", "Alijah Martin"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Heat have upgraded Tyler Herro (right big toe contusion), Pelle Larsson (right hip flexor tightness), Davion Mitchell (right groin tightness) and Dru Smith (left hip contusion) to availablefor Tuesday’s game against Orlando.HoopsHype", "quote": "The Heat have upgraded Tyler Herro (right big toe contusion), Pelle Larsson (right hip flexor tightness), Davion Mitchell (right groin tightness) and Dru Smith (left hip contusion) to available", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Miami Heat", "Orlando Magic", "Injuries", "Tyler Herro", "Davion Mitchell", "Dru Smith", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-09", "text": "Law Murray:Back at Clippers practice, the first at home in a while Jordan Miller (hamstring, back) back on the floorLawrence Frank looking onBluesky", "quote": "Back at Clippers practice, the first at home in a while Jordan Miller (hamstring, back) back on the floor", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/lawmurraythenu.bsky.social/post/3m7lfbvnips24", "tags": ["Los Angeles Clippers", "Lawrence Frank", "Injuries", "Jordan Miller"]}, {"date": "", "archive_date": "2025-12-09", "text": "Mike Trudell:Marcus Smart said he’s planning to play Wednesday vs. San Antonio after missing the previous six games:“Back is feeling good. Felt good in practice today ... I’m gonna give it a shot tomorrow and see how it feels.”Twitter @LakersReporter", "quote": "Marcus Smart said he’s planning to play Wednesday vs. San Antonio after missing the previous six games:", "outlet": "Twitter @LakersReporter", "source_url": "https://hoopshype.com/social/", "tags": ["Los Angeles Lakers", "Injuries", "Marcus Smart"]}, {"date": "", "archive_date": "2025-12-09", "text": "Ira Winderman:Vlad Goldin has rejoined the Heat from the G League and will be available tonight in Orlando.Magic have brought up former Heat players Jamal Cain and Orlando Robinson from G League, with both on two-way deals.Twitter @IraHeatBeat", "quote": "Vlad Goldin has rejoined the Heat from the G League and will be available tonight in Orlando.", "outlet": "Twitter @IraHeatBeat", "source_url": "https://hoopshype.com/social/", "tags": ["Miami Heat", "Orlando Magic", "G League", "Orlando Robinson", "Jamal Cain", "Vlad Goldin"]}, {"date": "", "archive_date": "2025-12-09", "text": "Justin Martinez:Mark Daigneault on if he has learned anything from his bench guys as OKC keeps winning despite injuries: “It was nothing that we hadn’t seen or we didn’t know, but everybody wants to touch the outcome of the game.It helps chemistry. It helps engagement.”Twitter", "quote": "Mark Daigneault on if he has learned anything from his bench guys as OKC keeps winning despite injuries: “It was nothing that we hadn’t seen or we didn’t know, but everybody wants to touch the outcome of the game.", "outlet": "Twitter", "source_url": "http://twitter.com/Justintohoops/status/1998463873284796792", "tags": ["Oklahoma City Thunder", "Coaching", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-09", "text": "James L. Edwards III:Tyler Kolek told us today at shootaround that he bought his mom a car with the money the Knicks got from making it to the quarterfinal of NBA Cup. Said it’s his dad’s turn now.Bluesky", "quote": "Tyler Kolek told us today at shootaround that he bought his mom a car with the money the Knicks got from making it to the quarterfinal of NBA Cup", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jledwardsiii.bsky.social/post/3m7l2roatms2w", "tags": ["New York Knicks", "NBA Cup", "Tyler Kolek"]}, {"date": "", "archive_date": "2025-12-09", "text": "Las Vegas is only getting hotter, as Amazon Music has enlisted Nas to deliver a special performance between the Emirates NBA Cup 2025 Semifinals.Live from the Toshiba Arena Plaza, Nas will headline Amazon’s “In the Paint” concert on Saturday (Dec. 13.), as he’s coming off his hotly anticipated collaborative project, Light Years, with DJ Premier.Billboard", "quote": "Las Vegas is only getting hotter, as Amazon Music has enlisted Nas to deliver a special performance between the Emirates NBA Cup 2025 Semifinals.", "outlet": "Billboard", "source_url": "https://www.billboard.com/music/rb-hip-hop/nas-headline-amazon-music-show-nba-cup-semifinals-1236132324/", "tags": ["Showbusiness", "Nas", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Fans attending Saturday’s games will have access to watch Nas’ performance in person, while viewers at home can experience a sample-size version of his set during Prime’s Emirates NBA Cup broadcast.The whole performance will be available online post-coverage on Prime Video, the Amazon Music channel on Twitch and in the Amazon Music app.Billboard", "quote": "Fans attending Saturday’s games will have access to watch Nas’ performance in person, while viewers at home can experience a sample-size version of his set during Prime’s Emirates NBA Cup broadcast.", "outlet": "Billboard", "source_url": "https://www.billboard.com/music/rb-hip-hop/nas-headline-amazon-music-show-nba-cup-semifinals-1236132324/", "tags": ["Showbusiness", "Nas", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "TSN: Reigning NBA and NBA Finals MVPShai Gilgeous-Alexander wins the Northern Star Award as Canada’s top athlete of the year!? It is Shai’s second time winning the award, first was in 2023.Twitter", "quote": "Shai Gilgeous-Alexander wins the Northern Star Award as Canada’s top athlete of the year!", "outlet": "Twitter", "source_url": "http://twitter.com/TSN_Sports/status/1998465378633093236", "tags": ["Oklahoma City Thunder", "Canada", "Awards", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-09", "text": "Sam Amick:To be clear here, there is no pushback from Kings owner Vivek Ranadive regarding their current plan.The point, which was said in a big-picture sense, is that Scott Perry is making it clear - from the top on down - that they need to be very patient and prudent here.Twitter @sam_amick", "quote": "To be clear here, there is no pushback from Kings owner Vivek Ranadive regarding their current plan.", "outlet": "Twitter @sam_amick", "source_url": "https://hoopshype.com/social/", "tags": ["Sacramento Kings", "Owners", "Vivek Ranadive", "Scott Perry"]}, {"date": "", "archive_date": "2025-12-09", "text": "James Ham: From Kings: OFFICIAL:@SacramentoKings assign Nique Clifford to the @StocktonKingsTwitter @James_HamNBA", "quote": "@SacramentoKings assign Nique Clifford to the @StocktonKings", "outlet": "Twitter @James_HamNBA", "source_url": "https://hoopshype.com/social/", "tags": ["Sacramento Kings", "G League", "Nique Clifford"]}, {"date": "", "archive_date": "2025-12-09", "text": "In his typically reserved way,Luka Doncic is private about his family life, but he carries constant reminders with him. He designed a pink colorway of his signature sneaker in honor of his first daughter, Gabriela.When he presented his autobiographical slideshow to the team earlier this year, he named Gabriela, born in 2023, as the person who changed his life. From writing “Gabriela” on his shoes for games, Doncic inscribed a small G and O with a heart on his shoes Sunday.Los Angeles Times", "quote": "Luka Doncic is private about his family life, but he carries constant reminders with him. He designed a pink colorway of his signature sneaker in honor of his first daughter, Gabriela.", "outlet": "Los Angeles Times", "source_url": "https://link.latimes.com/view/6532a21425b3640666b9b8dbpkj9p.3gv/84b59838", "tags": ["Los Angeles Lakers", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-09", "text": "Doncic thanked the Lakers for allowing him to spend time with his family during a major life milestone during the season and his manager Lara Beth Seger for helping him set up the travel.He left L.A. on Monday after the Lakers finished back-to-back games against the Phoenix Suns, flying 12 hours to Slovenia, which is nine hours ahead of L.A. It was a roller coaster, Doncic said. With a relieved smile, he added: “But it was worth it.”Los Angeles Times", "quote": "Doncic thanked the Lakers for allowing him to spend time with his family during a major life milestone during the season and his manager Lara Beth Seger for helping him set up the travel.", "outlet": "Los Angeles Times", "source_url": "https://link.latimes.com/view/6532a21425b3640666b9b8dbpkj9p.3gv/84b59838", "tags": ["Los Angeles Lakers", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-09", "text": "As a father of two boys, coach JJ Redick understands. When his youngest son Kai was born, Redick handled night duty, feeding and changing the baby for almost two months before the season began. He called it “one of the coolest experiences of my life.”“[I] somehow came to the gym every day with more energy than I thought was possible despite sleeping in two-hour segments for five or six hours,” Redick said before the game. “So hopefully it would be [the same] with Luka.”Los Angeles Times", "quote": "“[I] somehow came to the gym every day with more energy than I thought was possible despite sleeping in two-hour segments for five or six hours,” Redick said before the game. “So hopefully it would be [the same] with Luka.”", "outlet": "Los Angeles Times", "source_url": "https://link.latimes.com/view/6532a21425b3640666b9b8dbpkj9p.3gv/84b59838", "tags": ["Los Angeles Lakers", "Coaching", "JJ Redick", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-09", "text": "NBA Communications:More than 40 million people in the U.S. watched Emirates NBA Cup 2025 Group Play games across Amazon Prime Video, NBC/Peacock and ESPN, up 90% from last year and the most-watched Group Play in the event’s three-year history. The Emirates NBA Cup quarterfinals take place Tuesday, Dec. 9 and Wednesday, Dec. 10 on @PrimeVideo. Tuesday: @MiamiHEAT at @OrlandoMagic at 6p ET @nyknicks at @Raptors at 8:30p ET Wednesday: @Suns at @okcthunder at 7:30p ET @Spurs at @Lakers at 10p ET.Twitter", "quote": "More than 40 million people in the U.S. watched Emirates NBA Cup 2025 Group Play games across Amazon Prime Video, NBC/Peacock and ESPN, up 90% from last year and the most-watched Group Play in the event’s three-year history", "outlet": "Twitter", "source_url": "http://twitter.com/NBAPR/status/1998088423546982554", "tags": ["Los Angeles Lakers", "Miami Heat", "New York Knicks", "Oklahoma City Thunder", "Orlando Magic", "Phoenix Suns", "San Antonio Spurs", "Toronto Raptors", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Can the Heat trade Terry Rozier? Sources told ESPN that it remains unclear what would happen if the Heat were to try to trade Rozier before the Feb. 5 trade deadline. No team will be interested in acquiring Rozier to play for them, as he, like Portland Trail Blazers coach Chauncey Billups, has been put on leave by the NBA. However, Rozier does have a $26.6 million expiring contract that could secure help for Miami's current roster and allow the receiving team to save some money on its future books.ESPN", "quote": "Can the Heat trade Terry Rozier? Sources told ESPN that it remains unclear what would happen if the Heat were to try to trade Rozier before the Feb. 5 trade deadline", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47229222/terry-rozier-investigation-shines-spotlight-nba-trade-protocols-heat-hornets", "tags": ["Miami Heat", "Portland Trail Blazers", "Trade", "Chauncey Billups", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-09", "text": "Sources told ESPN that the Heat were not aware of the NBA's investigation when they traded for Rozier, whom they acquired for a 2027 lottery-protected first-round pick and guard Kyle Lowry while trying to make another deep playoff run. Instead, Rozier did not appear in a playoff game for Miami, playing 95 games across two regular seasons and averaging 12.5 points on 40.4% shooting.The Hornets, when asked by ESPN whether they were aware of the league's investigation before the trade, declined to comment.ESPN", "quote": "The Hornets, when asked by ESPN whether they were aware of the league's investigation before the trade, declined to comment", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47229222/terry-rozier-investigation-shines-spotlight-nba-trade-protocols-heat-hornets", "tags": ["Charlotte Hornets", "Miami Heat", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-09", "text": "In our conversations around the league, there were differing opinions on whether the investigation should have been disclosed. Multiple executives called it a \"gray area\" with no clear answer. \"The league might exonerate a player, but they always have the right to open the investigation if they learn of new information,\" one team executive told ESPN. \"Because of that, the Rozier investigation should have been disclosed by the NBA and Hornets.\"ESPN", "quote": "In our conversations around the league, there were differing opinions on whether the investigation should have been disclosed. Multiple executives called it a \"gray area\" with no clear answer", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47229222/terry-rozier-investigation-shines-spotlight-nba-trade-protocols-heat-hornets", "tags": ["Charlotte Hornets", "Miami Heat", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-09", "text": "Can you spend a moment to make a case as to why Cade Cunningham should be the league MVP this season? JB Bickerstaff: To me, especially when it's winning time, he's been the best player in the league in crunch time.His understanding of how to manipulate the game and make plays down the stretch, has led to why we are 19 and five at this time. We don't have a bunch of games where we've blown people out. A lot of our games have been highly contested going down the stretch and he's been able to make plays for us on both ends of the floor. He's not a one-dimensional guy who can just score it. He's a guy who can defend. You see him getting blocked shots. You see him getting steals. He gets rebounds. And he’s made his teammates better as well. And is a big reason for the position that we're in right now. We ought to reward character. I think we ought to reward guys who are great teammates. what the league is trying to develop in these superstars, shouldn't just be about the game of basketball itself. You know, it should be about the type of people and how they carry themselves and how they push the league forward. And Cade has done all of those things.YouTube", "quote": "Can you spend a moment to make a case as to why Cade Cunningham should be the league MVP this season? JB Bickerstaff: To me, especially when it's winning time, he's been the best player in the league in crunch time.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=tTrs3PqRKCY&t=357s", "tags": ["Detroit Pistons", "DeMarcus Cousins", "JB Bickerstaff", "Cade Cunningham"]}, {"date": "", "archive_date": "2025-12-09", "text": "LeBron James:If you ask me what I feel like was my best season that I had, that I felt the most complete as a basketball player, I would say 2018, the 2017-18 season.I felt like I could do no wrong out there on the basketball floor offensively, defensively... I felt no flaws in my game. I felt like every time I stepped out on the floor I really could do everything I wanted to do. All three levels, defensively, guard all three levels. I still feel that way, but it was just another level of that in 2017-18, with the team that we had. That season right there, I felt like that was probably my most complete. I played all 82 games, I believe, that year. And then if you include the playoffs, I played over a 100 games. I didn't miss one game that season.YouTube", "quote": "If you ask me what I feel like was my best season that I had, that I felt the most complete as a basketball player, I would say 2018, the 2017-18 season.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=UEKsE67dItw&t=115s", "tags": ["Los Angeles Lakers", "LeBron James"]}, {"date": "", "archive_date": "2025-12-09", "text": "LeBron James on Derrick Rose: I hope and I hope dearly people have not forgotten about Derrick Rose. One of the most explosive players that I've ever played, one of the most competitive players I ever played. Injuries suck.They really do. And he he's one of those examples. We have a lot of examples in our sport obviously over the years since this game has been introduced. And the battles that I had against D-Rose when I was in Miami, when I went back to Cleveland, the guy I think he's the youngest, if people don't know, he's the youngest MVP in our league's history. And what he meant for the Chicago Bulls, he meant even more for the city of Chicago in whole. And he's a legend. He's a great and we all love Derrick Rose. If you have ever played basketball, have ever been a part of our league, there's not one bad thing people could say about Derrick Rose.YouTube", "quote": "LeBron James on Derrick Rose: I hope and I hope dearly people have not forgotten about Derrick Rose. One of the most explosive players that I've ever played, one of the most competitive players I ever played. Injuries suck.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=UEKsE67dItw&t=255s", "tags": ["Chicago Bulls", "Los Angeles Lakers", "LeBron James", "Derrick Rose"]}, {"date": "", "archive_date": "2025-12-09", "text": "Carmelo Anthony: That drastic lifestyle change it f*cks you up mentally. That's the gray area that f*cks a lot of athletes up. Because they sit in this space of transitioning from having this to now got to budget on a day-to-day basis. I got to budget. HowI'm going to pay my mortgage. I got a budget how I'mma pay my car. I got a budget on food. Like, it's a lot of sh*t that you got to come back to reality now. Because now you ain't got the bread. You got to be honest. You got to live with yourself. And you got to be willing to accept that. So, I feel what Odell is saying. You know, years ago, Latrell Sprewell said, \"I can't live off 7 million a year.\" Remember that? People thought he was crazy. It's not crazy because everything is relevancy, right? If you going to live this, if you here and you living this lifestyle over five, seven years, 100 million is not 100 million. You're not even seeing 50 of that million at all. Crazy, right? So, it's a lot of sh*t that comes into play with that.YouTube", "quote": "Carmelo Anthony: That drastic lifestyle change it f*cks you up mentally. That's the gray area that f*cks a lot of athletes up. Because they sit in this space of transitioning from having this to now got to budget on a day-to-day basis. I got to budget. How", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=ieYTXVBEn0Q&t=1610s", "tags": ["Carmelo Anthony", "Latrell Sprewell"]}, {"date": "", "archive_date": "2025-12-09", "text": "Carmelo Anthony on why Phil Jackson’s Triangle didn’t work in New York: Phil team was more triangle. He just he knew the triangle. He knew what pieces that he needed in the triangle but he got the wrong pieces for the triangle. Youget what I'm saying? So you need system people for that. You need a system guard. You need a big that can post up. You need a wing like a Kobe or MJ, somebody who, you know, an iso guy. And then you need a Toni Kukoc, Lamar Odom. You need one of those type of guys.YouTube", "quote": "Carmelo Anthony on why Phil Jackson’s Triangle didn’t work in New York: Phil team was more triangle. He just he knew the triangle. He knew what pieces that he needed in the triangle but he got the wrong pieces for the triangle. You", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=ieYTXVBEn0Q&t=3564s", "tags": ["New York Knicks", "Carmelo Anthony", "Phil Jackson", "Lamar Odom", "Toni Kukoc"]}, {"date": "", "archive_date": "2025-12-09", "text": "Josh Lewenberg:Immanuel Quickley (illness) has been added to the injury report for tonight.He’s questionable vs New York.Bluesky", "quote": "Immanuel Quickley (illness) has been added to the injury report for tonight.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jlewenberg.bsky.social/post/3m7kyo7xsl22q", "tags": ["Toronto Raptors", "Injuries", "Immanuel Quickley"]}, {"date": "", "archive_date": "2025-12-09", "text": "Minnesota Timberwolves PR: NEWS:@Timberwolves assign center Joan Beringer to G League affiliate @Iowa Wolves. Beringer will be available for Iowa's game on Friday against Motor City.Twitter @Twolves_PR", "quote": "@Timberwolves assign center Joan Beringer to G League affiliate @Iowa Wolves", "outlet": "Twitter @Twolves_PR", "source_url": "http://twitter.com/Twolves_PR/status/1998434010133828009", "tags": ["Minnesota Timberwolves", "G League", "Joan Beringer"]}, {"date": "", "archive_date": "2025-12-09", "text": "Jon Krawczynski:Launch day for @Anthony Edwards and his production company, Three-Fifths Media: “Serious Business” is a series on Amazon Prime in which he competes against celebrities and athletes.Episode 1 includes a table tennis match against Olympian Lily Zhang. IYKYKTwitter @JonKrawczynski", "quote": "Launch day for @Anthony Edwards and his production company, Three-Fifths Media: “Serious Business” is a series on Amazon Prime in which he competes against celebrities and athletes.", "outlet": "Twitter @JonKrawczynski", "source_url": "https://hoopshype.com/social/", "tags": ["Minnesota Timberwolves", "Media", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-09", "text": "Memphis Grizzlies guardJa Morant is treating 250 fans with a pair of tickets to the game on Friday, 12/12, at 7 p.m. CT against the Utah Jazz.Tickets will be given away Wednesday, Dec. 10, at 2 p.m. inside the Grand Lobby of FedExForum on a first-come, first-serve basis (limit of two tickets per adult).NBA.com", "quote": "Ja Morant is treating 250 fans with a pair of tickets to the game on Friday, 12/12, at 7 p.m. CT against the Utah Jazz.", "outlet": "NBA.com", "source_url": "https://www.nba.com/grizzlies/news/12-ja-morant-to-treat-250-fans-with-tickets-for-grizzlies-game-on-friday-12-12-against-utah-jazz", "tags": ["Memphis Grizzlies", "Philanthropy", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-09", "text": "The launch date for the NBA Europe project is becoming clearer. FIBA Secretary General Andreas Zagklis expressed his optimism that NBA Europe could start as soon as October 2027. \"I believe [NBA Europe] will happen, and I have no doubt about it. We need, of course, the approval of the respective two boards of the NBA and the FIBA Central Board,\" Zagklis said during the media availability. \"I do believe that October 2027 is a realistic target and that it is also an ideal way of closing the curtain in Doha with tremendous confidence about the FIFA Basketball World Cup and moving into a new project that shapes the European Club Basketball landscape in a positive way,\" he added.BasketNews", "quote": "The launch date for the NBA Europe project is becoming clearer. FIBA Secretary General Andreas Zagklis expressed his optimism that NBA Europe could start as soon as October 2027", "outlet": "BasketNews", "source_url": "https://basketnews.com/news-236505-nba-launch-date-october-2027.html", "tags": ["FIBA", "Andreas Zagklis", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Magic have ruled out Colin Castleton (left thumb fracture) for Tuesday’s NBA Cup gameagainst Miami.HoopsHype", "quote": "The Magic have ruled out Colin Castleton (left thumb fracture) for Tuesday’s NBA Cup game", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Orlando Magic", "Injuries", "Colin Castleton"]}, {"date": "", "archive_date": "2025-12-09", "text": "Dustin Dopirak:Andrew Nembhard is going to be making a community appearance at the Boys and Girls Clubs of Indianapolis at 3870 North Post Road from 4:30-5:30 p.m. todayTwitter @DustinDopirak", "quote": "Andrew Nembhard is going to be making a community appearance at the Boys and Girls Clubs of Indianapolis at 3870 North Post Road from 4:30-5:30 p.m. today", "outlet": "Twitter @DustinDopirak", "source_url": "https://hoopshype.com/social/", "tags": ["Indiana Pacers", "Philanthropy", "Andrew Nembhard"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Supreme Court on Monday declined to hear arguments in a challenge brought by the NBA, seeking the reversal of a Second Circuit decision finding a concrete injury when a consumer’s information is disclosed to another business. The case centers on a lawsuit brought by Michael Salazar, who sued the NBA for tracking his activity on NBA.com and through its free newsletter, data it then shared with Meta to serve him targeted ads.Courthouse News", "quote": "The Supreme Court on Monday declined to hear arguments in a challenge brought by the NBA, seeking the reversal of a Second Circuit decision finding a concrete injury when a consumer’s information is disclosed to another business", "outlet": "Courthouse News", "source_url": "https://courthousenews.com/scotus-swats-nba-shot-to-limit-class-actions-over-data-sharing-with-meta/", "tags": ["Law", "Technology"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Third, 10th and 11th Circuits have each held that a consumer does not have standing, ruling that federal courts cannot recognize “nonpublic, business-to-business disclosures” as harmful. The Sixth and Seventh Circuits have heard arguments in similar cases and are likely to reject the Second Circuit’s decision in looming opinions, the NBA said.The NBA challenged the Second Circuit’s finding that the Video Privacy Protection Act — a 1988 statue prohibiting the disclosure of a customer’s viewing history without their consent — could be extended to apply to individuals who watched videos without renting, buying or subscribing to it.Courthouse News", "quote": "The NBA challenged the Second Circuit’s finding that the Video Privacy Protection Act — a 1988 statue prohibiting the disclosure of a customer’s viewing history without their consent — could be extended to apply to individuals who watched videos without renting, buying or subscribing to it", "outlet": "Courthouse News", "source_url": "https://courthousenews.com/scotus-swats-nba-shot-to-limit-class-actions-over-data-sharing-with-meta/", "tags": ["Law", "Technology"]}, {"date": "", "archive_date": "2025-12-09", "text": "Indiana Pacers star Tyrese Haliburton is joining “NBA on Prime” as a player contributor and will make his broadcast debut Tuesday night during “NBA Nightcap.”Haliburton, who suffered an Achilles tear in Game 7 of the 2025 NBA Finals, will deliver behind-the-scenes content on his recovery journey for “NBA on Prime” viewers throughout the 2025-26 season as well as offer his insights and commentary on happenings around the league.New York Times", "quote": "Indiana Pacers star Tyrese Haliburton is joining “NBA on Prime” as a player contributor and will make his broadcast debut Tuesday night during “NBA Nightcap.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6874158/2025/12/09/tyrese-haliburton-nba-amazon-prime-pacers/", "tags": ["Indiana Pacers", "Media", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-09", "text": "“I’m going to be talking about the games, talking about the season, talking about the NBA as a whole, which I’m excited about,” Haliburton told The Athletic.“I think, for me, and just NBA players in general, sometimes with the media — I think we all criticize — but the people who are giving us criticism, and the way that our game is talked about and the way that our game is digested is something that’s always bothered a lot of players.”New York Times", "quote": "“I’m going to be talking about the games, talking about the season, talking about the NBA as a whole, which I’m excited about,” Haliburton told The Athletic.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6874158/2025/12/09/tyrese-haliburton-nba-amazon-prime-pacers/", "tags": ["Indiana Pacers", "Media", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-09", "text": "“I think for a fan who just turns on the game and is more of a casual fan, the talking heads are important to them,” Haliburton said. “This is what they’re seeing on television. And I think that sometimes our game can get so critical, and it can be so narrative-based. That’s something we talked about during the (NBA) Finals, right? It was so refreshing,I think, for our game to see the Pacers versus the Thunder because it was less about narratives of ‘Where does this put his legacy?’ and more about how the Pacers are attacking the Thunder and how the Thunder’s defense is.”New York Times", "quote": "I think, for our game to see the Pacers versus the Thunder because it was less about narratives of ‘Where does this put his legacy?’ and more about how the Pacers are attacking the Thunder and how the Thunder’s defense is.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6874158/2025/12/09/tyrese-haliburton-nba-amazon-prime-pacers/", "tags": ["Indiana Pacers", "Oklahoma City Thunder", "Media", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-09", "text": "WNBA starPaige Bueckers is stepping into entrepreneurship alongside NBA superstar Chris Paul. The two are teaming up to launch a bold new snack flavor called Ragerz under Paul’s Good Eat’n brand,and it comes with a mission that goes beyond taste.People", "quote": "Paige Bueckers is stepping into entrepreneurship alongside NBA superstar Chris Paul. The two are teaming up to launch a bold new snack flavor called Ragerz under Paul’s Good Eat’n brand,", "outlet": "People", "source_url": "https://people.com/paige-bueckers-chris-paul-launch-new-snack-exclusive-11863878", "tags": ["Los Angeles Clippers", "Chris Paul", "Business", "WNBA", "Food", "Paige Bueckers"]}, {"date": "", "archive_date": "2025-12-09", "text": "For Bueckers, 21, the opportunity was impossible to pass up. Not only is this the first time a WNBA player has taken an equity stake in a brand owned by an NBA player, it also aligns with her passion for making an impact.“My agent came to me with the idea, and first I’m like, it’s Chris Paul. I’ve looked up to him since I was young… So obviously that opportunity was exciting — to work with Chris, learn from Chris,\" she tells PEOPLE.People", "quote": "“My agent came to me with the idea, and first I’m like, it’s Chris Paul. I’ve looked up to him since I was young… So obviously that opportunity was exciting — to work with Chris, learn from Chris,\" she tells PEOPLE", "outlet": "People", "source_url": "https://people.com/paige-bueckers-chris-paul-launch-new-snack-exclusive-11863878", "tags": ["Los Angeles Clippers", "Chris Paul", "Business", "WNBA", "Food", "Paige Bueckers"]}, {"date": "", "archive_date": "2025-12-09", "text": "Jimmy Butler shared why helping Jonathan Kuminga is so important to him in the latest edition of NBC Sports Bay Area’s “Dub Talk” with Monte Poole and Raj Mathai, adding that the 23-year-old swingman is better than he was at that age.“Oh my God … No. He [is] way better than I was at the age he is,” Butler told Poole and Mathai. “The upside, the ceiling, it’s all of that. Now, what I will say is that I’ve been in his position -- as in like starting [and] not starting, just got a deal … But he wants to be great.So, he’s asking all the right questions. He’s saying what he sees. ‘Yo, I need to learn how to do this?’ That’s all you can ask from anybody. Nobody has all the answers; I don’t. Steph [Curry] might, actually …”NBC Sports Bay Area", "quote": "“Oh my God … No. He [is] way better than I was at the age he is,” Butler told Poole and Mathai. “The upside, the ceiling, it’s all of that. Now, what I will say is that I’ve been in his position -- as in like starting [and] not starting, just got a deal … But he wants to be great.", "outlet": "NBC Sports Bay Area", "source_url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/jimmy-butler-jonathan-kuminga-2/1896786/", "tags": ["Golden State Warriors", "Jimmy Butler", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-09", "text": "Jim Eichenhofer:Asked about complaints from some parts of league about a \"grueling\" schedule so far, Trey Murphy said: \"It's the NBA, man. We have all summer to prepare for it...There are other teams going through the same thing. It's what you sign up for. It's what you get paid to do.\"Twitter @Jim_Eichenhofer", "quote": "Asked about complaints from some parts of league about a \"grueling\" schedule so far, Trey Murphy said: \"It's the NBA, man. We have all summer to prepare for it...", "outlet": "Twitter @Jim_Eichenhofer", "source_url": "https://hoopshype.com/social/", "tags": ["New Orleans Pelicans", "Trey Murphy"]}, {"date": "", "archive_date": "2025-12-09", "text": "Even though FIBA continues to work closely with the NBA on its expansion into Europe, current NBA players are not expected to participate in FIBA qualifiers during the regular season. \"We do not expect a change in the way FIBA itself planned the qualifiers,\" FIBA Secretary General Andreas Zagklis answered BasketNews' question in his media availability. \"It was planned since the beginning that in the in-season windows, we will play with everyone who is licensed with a FIBA club around the world.\"BasketNews", "quote": "Even though FIBA continues to work closely with the NBA on its expansion into Europe, current NBA players are not expected to participate in FIBA qualifiers during the regular season", "outlet": "BasketNews", "source_url": "https://basketnews.com/news-236511-nba-players-unlikely-to-play-in-fiba-qualifiers-during-regular-season.html", "tags": ["FIBA", "Andreas Zagklis", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-09", "text": "However, Zagklis assured that FIBA is working to ensure players from eventual NBA Europe teams will be available for the qualifiers. \"Yes, the discussion we've had is about availability for national team windows of qualifiers,\" Zagklis confirmed.BasketNews", "quote": "However, Zagklis assured that FIBA is working to ensure players from eventual NBA Europe teams will be available for the qualifiers", "outlet": "BasketNews", "source_url": "https://basketnews.com/news-236511-nba-players-unlikely-to-play-in-fiba-qualifiers-during-regular-season.html", "tags": ["FIBA", "Andreas Zagklis", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-09", "text": "There is worn stitching, fabric fraying, organic fading and piling on the seams of this size 46 Larry Bird jersey which is up for sale and is going for the price of a modest house. Those imperfections are a good thing. They prove the jersey matches the one worn for seven NBA playoff games by Bird as he tore up the court. That, along with a high-tech photo game-matching process, authenticate this is a rare, game-worn jersey donned by Bird during the 1987 Eastern Conference playoffs, including in two finals games. Now up for bid at Heritage Auctions, the jersey had a bid of $175,000 as of early Tuesday morning.Indianapolis Star", "quote": "There is worn stitching, fabric fraying, organic fading and piling on the seams of this size 46 Larry Bird jersey which is up for sale and is going for the price of a modest house", "outlet": "Indianapolis Star", "source_url": "https://www.indystar.com/story/sports/nba/pacers/2025/12/09/larry-bird-jersey-worn-during-1987-eastern-conference-finals-up-for-auction/87637512007", "tags": ["Larry Bird", "Auctions"]}, {"date": "", "archive_date": "2025-12-09", "text": "Max Kellerman: Is LeBron James realistically a guy who could not be on the Lakers at the end of this year? Paul: No.Kellerman: He will be on the Lakers at the end of this year. Pau: Yeah. Where's he going to go? Kellerman: I mean, New York comes to mind. Paul: That's wishful thinking. You're from New York. Kellerman:The Knicks would love Giannis, right? Or someone like that. But the price tag for a a hundred-year-old guy making $50 million a year is a lot lower. And actually, I think as a kid who grew up rooting for the Knicks, he's still in me somewhere. I don't think the Knicks can win a championship as currently constructed either. Paul: Does LeBron make the Knicks better? Yes, but 29 other teams would say the same thing.YouTube", "quote": "Kellerman: He will be on the Lakers at the end of this year. Pau: Yeah. Where's he going to go? Kellerman: I mean, New York comes to mind. Paul: That's wishful thinking. You're from New York. Kellerman:", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=sokxu0dYIEM&t=2918s", "tags": ["Los Angeles Lakers", "New York Knicks", "Trade", "LeBron James", "Rich Paul"]}, {"date": "", "archive_date": "2025-12-09", "text": "While LeBron James appears tied to the Lakers for the rest of the season, Rich Paul doesn't see another championship in the franchise's future as it's currently constructed. While LA is 17-6 and second in the Western Conference, it's not a title-winning team, he believes.\"I, personally, don't think the Lakers are good enough to be contenders right now. Not right now,\" Paul said. \"I don't think they have enough to get to the Western Conference Final.I don't think they really have enough to contend from that perspective right now.\"Yahoo! Sports", "quote": "\"I, personally, don't think the Lakers are good enough to be contenders right now. Not right now,\" Paul said. \"I don't think they have enough to get to the Western Conference Final.", "outlet": "Yahoo! Sports", "source_url": "https://sports.yahoo.com/nba/article/rich-paul-says-lebron-james-will-finish-2025-26-as-a-member-of-the-lakers-wheres-he-gonna-go-144718561.html", "tags": ["Los Angeles Lakers", "Rich Paul"]}, {"date": "", "archive_date": "2025-12-09", "text": "For example,Mike Brown’s Knicks are one of the league’s top two-way rebounding groups this season, able to gobble up misses after all types of clanks.The Knicks create 4.6 more scoring chances per game than their opponents receive (let’s call these “net chances”), the most in the NBA, according to Second Spectrum. No other team averages more than four, though that’s not for lack of trying. Think about it like this: Based on how many points the Knicks average, an advantage of 4.6 scoring chances spots them 5.6 points. That can be the difference between a win and a loss. Because of numbers like that, which also take turnovers into account, offensive rebounding — not just in New York but everywhere — is booming.New York Times", "quote": "Mike Brown’s Knicks are one of the league’s top two-way rebounding groups this season, able to gobble up misses after all types of clanks.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["New York Knicks", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-09", "text": "As of Monday, Houston had recovered 40.8 percent of its own missed shots, a rate that would annihilate the previous single-season record, which dates back to 1996, when the NBA began compiling reliable play-by-play data. But the Rockets should be even better — so says Udoka. Houston is overflowing with size, regularly leaning on lineups where the shrimp is 6-foot-7 Amen Thompson, who lives for physicality. A bunch of pseudo 7-footers surround him. And Udoka has encouraged the group to crash the offensive glass even more than it has.New York Times", "quote": "As of Monday, Houston had recovered 40.8 percent of its own missed shots, a rate that would annihilate the previous single-season record, which dates back to 1996, when the NBA began compiling reliable play-by-play data", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["Houston Rockets", "Amen Thompson"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Rockets’ model to win the rebounding battle, and thus the possession game, is even more extreme than the Celtics’. Houston scores the fourth-most points per possession of any team in the league, yet has treaded around the middle of the pack in shooting efficiency all season. Unlike Boston, the Rockets don’t take many 3s turn the ball over in bunches. Their best offense is a missed shot.“Not sounding mean or anything,” Steven Adams prefaced, “but if you know your team isn’t that great at shooting, you’re gonna need more attempts.”New York Times", "quote": "“Not sounding mean or anything,” Steven Adams prefaced, “but if you know your team isn’t that great at shooting, you’re gonna need more attempts.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["Boston Celtics", "Houston Rockets", "Steven Adams"]}, {"date": "", "archive_date": "2025-12-09", "text": "There is a calculated effort by the coach to make his players share an observation: Hey, look at this freaking maniac. If it’s all X’s and O’s without energy, work will feel like a chore. If it’s emotion without on-court specificity, nothing will be learned.“He’s definitely the leader. The best thing is he knows he is a leader, but he allows the coaching staff to be leaders as well, and to help you in different situations,” Sandro Mamukelashvili said.“And the players, everybody’s a leader. … Everybody has a voice (on) this team. That’s the best thing. You’re not shutting everyone out and saying I’m the guy, but allowing everyone to express themselves and be open.”New York Times", "quote": "“He’s definitely the leader. The best thing is he knows he is a leader, but he allows the coaching staff to be leaders as well, and to help you in different situations,” Sandro Mamukelashvili said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6866143/2025/12/09/raptors-coach-darko-rajakovic-direct-communication-style/", "tags": ["Toronto Raptors", "Darko Rajakovic", "Sandro Mamukelashvili"]}, {"date": "", "archive_date": "2025-12-09", "text": "Therefore, Europeans must favour direct communication more than coaches trained in North America.“First, I don’t see myself as European,” Darko Rajaković intervened. “I’m Serbian.”New York Times", "quote": "“First, I don’t see myself as European,” Darko Rajaković intervened. “I’m Serbian.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6866143/2025/12/09/raptors-coach-darko-rajakovic-direct-communication-style/", "tags": ["Toronto Raptors", "Serbia", "Darko Rajakovic"]}, {"date": "", "archive_date": "2025-12-09", "text": "Anthony Davis of the Dallas Mavericks, another former NBA champion, is expected to be a critical trade target of several teams, including many of the East's contenders.The Detroit Pistons, Atlanta Hawks and Toronto Raptors are expected to be suitors for Davis,league sources told ESPN.ESPN", "quote": "The Detroit Pistons, Atlanta Hawks and Toronto Raptors are expected to be suitors for Davis,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Atlanta Hawks", "Dallas Mavericks", "Detroit Pistons", "Toronto Raptors", "Trade", "Klay Thompson", "Anthony Davis", "D'Angelo Russell", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-09", "text": "TheMavericks are open to exploring the trade markets for Davis, center Daniel Gafford and guards Klay Thompson and D'Angelo Russell, sources said.ESPN", "quote": "Mavericks are open to exploring the trade markets for Davis, center Daniel Gafford and guards Klay Thompson and D'Angelo Russell, sources said.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Dallas Mavericks", "Trade", "Klay Thompson", "D'Angelo Russell", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-09", "text": "\"The writing is on the wall,\" one source with direct knowledge of the Bucks' dynamics with Giannis Antetokounmpo told ESPN this month. If the Bucks are open to discussing Antetokounmpo with teams, the Knicks will no longer have the exclusive negotiating window as his preferred destination, sources told ESPN.ESPN", "quote": "\"The writing is on the wall,\" one source with direct knowledge of the Bucks' dynamics with Giannis Antetokounmpo told ESPN this month", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Milwaukee Bucks", "New York Knicks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-09", "text": "As reported last week, Antetokounmpo, who is out for several weeks because of a right calf strain, and his agent Alex Saratsis have opened discussions with the Bucks about the future and whether the best path forward is to stay in Milwaukee or a trade. The Bucks are 10-15, having lost 10 of their past 12 games, and have spent most of the past few weeks at No. 10 or No. 11 in the Eastern Conference standings.Should the Bucks' slide continue, sources said discussions between Antetokounmpo's representation and the franchise will escalate and lead to a resolution before the Feb. 5 trade deadline.ESPN", "quote": "Should the Bucks' slide continue, sources said discussions between Antetokounmpo's representation and the franchise will escalate and lead to a resolution before the Feb. 5 trade deadline", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo", "Alex Saratsis"]}, {"date": "", "archive_date": "2025-12-09", "text": "TheWarriors will discuss trades for forward Jonathan Kuminga when he is eligible to be moved Jan. 15, sources said,after discussions with the Phoenix Suns and Sacramento Kings in the summer failed to progress. Golden State wants to find upgrades on its roster, and Kuminga's $22.5 million salary could be used in bigger trade scenarios.ESPN", "quote": "Warriors will discuss trades for forward Jonathan Kuminga when he is eligible to be moved Jan. 15, sources said,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Golden State Warriors", "Trade", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Kings and first-year general manager Scott Perry are using this season as a patient evaluation campaign, trying to build a gritty culture.They are open-minded about trade talks throughout the roster, sources said.Teams are monitoring veterans Domantas Sabonis, Zach LaVine and DeMar DeRozan, along with 25-year-old guard Keon Ellis.ESPN", "quote": "They are open-minded about trade talks throughout the roster, sources said.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Sacramento Kings", "Trade", "DeMar DeRozan", "Scott Perry", "Zach LaVine", "Domantas Sabonis", "Keon Ellis"]}, {"date": "", "archive_date": "2025-12-09", "text": "The Nets have $15 million in cap space and can create more, which has led to increased trade talks about using their room to absorb salary while receiving assets, sources said.The Nets, Pistons ($14.1 million trade exception) and Utah Jazz ($18.4 million trade exception) are the only teams with significant room that can take in larger deals and not be impacted by the apron.ESPN", "quote": "The Nets have $15 million in cap space and can create more, which has led to increased trade talks about using their room to absorb salary while receiving assets, sources said.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Detroit Pistons", "Brooklyn Nets", "Utah Jazz", "Trade"]}, {"date": "", "archive_date": "2025-12-09", "text": "Hawksstar Trae Young, who sustained a sprained MCL on Oct. 29, is optimistic about returning to action this month, sources said.ESPN", "quote": "star Trae Young, who sustained a sprained MCL on Oct. 29, is optimistic about returning to action this month, sources said", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Atlanta Hawks", "Injuries", "Trae Young"]}, {"date": "", "archive_date": "2025-12-09", "text": "He also expressed his desire to finish his career with Olympiacos and reflected on how he managed to adapt so quickly to Giorgos Bartzokas’ playing style. “When I was younger, I was really emotional on the court. I played with a lot of emotion — maybe too much. In the NBA, there are simply too many games for that. You’re going to get crushed, you’re going to have crazy ups and downs because you feel and absorb all those emotions. And even though I’m more stoic now, the passion here allowed me to reconnect with that side of myself. It felt amazing to play with that ‘fire’ and that energy again… I really missed it. I’m truly happy that here I got to feel alive again!”EuroHoops.net", "quote": "He also expressed his desire to finish his career with Olympiacos and reflected on how he managed to adapt so quickly to Giorgos Bartzokas’ playing style", "outlet": "EuroHoops.net", "source_url": "https://www.eurohoops.net/en/euroleague/1904805/evan-fouriner-wants-to-end-his-career-in-olympiacos-this-is-where-i-want-to-stay-this-is-my-home-now/", "tags": ["Euroleague", "Greece", "Olympiacos", "Evan Fournier"]}, {"date": "", "archive_date": "2025-12-09", "text": "Mavericks governor Patrick Dumont has taken a patient approach since firing general manager Nico Harrison on Nov. 11. Dumont has relied on Finley, Riccardi, coach Jason Kidd and minority owner Mark Cuban in his front office corps, and has given Finley and Riccardi the power to lead conversations on the franchise's future.A GM search is still expected in the offseason, and Finley and Riccardi are expected to be candidates, sources said.ESPN", "quote": "A GM search is still expected in the offseason, and Finley and Riccardi are expected to be candidates, sources said", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47245704/shams-pass-nba-trade-deadline-notes-news-buzz-anthony-davis-giannis-antetokounmpo-teams", "tags": ["Dallas Mavericks", "Jason Kidd", "Mark Cuban", "Nico Harrison", "Patrick Dumont"]}]