[{"date": "", "archive_date": "2025-12-17", "text": "Kevin Durant blames Stephen Curry, Damian Lillard for the downfall of the All-Star Game:LeBron James locked in every all star game. He not out there shooting from half court. I’m blaming Steph. It’s Steph fault. He come out there and shoot half court bro. I’m blaming him for the All Star game. I’m blaming Dame tooYouTube", "quote": "Kevin Durant blames Stephen Curry, Damian Lillard for the downfall of the All-Star Game:", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WP3zzI52YNc", "tags": ["Golden State Warriors", "Houston Rockets", "Los Angeles Lakers", "Portland Trail Blazers", "LeBron James", "Kevin Durant", "Stephen Curry", "Damian Lillard", "All Star Game"]}, {"date": "", "archive_date": "2025-12-17", "text": "Steve Kerr: Whatever we can do in the NBA to encourage winning and to incentivize staying out of the bottom few teams. Even as hard as we try, we do incentivize teams to take a fewyears… And I mean, look at OKC. I mean, they're where they are right now. They're on top of the world, but they were kind of at the bottom for a few years and embraced it and got a bunch of high picks and nailed all those picks and now they're they're killing it. So you can't actually tell a franchise, ‘hey don't do what OKC did’, because it worked. Problem is it doesn't always work.YouTube", "quote": "years… And I mean, look at OKC. I mean, they're where they are right now. They're on top of the world, but they were kind of at the bottom for a few years and embraced it and got a bunch of high picks and nailed all those picks and now they're they're killing it. So you can't actually tell a franchise, ‘hey don't do what OKC did’, because it worked. Problem is it doesn't always work", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=-J_AHwzy9yE&t=2115s", "tags": ["Golden State Warriors", "Oklahoma City Thunder", "Draft", "Steve Kerr", "Tanking"]}, {"date": "", "archive_date": "2025-12-17", "text": "Jason Beede:Franz Wagner (left high ankle sprain) and Moe Wagner (left knee injury recovery) won’t travel with the #Magic on the team’s upcoming 4-game West Coast road trip, I’m told. The duo will remain in Orlando to focus on rehab. Meanwhile, Jalen Suggs (left hip contusion) will travel.x.com", "quote": "Franz Wagner (left high ankle sprain) and Moe Wagner (left knee injury recovery) won’t travel with the #Magic on the team’s upcoming 4-game West Coast road trip, I’m told", "outlet": "x.com", "source_url": "https://x.com/therealBeede/status/2001317803895210208?s=20", "tags": ["Orlando Magic", "Injuries", "Jalen Suggs", "Franz Wagner"]}, {"date": "", "archive_date": "2025-12-17", "text": "Jason Beede:#Magic coach Jamahl Mosley said Jalen Suggs (left hip contusion) “wasn’t able to go and do much in practice,” Wednesday. Mosley said Suggs focused on his recovery and rode the stationary bike a little bit.x.com", "quote": "#Magic coach Jamahl Mosley said Jalen Suggs (left hip contusion) “wasn’t able to go and do much in practice,” Wednesday. Mosley said Suggs focused on his recovery and rode the stationary bike a little bit", "outlet": "x.com", "source_url": "https://x.com/therealBeede/status/2001344755238932695?s=20", "tags": ["Orlando Magic", "Injuries", "Jamahl Mosley", "Jalen Suggs"]}, {"date": "", "archive_date": "2025-12-17", "text": "Marc Stein:Anthony Davis (left calf contusion) will remain listed as questionable for Thursday’s home game against Detroit, says Mavericks coach Jason Kidd. Davis missed Monday’s game in Utah after playing in the previous six.x.com", "quote": "Anthony Davis (left calf contusion) will remain listed as questionable for Thursday’s home game against Detroit, says Mavericks coach Jason Kidd", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2001357147121263045?s=20", "tags": ["Dallas Mavericks", "Jason Kidd", "Injuries", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-17", "text": "Atlanta Hawks fans have been counting down the days until point guard Trae Young returns to the lineup from his MCL sprain suffered earlier this season. The Hawks have managed to hold down the fort in his absence, currently sitting just a game out of third place in the Eastern Conference, but the team would still certainly like to have its floor general back in uniform. On Wednesday, the team announced the latest update on Young’s return process.“The Atlanta Hawks announced today that guard Trae Young has been recalled to the Hawks from the College Park Skyhawks,” reported Hawks PR on X, formerly Twitter.Clutch Points", "quote": "“The Atlanta Hawks announced today that guard Trae Young has been recalled to the Hawks from the College Park Skyhawks,” reported Hawks PR on X, formerly Twitter", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/atlanta-hawks/hawks-news-atlanta-makes-trae-young-decision-ahead-imminent-return", "tags": ["Atlanta Hawks", "G League", "Injuries", "Trae Young"]}, {"date": "", "archive_date": "2025-12-17", "text": "Anthony Chiang: Herro took a Toradol shot to play against the Magic last week before missing Monday's game vs. Raptors.Herro: \"I’m just trying to control the swelling and the inflammation, and then from there I can kind of decide what I want to do from there.”x.com", "quote": "Herro: \"I’m just trying to control the swelling and the inflammation, and then from there I can kind of decide what I want to do from there.”", "outlet": "x.com", "source_url": "https://x.com/Anthony_Chiang/status/2001350283310567771?s=20", "tags": ["Miami Heat", "Injuries", "Tyler Herro"]}, {"date": "", "archive_date": "2025-12-17", "text": "Giannis Antetokounmpo is not only a superstar but one who still, at age 31, has the potential to join LeBron James as a very rare superstar who avoids catastrophic injury in his early 30s. His diet, his training, his offseason regimen, his sleep, his ability to read the defense … it’s probably all better than average in a way that makes average stats inapplicable. (And, not for nothing, an average NBA career would have ended a long time ago.)So we’re in rare air. As a long and position-defying big, Kevin Garnett is an interesting Giannis comparison. (He’s also a generous one, in that he had one of the longest careers in history, playing an incredible 20 seasons.) That’s good news for anyone interested in employing Giannis in the future: Garnett was only 60 percent of the way through his career at Giannis’ age. However, by 31 Garnett had already delivered 79 percent of the Win Shares he’d ever muster.TrueHoop", "quote": "Giannis Antetokounmpo is not only a superstar but one who still, at age 31, has the potential to join LeBron James as a very rare superstar who avoids catastrophic injury in his early 30s. His diet, his training, his offseason regimen, his sleep, his ability to read the defense … it’s probably all better than average in a way that makes average stats inapplicable. (And, not for nothing, an average NBA career would have ended a long time ago.)", "outlet": "TrueHoop", "source_url": "https://www.truehoop.com/p/how-many-wins-does-giannis-have-left", "tags": ["Los Angeles Lakers", "Milwaukee Bucks", "LeBron James", "Statistics", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-17", "text": "Tom Tolbert:They're not getting rid of the draft. I hate when that article comes out every three or four years: ‘Hey, abolish the draft. Not f*cking getting rid of the draft. Not going to happen. It's a money maker.Steve Kerr: It’s true. Tolbert: Anything that makes money is not going to go bye-bye. It's not. Kerr: What if you couldn't get the first pick if you were in the last five spots or something? I know right now we have these tier odds as to you know for the teams that can win the lottery and who can't win the lottery. What if you incentivize teams to actually finish higher than the last spot or in the last three spots?YouTube", "quote": "They're not getting rid of the draft. I hate when that article comes out every three or four years: ‘Hey, abolish the draft. Not f*cking getting rid of the draft. Not going to happen. It's a money maker.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=-J_AHwzy9yE&t=2230s", "tags": ["Golden State Warriors", "Draft", "Steve Kerr", "Tom Tolbert"]}, {"date": "", "archive_date": "2025-12-17", "text": "Earl Watson:So Jimmy Butler gets on the block. We're on a road trip. We land. Robert Sarver sends me a text. ‘Come to my house immediately.’ It's like two or three in the morning. I'm not trying to go to nobody house in no two in the morning. I'm trying to go home, right? [laughter] I pull up to the house. It's Sarver. It's Ryan McDonough. And Ryan kind of gave me a look like ‘here we go.’ So I sit down and he goes, \"We have a trade.\" And I go, \"What's the trade?\" I'm first year head coach. I'm always looking for us to get better. I'm now learning if you don't get better, you are obvious tanking, right? So I go, \"What's the trade?\" He goes, \"We have a trade for Devin Booker.We're going to send Devin to Chicago for Jimmy Butler.\" In that moment I am the biggest Devin Booker advocate, right? Would have been a hell of a team though: Eric Bledsoe, Tyson Chandler, Brandon Knight, Jimmy Butler. It could have changed my entire coaching trajectory, right? Q. But why weren't you rolling? Watson: I’ve seen I really seen a kid who could be one of the greatest players to ever play. And I sat there and I watched the kid work. I'm in the gym with the kid. I think coaches who don't get in the gym with their players, no matter what your position is as a coach, I think you lose imagination. You got to get on the court. You got to be in the workouts. You got to see what a player can actually do and cannot do. So when you get in the game and you draw up a play, you're confident in that play or you develop plays because you see something that you don't see in practice that you might see in an individual session. Right. So in that moment, Chris, and this was the beginning of the end of me in Phoenix. In that moment, Chris, I say, \"If you trade Devin Booker, I am resigning tonight.\" So, we go back and forth. And right now I feel sorry for Ryan McDonough because he is like ‘oh sh*t.’ I’m like I do not want to trade Devin Booker. You can build around him, I don't want to be the coach that traded potentially one of the best two guards, say five to 10 to ever play. I believe he had that potential. He had superstar potential.YouTube", "quote": "So Jimmy Butler gets on the block. We're on a road trip. We land. Robert Sarver sends me a text. ‘Come to my house immediately.’ It's like two or three in the morning. I'm not trying to go to nobody house in no two in the morning. I'm trying to go home, right? [laughter] I pull up to the house. It's Sarver. It's Ryan McDonough. And Ryan kind of gave me a look like ‘here we go.’ So I sit down and he goes, \"We have a trade.\" And I go, \"What's the trade?\" I'm first year head coach. I'm always looking for us to get better. I'm now learning if you don't get better, you are obvious tanking, right? So I go, \"What's the trade?\" He goes, \"We have a trade for Devin Booker.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=y4LuahTtXwA&t=1183s", "tags": ["Chicago Bulls", "Golden State Warriors", "Phoenix Suns", "Trade", "Eric Bledsoe", "Earl Watson", "Tyson Chandler", "Robert Sarver", "Jimmy Butler", "Brandon Knight", "Ryan McDonough", "Devin Booker"]}, {"date": "", "archive_date": "2025-12-17", "text": "Vin Baker: Michael Jordan, Scottie Pippen, Dennis Rodman. You're talking about three of the top 75 players ever, but that doesn't take away again that doesn't take away from how great the Golden State Warriors are.There's different eras. The game is played differently. Do I think there were more stars in the '90s? Absolutely. The top 30 players in the 90s compared to the top 30 players today, I think the 90s would win.YouTube", "quote": "There's different eras. The game is played differently. Do I think there were more stars in the '90s? Absolutely. The top 30 players in the 90s compared to the top 30 players today, I think the 90s would win", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=a3CXDWWGob0&t=2627s", "tags": ["Golden State Warriors", "Michael Jordan", "Scottie Pippen", "Vin Baker", "Dennis Rodman"]}, {"date": "", "archive_date": "2025-12-17", "text": "There was reverence, laughter, trash-talking and moist eyes when Bernie Bickerstaff — a former NBA head coach and general manager with 50 years of experience in the league — was celebrated by speeches from his adoring peers after Summer League action in late July. It was also just days after Mike Brown was being named the head coach of the New York Knicks. When considering the life-changing door that Bickerstaff opened for Brown to join him in the NBA in 1992, the pupil broke down emotionally while giving his salutatory speech. Once Brown collected himself and finished his words, Bickerstaff walked to the stage and embraced him.Andscape", "quote": "There was reverence, laughter, trash-talking and moist eyes when Bernie Bickerstaff — a former NBA head coach and general manager with 50 years of experience in the league — was celebrated by speeches from his adoring peers after Summer League action in late July", "outlet": "Andscape", "source_url": "https://andscape.com/features/new-york-knicks-coach-mike-brown-counts-bernie-bickerstaff-as-his-biggest-mentor/", "tags": ["New York Knicks", "Bernie Bickerstaff", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-17", "text": "“He cares, he appreciates, and he’s loyal,” Bickerstaff told Andscape. “That is who Mike is, but it was nothing that I expected. It was touching. And one thing I know, it was genuine. And as far as I’m concerned, it continues to solidify the relationship.”Said Brown: “He’s been a great guiding light for me in this business. More than that, he gave me an opportunity when he didn’t have to. And I’m going to always be appreciative of that.”Andscape", "quote": "“He cares, he appreciates, and he’s loyal,” Bickerstaff told Andscape. “That is who Mike is, but it was nothing that I expected. It was touching. And one thing I know, it was genuine. And as far as I’m concerned, it continues to solidify the relationship.”", "outlet": "Andscape", "source_url": "https://andscape.com/features/new-york-knicks-coach-mike-brown-counts-bernie-bickerstaff-as-his-biggest-mentor/", "tags": ["New York Knicks", "Bernie Bickerstaff", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-17", "text": "Four months later, Brown coached the Knicks to their first title in 50 years and enjoyed a beer to celebrate. The Knicks defeated the San Antonio Spurs 124-113 in the NBA Cup final at T-Mobile Center on Tuesday night. While it wasn’t an NBA championship, the title is the Knicks’ first since winning an NBA championship in 1973.Brown is a huge fan of the competitive nature the NBA Cup brings and believes the Knicks can use it as a confidence booster — offering a unique experience that can lead to that elusive, long-awaited championship in June.Andscape", "quote": "Brown is a huge fan of the competitive nature the NBA Cup brings and believes the Knicks can use it as a confidence booster — offering a unique experience that can lead to that elusive, long-awaited championship in June", "outlet": "Andscape", "source_url": "https://andscape.com/features/new-york-knicks-coach-mike-brown-counts-bernie-bickerstaff-as-his-biggest-mentor/", "tags": ["New York Knicks", "Bernie Bickerstaff", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-17", "text": "“You’ve got to give [NBA commissioner] Adam [Silver] a lot of credit and the NBA league office for creating an environment like this, because it helps us coaches add pressure to your group early in the season,” Brown said after the NBA Cup title. “This is a single-elimination tournament when you get to a certain point. Every game counts. “There is pressure on every game if you expect to be who you are. That pressure is manufactured without you as a coach having to do it all the time. And when you’re able to have success doing it, it breeds confidence in everybody within the organization. That can propel you come the right time when you’re in that environment because you’ve already been through it.”Andscape", "quote": "“You’ve got to give [NBA commissioner] Adam [Silver] a lot of credit and the NBA league office for creating an environment like this, because it helps us coaches add pressure to your group early in the season,” Brown said after the NBA Cup title. “This is a single-elimination tournament when you get to a certain point. Every game counts", "outlet": "Andscape", "source_url": "https://andscape.com/features/new-york-knicks-coach-mike-brown-counts-bernie-bickerstaff-as-his-biggest-mentor/", "tags": ["New York Knicks", "Mike Brown", "NBA Cup", "Adam Silve"]}, {"date": "", "archive_date": "2025-12-17", "text": "Sources told ESPN's Shams Charania that Giannis Antetokounmpo and his agent Alex Saratsis are discussing whether Antetokounmpo's best fit is still with the Bucks or elsewhere. \"Iknow that he asked for a trade and then said I'm going to be a Buck this year,\" ESPN's Brian Windhorst said on ESPN Cleveland on Wednesday. \"I know a lot of people in the league think he won't be a Buck next year.\"ESPN", "quote": "know that he asked for a trade and then said I'm going to be a Buck this year,\" ESPN's Brian Windhorst said on ESPN Cleveland on Wednesday. \"I know a lot of people in the league think he won't be a Buck next year.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47191162/nba-buzz-latest-live-updates-trades-intel-league", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo", "Alex Saratsis", "Shams Charania"]}, {"date": "", "archive_date": "2025-12-17", "text": "Dallas is open to exploring trades for Davis as well as veteran guards Klay Thompson and D'Angelo Russell,per sources.ESPN", "quote": "Dallas is open to exploring trades for Davis as well as veteran guards Klay Thompson and D'Angelo Russell,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47191162/nba-buzz-latest-live-updates-trades-intel-league", "tags": ["Dallas Mavericks", "Trade", "Klay Thompson", "Anthony Davis", "D'Angelo Russell"]}, {"date": "", "archive_date": "2025-12-17", "text": "The Warriors will be open to discussing trades for Jonathan Kuminga when he is eligible to be moved on Jan. 15,sources told ESPN's Shams Charania. Golden State hopes to improve the roster and Kuminga's $22.5 million salary could lead to a larger trade haul.ESPN", "quote": "The Warriors will be open to discussing trades for Jonathan Kuminga when he is eligible to be moved on Jan. 15,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47191162/nba-buzz-latest-live-updates-trades-intel-league", "tags": ["Golden State Warriors", "Trade", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-17", "text": "Sources told ESPN's Shams Charania that thePacers are in the market for a center after losing Myles Turner to the Milwaukee Bucks during the offseason.ESPN", "quote": "Pacers are in the market for a center after losing Myles Turner to the Milwaukee Bucks during the offseason", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47191162/nba-buzz-latest-live-updates-trades-intel-league", "tags": ["Indiana Pacers", "Milwaukee Bucks", "Myles Turner"]}, {"date": "", "archive_date": "2025-12-17", "text": "The Kings and first-year general manager Scott Perry are open to trade talks throughout the roster, sources told ESPN's Shams Charania.Teams around the league are keeping their eyes on veterans Domantas Sabonis, Zach LaVine and DeMar DeRozan, as well as 25-year-old guard Keon Ellis.ESPN", "quote": "Teams around the league are keeping their eyes on veterans Domantas Sabonis, Zach LaVine and DeMar DeRozan, as well as 25-year-old guard Keon Ellis", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47191162/nba-buzz-latest-live-updates-trades-intel-league", "tags": ["Sacramento Kings", "Trade", "DeMar DeRozan", "Scott Perry", "Zach LaVine", "Domantas Sabonis", "Keon Ellis"]}, {"date": "", "archive_date": "2025-12-17", "text": "Kevin Durant: I'm doing treatment around the clock. I'm going out to like 45 minutes outside of Toronto to use underwater treadmills, because that was the only one in the city. So I'm doing everything I can to get back to playing. I started to feel better, and then I went out and started to play 3-on-3 in practice, the day before, with my teammates, and I was moving good, so I'm thinking, 'For sure I'm playing.' I've been trying to play the whole time. We were trying to win three [championships] in a row, so I couldn't just sit out the rest of the series. I had to try. I felt like I put in a lot of work up until it was time to make a decision to play, so I decided to go out there. And I felt good, felt great. I came out, started good. .... I wasn't really thinking about a calf muscle could lead to an Achilles injury. I felt good, I could run up and down the court, slide laterally, I thought I was straight. Looking back on it, obviously, my Achilles wasn't ready for that type of load.I don’t regret playing. If I knew that information I would’ve made a different decision. If they told me ‘ah you can tear your Achilles I probably wouldn’t have went out there. Nobody really made me aware of that.YouTube", "quote": "I don’t regret playing. If I knew that information I would’ve made a different decision. If they told me ‘ah you can tear your Achilles I probably wouldn’t have went out there. Nobody really made me aware of that", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WP3zzI52YNc", "tags": ["Golden State Warriors", "Houston Rockets", "Kevin Durant", "Injuries"]}, {"date": "", "archive_date": "2025-12-17", "text": "Ira Winderman:Heat’s Norman Powell did not practice today due to calf tightness. No practice also for Jovic (elbow), Larsson (ankle) and Herro (toe).x.com", "quote": "Heat’s Norman Powell did not practice today due to calf tightness. No practice also for Jovic (elbow), Larsson (ankle) and Herro (toe)", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/2001334073726505323?s=20", "tags": ["Miami Heat", "Injuries", "Norman Powell", "Tyler Herro", "Nikola Jovic", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-17", "text": "Ira Winderman:The good news is Tyler Herro (toe contusion) will travel today with Heat for start of three-game trip. Listed as day to day. Trip opens Thursday vs. Nets.x.com", "quote": "The good news is Tyler Herro (toe contusion) will travel today with Heat for start of three-game trip. Listed as day to day. Trip opens Thursday vs. Nets", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/2001333596456653118?s=20", "tags": ["Miami Heat", "Injuries", "Tyler Herro"]}, {"date": "", "archive_date": "2025-12-17", "text": "Ian Begley:Knicks will not raise an NBA Cup banner at Madison Square Garden,per league source. NYK doesn't want to diminish accomplishment but has bigger goals in mind, winning title in June, source said. NYK is very proud of players & staff winning NBA Cup and will celebrate players/acknowledge title on Friday, giving home fans chance to congratulate players, source said.x.com", "quote": "Knicks will not raise an NBA Cup banner at Madison Square Garden,", "outlet": "x.com", "source_url": "https://x.com/IanBegley/status/2001329107817156658", "tags": ["New York Knicks", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Zach Lowe: \"TheClippers have shoved away people calling because the vultures are circling with Zubac. And the Clippers are shoving people away.\"Bill Simmons: \"I don't know if it's shoving. I think it's gentle pushing.\"YouTube", "quote": "Clippers have shoved away people calling because the vultures are circling with Zubac. And the Clippers are shoving people away.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=Y_0RAR2rM5Y&t=1778s", "tags": ["Los Angeles Clippers", "Trade", "Ivica Zubac"]}, {"date": "", "archive_date": "2025-12-17", "text": "Jovan Buha: My understanding is I think the Lakers are clinging to the 2026 pick for a potential shot at Giannis Antetokounmpo this summer or into next season or whatever star potentially becomes available this offseason.So that is a calculus within this of you could have three picks on draft night to trade which if let's just say for argument sake the Lakers have the 26th pick. You could theoretically or maybe back channel this like ‘hey Milwaukee if we give you this pick plus two other firsts plus sign-and-trade Austin Reaves and we make the money work, because it's the offseason, the typical CBA dynamics are a bit more flexible in terms of trades and you still have to get under the different aprons and caps at certain points, but there's a little bit more flexibility in the offseason, ‘Hey, would you do Austin plus X, plus three picks for Giannis?’ That's a conversation you could have and then you could draft technically like on behalf of Milwaukee.YouTube", "quote": "Jovan Buha: My understanding is I think the Lakers are clinging to the 2026 pick for a potential shot at Giannis Antetokounmpo this summer or into next season or whatever star potentially becomes available this offseason.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=PT-T3iaeCow&t=1881s", "tags": ["Los Angeles Lakers", "Milwaukee Bucks", "Draft", "Trade", "Giannis Antetokounmpo", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-17", "text": "Jovan Buha: I would not say this that they're certainly going to make a move. I I think they are likely to make a move, but that doesn't mean it's going to happen, right? Like I think it's more likely than not.The one thing with this though is if we go back to a couple years to the Mo Bomba Malik Beasley stuff and like how LA had those contracts that they could have done something with and decided not to. That is an example of LA not always maximizing their assets and this has been a bit of a trend in terms of having expiring contracts or different contracts that they can move. Like for example, I had someone tell me last summer, remember last summer was uh that the Cam Reddish contract, they had the Christian Wood contract, and they ultimately sat on those until they had to get rid of them during the season, and it partly cost them Gary Trent Jr., who, my understanding, as I reported last summer, he would have gone to LA over Milwaukee had LA had a roster spot.YouTube", "quote": "Jovan Buha: I would not say this that they're certainly going to make a move. I I think they are likely to make a move, but that doesn't mean it's going to happen, right? Like I think it's more likely than not.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=PT-T3iaeCow&t=3008s", "tags": ["Los Angeles Lakers", "Milwaukee Bucks", "Trade", "Malik Beasley", "Gary Trent Jr"]}, {"date": "", "archive_date": "2025-12-17", "text": "Kevin Durant's arrival in Houston raised expectations, but they likely won't be met without the continued growth of Thompson and Sengun. The young duo, 22 and 23, respectively, has played the most minutes this season together of any Rockets pair, per ESPN Research. They've also formed a budding chemistry that threatens to take the league by storm for years to come.\"One of the best things about KD is he wants the young guys to lead,\" Thompson said. \"He doesn't want us to just look for him. He tells me all the time, 'You can't play basketball like that.You've got to go do what you've got to do.' So, sometimes KD would just go and let me and Alpi do what we've got to do. When it's KD's time, he'll tell you.\"ESPN", "quote": "\"One of the best things about KD is he wants the young guys to lead,\" Thompson said. \"He doesn't want us to just look for him. He tells me all the time, 'You can't play basketball like that.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47318717/kevin-durant-chase-third-ring-comes-two-rockets-stars", "tags": ["Houston Rockets", "Kevin Durant", "Amen Thompson"]}, {"date": "", "archive_date": "2025-12-17", "text": "Following the example set by Durant certainly helps.\"The first time I saw KD work out, I thought I worked hard,\" Thompson said. \"He's telling me 'Go game speed [from the] first rep.' I thought I was going game speed. But there are levels to it.For a guy to be as good as he is and as skilled as he is, he works so efficiently and so hard. I've been watching him my whole life. I never thought I was going to be on a team with him. I didn't know he was [still] going to be playing. So, I feel like it's just full circle seeing him kill on TV, and now I get to see it in real life.\"ESPN", "quote": "\"The first time I saw KD work out, I thought I worked hard,\" Thompson said. \"He's telling me 'Go game speed [from the] first rep.' I thought I was going game speed. But there are levels to it.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47318717/kevin-durant-chase-third-ring-comes-two-rockets-stars", "tags": ["Houston Rockets", "Kevin Durant", "Amen Thompson"]}, {"date": "", "archive_date": "2025-12-17", "text": "\"I just started learning how to cut off of Alperen Sengun,\" Thompson said. \"He started pulling me to the side at shootaround [to tell me to] do this and that. That's [been since] my rookie year. We talk about it all the time, go to dinner, talk about stuff we could do.\"Durant calls the budding chemistry between Thompson and Sengun \"incredible.\" Sengun ranks as one of two players in the NBA averaging at least 23 points, 9 rebounds and 7 assists, according to ESPN Research, joining Nikola Jokic. Sengun is on pace to register career highs in points per game (23.5), assists (7.1) and 3-point field goal percentage (35%).ESPN", "quote": "\"I just started learning how to cut off of Alperen Sengun,\" Thompson said. \"He started pulling me to the side at shootaround [to tell me to] do this and that. That's [been since] my rookie year. We talk about it all the time, go to dinner, talk about stuff we could do.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47318717/kevin-durant-chase-third-ring-comes-two-rockets-stars", "tags": ["Houston Rockets", "Kevin Durant", "Alperen Sengun", "Amen Thompson"]}, {"date": "", "archive_date": "2025-12-17", "text": "All of those things combined — depth, belief and a willingness to try something different — is the recipe that creates champions. “Real” champions.“For one, it shows the confidence and trust that Mike has in us to figure it out,” Jalen Brunson said. “Also, it means he’s not afraid to fail, either. I think having that mindset, not being afraid to fail, is good for us because it allows us to continue to fight.It allows us to go out there and not worry about the result. We may play great defense on a possession and they hit a tough shot. We might play a great game all game and lose on the final buzzer. But we’re not afraid of failure, and I think that’s a big-time thing about us. We have to continue to have that mindset and thought process in whatever we do and continue to build off this.”New York Times", "quote": "“For one, it shows the confidence and trust that Mike has in us to figure it out,” Jalen Brunson said. “Also, it means he’s not afraid to fail, either. I think having that mindset, not being afraid to fail, is good for us because it allows us to continue to fight.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6895633/2025/12/17/knicks-nba-cup-champions/", "tags": ["New York Knicks", "Mike Brown", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-17", "text": "“Throughout the course of the year, you try to find situations to put pressure on your group,” Mike Brown said. “We divvy the season up into five-game segments. We tell the guys we’d like to go 5-0. 4-1 is pretty good. We’ll take 3-2. I do that, again, to try and put pressure on them, to let them know where we went during those five games.To manufacture it during the regular season is tough because there’s so many games, but you have to give Adam (Silver) and the league office a lot of credit for creating an environment like this because it helps us coaches add pressure to the group early in the season.This is a single-elimination tournament at a certain point. Every game counts. There’s pressure on every game if you expect to be who you think you are.”New York Times", "quote": "To manufacture it during the regular season is tough because there’s so many games, but you have to give Adam (Silver) and the league office a lot of credit for creating an environment like this because it helps us coaches add pressure to the group early in the season.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6895633/2025/12/17/knicks-nba-cup-champions/", "tags": ["New York Knicks", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-17", "text": "As great as the glory of the Cup may be, along with its hefty prize money, the Spurs might have gotten what they needed most in the long run.“Probably that word, more than anything, experience. Second game all together,” Mitch Johnson said. “Playing really competitive games against really, really good teams.Seasoned, experienced teams that have been in similar situations. I’m not sure about all the Cup experience of all teams. But to be able to feel those games, work those games, be in the moment in those games, I think, is a valuable experience.”New York Times", "quote": "“Probably that word, more than anything, experience. Second game all together,” Mitch Johnson said. “Playing really competitive games against really, really good teams.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6895706/2025/12/17/victor-wembanyama-grandmother-spurs-loss-nba-cup/", "tags": ["San Antonio Spurs", "Mitch Johnson"]}, {"date": "", "archive_date": "2025-12-17", "text": "“I don’t want to speak for them, but I’m assuming — and I felt — pretty frustrated because we lost the game,” Spurs coach Mitch Johnson said. “I’m also feeling, (that) after 25 games in, I believe, that we’ve shown some signs that we can be a pretty good team.We’ve also shown that we have a lot of areas of improvement. And I think that’s where we’re living today. Hopefully tomorrow, we can continue to get a little bit better and minimize some of the things that we need to improve on.”New York Times", "quote": "“I don’t want to speak for them, but I’m assuming — and I felt — pretty frustrated because we lost the game,” Spurs coach Mitch Johnson said. “I’m also feeling, (that) after 25 games in, I believe, that we’ve shown some signs that we can be a pretty good team.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6895682/2025/12/17/spurs-nba-cup-loss-wemby-thunder/", "tags": ["San Antonio Spurs", "Mitch Johnson"]}, {"date": "", "archive_date": "2025-12-17", "text": "Los Angeles Lakers superstar Luka Doncic is known for his highlight-reel plays on the court—and his generosity off it. This week, Luka surprised every member of the Lakers' basketball side with high-end electric bikes. After Tuesday's practice, head coach JJ Redick shared the news.\"He got everybody in basketball ops, I think it was 103 total gifts,\" Redick said. \"It's a very, very high-end e-bike. So, I'll be excited to drive that down to the beach, looking forward to it. Very nice gesture from him. The guys all really, really enjoyed it.\" Based on current retail prices, Luka's Christmas surprise is estimated to have cost over $340,000.BasketNews", "quote": "\"He got everybody in basketball ops, I think it was 103 total gifts,\" Redick said. \"It's a very, very high-end e-bike. So, I'll be excited to drive that down to the beach, looking forward to it. Very nice gesture from him. The guys all really, really enjoyed it.\" Based on current retail prices, Luka's Christmas surprise is estimated to have cost over $340,000", "outlet": "BasketNews", "source_url": "https://basketnews.com/news-236985-luka-doncic-spends-enormous-amount-of-money-on-lakers-christmas-gifts.html", "tags": ["Los Angeles Lakers", "JJ Redick", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-17", "text": "Ramona Shelburne: Some of the things early on — like, he invited guys to his suite at the Rams game, and he threw a Halloween party, and then... no one came. After that, they get worked the first night in Utah, which makes this even sadder. Like, seriously — a Halloween party, and maybe three players showed up. I think Brad came, and Zubac. Chris is trying to be like, “I’m going to help you build some culture. I’ll bring guys over to my house. Let’s work out together. Let’s have a Halloween party.He and his wife threw the party in the suite after the Halloween game — and again, only three players came.So you’re looking at this and thinking: he’s trying to fill the leadership void the way he knows how, and every time he did, they would kind of recoil. Like, “Eh, it’s too much.”YouTube", "quote": "He and his wife threw the party in the suite after the Halloween game — and again, only three players came.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=dCQpzZuFZmU", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-17", "text": "Jared Weiss:Victor Wembanyama learned Tuesday morning that his grandmother has passed away in France,a team source told @TheAthletic . Wembanyama was in tears during his post-game press conference and said, \"I'm sorry, I lost somebody today.\"x.com", "quote": "Victor Wembanyama learned Tuesday morning that his grandmother has passed away in France,", "outlet": "x.com", "source_url": "https://x.com/JaredWeissNBA/status/2001174243263045791", "tags": ["San Antonio Spurs", "Deaths", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "“It’s do-or-die, I think, out there,” said Spurs rookie Dylan Harper, who led San Antonio with 21 points off the bench. “You’ve seen the level of intensity rise up for us, and them.Obviously, they came out with the win. But for us, it’s not taking anything for granted; I think that’s the biggest thing. When we all go out there, we all know that we’ve got to play 110% in order to win things like this.”Washington Post", "quote": "“It’s do-or-die, I think, out there,” said Spurs rookie Dylan Harper, who led San Antonio with 21 points off the bench. “You’ve seen the level of intensity rise up for us, and them.", "outlet": "Washington Post", "source_url": "https://www.washingtonpost.com/sports/nba/2025/12/16/spurs-nba-cup-wembanyama/e9ad4b74-db03-11f0-b484-4459fa8e79e5_story.html", "tags": ["San Antonio Spurs", "NBA Cup", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-17", "text": "Josh Hart:Damn in 4k…..x.com", "quote": "Damn in 4k….", "outlet": "x.com", "source_url": "https://x.com/joshhart/status/2001173285095301213", "tags": ["New York Knicks", "Josh Hart", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Lacob himself, which Simon and SFGate confirmed through Warriors Senior Vice President of Communications Raymond Ridder, actually replied to the fan's email two minutes after Dutari sent it,and relayed his shared frustration while stating he was \"working on it.\" “You can’t be as frustrated as me,” Lacob wrote. “I am working on it. It’s complicated. Style of play. Coaches desires regarding players. League trends. Jimmy is not the problem. Joe\"NBC Sports Bay Area", "quote": "Lacob himself, which Simon and SFGate confirmed through Warriors Senior Vice President of Communications Raymond Ridder, actually replied to the fan's email two minutes after Dutari sent it,", "outlet": "NBC Sports Bay Area", "source_url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/joe-lacob-fan-email/1900064/", "tags": ["Golden State Warriors", "Joe Lacob", "Jimmy Butler"]}, {"date": "", "archive_date": "2025-12-17", "text": "During Tuesday's practice, he was asked if he feels the Suns have their respect back.“Every day, you fight for respect every day,” Ott said. “This league changes too fast. Too many things can happen. LeBron (James) is still out there fighting, so it's like every day you get out there. We're all trying to be the best that we can, really challenge ourselves to grow. The only way to do that is to play, be in the arena. “Like it's easy from the outside. It's easy to say the only way to get better is to be in the heat, and our group enjoys it, and we want to be in those environments. We talked about it in Oklahoma City. We'd love to be playing obviously in Vegas, but we've had some of those moments where it's going to get like that because we want to be there, and that'll make us grow.Clutch Points", "quote": "“Every day, you fight for respect every day,” Ott said. “This league changes too fast. Too many things can happen. LeBron (James) is still out there fighting, so it's like every day you get out there. We're all trying to be the best that we can, really challenge ourselves to grow. The only way to do that is to play, be in the arena", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/phoenix-suns/do-the-suns-have-respect-back-jordan-ott-seems-to-think-so", "tags": ["Phoenix Suns", "Jordan Ott"]}, {"date": "", "archive_date": "2025-12-17", "text": "Despite a move from linear television to streaming,the NBA Cup semifinals posted a healthy increase over last year. Saturday’s NBA Cup semifinals averaged 1.67 million viewers on Amazon Prime Video, up 14% from last year, when the games aired on ABC and TNT. The double-digit increase is a sharp turnaround from the quarterfinals, which were down 20%.Sports Media Watch", "quote": "the NBA Cup semifinals posted a healthy increase over last year", "outlet": "Sports Media Watch", "source_url": "https://www.sportsmediawatch.com/2025/12/nba-cup-viewership-semifinals-up-prime-video/", "tags": ["TV Ratings", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Norman Powell: “I was extremely surprised just because, one, the year that I had, you know, almost making All-Star, um, filling that void. Like they—I feel like they didn't think that I'd been able to step into that role the way I did. Andthen like everybody talking about how I did in the season and them, you know, being up for the contract extension, going into the exit meetings and stuff and talking to them like, ‘Oh, we love you, we want you here as a Clipper, we’ll figure out the extension.’Uh, when I come back—I was in Europe too with my girlfriend—uh, ‘When you come back, Summer League, that’s when talks and stuff open up.’ So I’m expecting that. About maybe like four days before my trip over, talking to my agent, that there’s like some smoke in the air, some rumblings and stuff. Um, then he called me, uh, two days later—I’m on a damn boat trip, doing a tour with my girl, in the middle of the tour—shut the whole thing down. Like, tour over with.”YouTube", "quote": "then like everybody talking about how I did in the season and them, you know, being up for the contract extension, going into the exit meetings and stuff and talking to them like, ‘Oh, we love you, we want you here as a Clipper, we’ll figure out the extension.’", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=zB2AEX1EUPo", "tags": ["Los Angeles Clippers", "Miami Heat", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-17", "text": "Norman Powell:Yeah, but I was shocked because they were just saying that they want to give me an extension. And then from there to being traded, you know, it’s like—you have to tell me that, right? Just keep it business.Don’t tell me you want me here, then you just automatically trade me for whatever.YouTube", "quote": "Yeah, but I was shocked because they were just saying that they want to give me an extension. And then from there to being traded, you know, it’s like—you have to tell me that, right? Just keep it business.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=zB2AEX1EUPo", "tags": ["Los Angeles Clippers", "Miami Heat", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-17", "text": "Norman Powell:“The anger and s*** goes toward the front office, you know what I mean? Um, usually does. So like my job is to go out there and show you that you made a mistake—not that, you know, whatever you feel for your team. But I’m gonna come out and prove to you that, like, y’all shouldn’t have traded me. “So that’s where my motivation comes from. But like, yeah, I don’t find motivation from like other players and what they doing. I feel like I’m past that. Like I had that when I was first coming into the league—like that whole list. I’m a 46 pick, but they got Rashad Vaughn, Terry Rozier, they got Delon Wright. Like I had like RJ Hunter, a whole list of guys that were kill—that were drafted ahead of me. Like, ‘Oh, you think 45 people are better than me? All right, cool. I’m gonna go show you.’YouTube", "quote": "“The anger and s*** goes toward the front office, you know what I mean? Um, usually does. So like my job is to go out there and show you that you made a mistake—not that, you know, whatever you feel for your team. But I’m gonna come out and prove to you that, like, y’all shouldn’t have traded me", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=zB2AEX1EUPo", "tags": ["Los Angeles Clippers", "Miami Heat", "RJ Hunter", "Delon Wright", "Rashad Vaughn", "Terry Rozier", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-17", "text": "Marc J. Spears:KAT donating his $500K to his foundation in the Dominican Republic to help kids.x.com", "quote": "KAT donating his $500K to his foundation in the Dominican Republic to help kids", "outlet": "x.com", "source_url": "https://x.com/MarcJSpears/status/2001154553572724743", "tags": ["New York Knicks", "Karl-Anthony Towns", "Philanthropy", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't:KAT: \"Damn don't I look good when it says champions on a shirt?\"x.com", "quote": "KAT: \"Damn don't I look good when it says champions on a shirt?\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001155412469367192", "tags": ["New York Knicks", "Karl-Anthony Towns", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't: Wemby:\"Some people are built for this moment and some aren't…we definitely are\"x.com", "quote": "\"Some people are built for this moment and some aren't…we definitely are\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000081924748960161", "tags": ["San Antonio Spurs", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "MrBuckBuck: Knicks sophomoreTyler Kolek recreates the Kobe championship photox.com", "quote": "Tyler Kolek recreates the Kobe championship photo", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2001159224047304983", "tags": ["New York Knicks", "NBA Cup", "Tyler Kolek"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't: UD: \"Every team could use a Josh Hart bro. I love what you do dawg\" Josh: \"Appreciate you\"Jalen: \"Not if that coach looks to practice a lot\"x.com", "quote": "Jalen: \"Not if that coach looks to practice a lot\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001154200642654445", "tags": ["New York Knicks", "Frivolities", "Josh Hart", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't:Mike Brown: \"Excuse me I just had a beer. Excuse me mom\"x.com", "quote": "Mike Brown: \"Excuse me I just had a beer. Excuse me mom\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001152186349216139", "tags": ["New York Knicks", "Mike Brown", "Frivolities", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Austin Rivers:\"Ja’s gotta get out of Memphis. I’ve seen it. I’ve seen the experiment. I’m over it. He’s done a lot of great things there. He’s had playoff runs. He’s a very talented player. I’d like a fresh start for him — somewhere that makes sense. I would like him paired with another star. I don’t want Ja to be the best player. I don’t mind if he’s one of them, meaning like if he’s your one or two. I just don’t want him to stand out so alone. I want him to be paired with someone he can go to battle with — realistically — and actually compete. That’s a fresh start. Out of Memphis. I think the market for him down there — I would like him to get a whole rebrand. He is a star.”YouTube", "quote": "\"Ja’s gotta get out of Memphis. I’ve seen it. I’ve seen the experiment. I’m over it", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=qe54WoLUod8", "tags": ["Memphis Grizzlies", "Trade", "Austin Rivers", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-17", "text": "Sactown Sports 1140: Sacramento Kings forward Keegan Murray was asked how he's been processing Sacramento's losses. \"It sucks,\" he said after Tuesday's practice.\"I haven't been on a team that has lost many games in I don't even know how long.\"x.com", "quote": "\"I haven't been on a team that has lost many games in I don't even know how long.\"", "outlet": "x.com", "source_url": "https://x.com/Sactown1140/status/2001065920077127906?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E2001065920077127906%7Ctwgr%5Efacef32d91d77c24d974c6575621c594b398a201%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fbasketnews.com%2Fnews-236974-keegan-murray-sends-horrific-words-as-brutal-season-continues-for-kings.html", "tags": ["Sacramento Kings", "Keegan Murray"]}, {"date": "", "archive_date": "2025-12-16", "text": "After months of fact-finding and vetting from J.P. Morgan and the Raine investment group, CommissionerAdam Silver said Tuesday night that NBA is on the verge of “serious conversations” in January with prospective NBA Europe franchises that some sources believe will be tantamount to open bidding. Other sources said that the NBA Europe’s financial blueprint is crystalizing by the day. A salary cap still needs to be formalized, but a source familiar with the template said the NBA’s 30 current owners will won 50% of the league and the European franchises will own the other 50% —similar to how the WNBA is structured.Sports Business Journal", "quote": "Adam Silver said Tuesday night that NBA is on the verge of “serious conversations” in January with prospective NBA Europe franchises that some sources believe will be tantamount to open bidding", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/nba-europe-franchise-bids-could-come-in-january/", "tags": ["Adam Silver", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "Source have said that the NBA is seeking between $500M and $1B for NBA Europe franchise fees, and Silver reiterated Tuesday night that the possibilities include “soccer clubs, some who have basketball teams,some who don’t have basketball teams, existing basketball organizations who potentially would be interested in joining our league. We’re talking to other organizations or individuals who don’t own any team who would be interested if we expanded to Europe, looking at opportunities.”Sports Business Journal", "quote": "Source have said that the NBA is seeking between $500M and $1B for NBA Europe franchise fees, and Silver reiterated Tuesday night that the possibilities include “soccer clubs, some who have basketball teams,", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/nba-europe-franchise-bids-could-come-in-january/", "tags": ["NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "Considering Rockets F Kevin Durant is an investor in PSG, another prospective NBA Europe franchise, Siver said the NBA would have to “figure out a framework for those issues and work with the Players Association on that.”Under the current CBA, NBA players can only invest in WNBA franchise — not NBA teams.Sports Business Journal", "quote": "Considering Rockets F Kevin Durant is an investor in PSG, another prospective NBA Europe franchise, Siver said the NBA would have to “figure out a framework for those issues and work with the Players Association on that.”", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/nba-europe-franchise-bids-could-come-in-january/", "tags": ["Houston Rockets", "Kevin Durant", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "NBA VP/Global Partner Management David Brody gave a glimpse into the efforts of launching NBA Europe, according to a Q&A with Sam Bradley of DIGIDAY. Questions and answers have been edited for clarity and brevity. Q: Is the demand for more European players becoming global superstars in the NBA enough to support a European extension of the league? Brody:“The NBA is a global culture phenomenon. You can’t underscore just how important the culture aspect is to the commercial area of the business. You don’t have to look far into music, film, fashion, arts, technology to see an NBA player front and center. When I’m sitting down with brands…they want to talk about three things. One is where we sit in culture.Two, this unmatched, unparalleled global audience. And three, [that it’s] a young, multicultural, diverse, tech savvy audience. I think there’s tremendous opportunity.” Q: Would this mean importing the NBA’s American business model to Europe? Brody: “We have 17 offices around the world. I think we’re unique in the sports landscape in terms of that kind of commitment to having boots on the ground in local markets. In our London office, we have over 100 employees who wake up every single day thinking about the fact that the basketball experience there is different from where it is in the United States.”Sports Business Journal", "quote": "“The NBA is a global culture phenomenon. You can’t underscore just how important the culture aspect is to the commercial area of the business. You don’t have to look far into music, film, fashion, arts, technology to see an NBA player front and center. When I’m sitting down with brands…they want to talk about three things. One is where we sit in culture.", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/qa-nbas-brody-details-efforts-plans-for-possible-european-extension/", "tags": ["NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "Legion Hoops:Steve McGehee: The Lone Soldier.x.com", "quote": "Steve McGehee: The Lone Soldier", "outlet": "x.com", "source_url": "https://x.com/LegionHoops/status/2001147841537040737", "tags": ["New York Knicks", "Awards", "OG Anunoby", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "James L. Edwards: Jalen Brunson starts his speech with shouting out OG, Kolek, Robinson and Clarkson.\"Without them, we don't win this.\"Bluesky", "quote": "\"Without them, we don't win this.\"", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jledwardsiii.bsky.social/post/3ma5shcgbc22t", "tags": ["New York Knicks", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Tim Bontemps: Dylan Harper on the ceiling for this San Antonio Spurs team now that they’re finally whole and healthy:“The sky is the limit.”x.com", "quote": "“The sky is the limit.”", "outlet": "x.com", "source_url": "https://x.com/TimBontemps/status/2001147522463752426", "tags": ["San Antonio Spurs", "NBA Cup", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-16", "text": "Tom Haberstroh: 32 Second-Chance Points for the Knicks. Most by a Knicks team in regulation in ... 2025-26 2024-25 2023-24 2022-23 2021-22 2020-21Hadn't been done since 2020.x.com", "quote": "Hadn't been done since 2020", "outlet": "x.com", "source_url": "https://x.com/tomhaberstroh/status/2001147289750950370", "tags": ["New York Knicks", "Statistics"]}, {"date": "", "archive_date": "2025-12-16", "text": "Ian Begley:Knicks come back from 11 down late in 3rd quarter to take NBA Cup championship with win over Spurs.Mitchell Robinson (10 offensive rebounds) was huge in 2nd half; Jordan Clarkson (15 pts) & Tyler Kolek (14 points, 5 assists, 5 rebounds, one TO) gave Knicks life off bench.x.com", "quote": "Knicks come back from 11 down late in 3rd quarter to take NBA Cup championship with win over Spurs.", "outlet": "x.com", "source_url": "https://x.com/IanBegley/status/2001144091111805204", "tags": ["New York Knicks", "San Antonio Spurs", "Jordan Clarkson", "Mitchell Robinson", "NBA Cup", "Tyler Kolek"]}, {"date": "", "archive_date": "2025-12-16", "text": "Marc J. Spears: Knicks guardJalen Brunson is MVP of the NBA Cup.x.com", "quote": "Jalen Brunson is MVP of the NBA Cup", "outlet": "x.com", "source_url": "https://x.com/MarcJSpears/status/2001144050418868381", "tags": ["New York Knicks", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Keerthika Uthayakumar: Including the NBA Cup Championship,the Knicks are 13-4 with OG Anunoby in the lineup.x.com", "quote": "the Knicks are 13-4 with OG Anunoby in the lineup", "outlet": "x.com", "source_url": "https://x.com/keerthikau/status/2001144785776615476", "tags": ["New York Knicks", "OG Anunoby", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jake Fischer:Another weird thing I learned this week... two-way players can't receive the full amount of NBA Cup prize money as standard roster players. Justice for the two-way guys!x.com", "quote": "Another weird thing I learned this week... two-way players can't receive the full amount of NBA Cup prize money as standard roster players. Justice for the two-way guys!", "outlet": "x.com", "source_url": "https://x.com/JakeLFischer/status/2001145337348534373", "tags": ["Trade"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jorge Sierra:How much do Knicks players increase their yearly earnings by winning the NBA Cup?x.com", "quote": "How much do Knicks players increase their yearly earnings by winning the NBA Cup?", "outlet": "x.com", "source_url": "https://x.com/hoopshype/status/2001142047344902262", "tags": ["New York Knicks", "Salaries", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "The NBA and Las Vegas have been linked for many years. A summer league has been held in the city annually since 2004, and Team USA basketball also trains in Las Vegas —though sources close to the program said it could look for a new location to train for 2027 FIBA World Cup and and 2028 Olympics in Los Angeles.While a city might want to propose hosting the NBA Cup final, the league could stick with Las Vegas and allow the event to grow as it did with Las Vegas Summer League, which has become a signature event for the league that many veterans make a point to attend.New York Times", "quote": "though sources close to the program said it could look for a new location to train for 2027 FIBA World Cup and and 2028 Olympics in Los Angeles.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6895286/2025/12/16/nba-cup-future-adam-silver-college-arena/", "tags": ["Las Vegas", "Team USA"]}, {"date": "", "archive_date": "2025-12-16", "text": "Appearing on Prime’s pregame coverage of the NBA Cup Final between the New York Knicks and San Antonio Spurs, Silver expressed why he thought the Prime Video studio of Taylor Rooks, Dirk Nowitzki, Steve Nash, Blake Griffin, and Udonis Haslem was “fantastic” compared to others broadcasting the league. “By the way, in all honesty, I love the chemistry of you guys. I mean, obviously, it’s why you did so well in a team sport.The chemistry’s fantastic,” Silver began. “And I also will just say quickly, as a fan, I think you do a great job educating other fans about the game because that, I would say, has frustrated me in the past about some coverage when it’s sort of reduced to ‘one side wanted it more’ or ‘this side played harder.’When you guys are explaining, like, why can’t a guy get a shot off, why is a particular defense working, I think the studio you guys built is off the charts. And I think the technology that you’re using- when you guys go out on the floor to demonstrate things, I can say as a fan I love that part of the coverage.”Awful Announcing", "quote": "The chemistry’s fantastic,” Silver began. “And I also will just say quickly, as a fan, I think you do a great job educating other fans about the game because that, I would say, has frustrated me in the past about some coverage when it’s sort of reduced to ‘one side wanted it more’ or ‘this side played harder.’", "outlet": "Awful Announcing", "source_url": "https://awfulannouncing.com/nba/adam-silver-praises-prime-crew-frustrated-coverage-elsewhere.html", "tags": ["New York Knicks", "San Antonio Spurs", "Blake Griffin", "Steve Nash", "Dirk Nowitzki", "Udonis Haslem", "Adam Silver", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Oh No He Didn't:Adam Silver says \"some storied college locations\" are under consideration for future NBA cup championship gamesx.com", "quote": "Adam Silver says \"some storied college locations\" are under consideration for future NBA cup championship games", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001097598237605922", "tags": ["Adam Silver", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "New York Basketball: Dirk on OG: \"He wanted to know more about shooting so last year he reached out tome…He wanted to know every little detail about feet, positioning of hands, breathing, where eyes go––he asked me all sorts of questions.One main thing I told him about: finger position on ball\"x.com", "quote": "me…He wanted to know every little detail about feet, positioning of hands, breathing, where eyes go––he asked me all sorts of questions.", "outlet": "x.com", "source_url": "https://x.com/NBA_NewYork/status/2001103944207003911", "tags": ["New York Knicks", "Dirk Nowitzki", "OG Anunoby"]}, {"date": "", "archive_date": "2025-12-16", "text": "Silver touched on a variety of potential issues -- including players specializing in a single sport at a far earlier age than in the past, the faster pace of play today than in the past and the year-round training of athletes -- as all potentially playing a part, before saying the league is committed to studying the issue in every way possible. \"So the answer is it's frustrating,\" Silver said.\"It's frustrating for our teams. It's frustrating for our fans. But I do think we have to be true to what the evidence is as opposed to saying there's a narrative out there that injuries are up or injuries are up because of scheduling. They're not.\"ESPN", "quote": "\"It's frustrating for our teams. It's frustrating for our fans. But I do think we have to be true to what the evidence is as opposed to saying there's a narrative out there that injuries are up or injuries are up because of scheduling. They're not.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47330098/adam-silver-decision-nba-expansion-made-2026", "tags": ["Injuries", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Attendance at the semifinals and final at T-Mobile Arena was rough, with empty seats littered around the arena.A plethora of fans got free tickets as “seat fillers” through a popular ticketing website called 1iota.com for the semis and final, The Post has learned.And those seats weren’t way up in the nosebleeds — they were courtside.New York Post", "quote": "A plethora of fans got free tickets as “seat fillers” through a popular ticketing website called 1iota.com for the semis and final, The Post has learned.", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/16/sports/nba-gave-away-courtside-seats-to-beef-up-cup-final-crowd/", "tags": ["Business", "Las Vegas", "Fans", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Barry Jackson: Kudos to @ByTimReynolds for asking if NBA has considered giving Heat relief of some kind (with cap or draft). \"This is an unprecedented situation. I'm incredibly sympathetic to the Heat and their fans.We are going to try to work something out with them. There's no obvious solution. As to the draft pick they conveyed, he hasn't been convicted of anything. It's an unfortunate circumstance..We will be looking at this with the Heat.. and see if there's any satisfactory relief. At the moment, there is none.\"x.com", "quote": "We are going to try to work something out with them. There's no obvious solution. As to the draft pick they conveyed, he hasn't been convicted of anything. It's an unfortunate circumstance..", "outlet": "x.com", "source_url": "https://x.com/flasportsbuzz/status/2001094867317825798", "tags": ["Miami Heat", "Draft", "Adam Silver", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-16", "text": "Keith Smith: On NBA expansion, Adam Silver said the league continues to study domestic expansion.Silver said the NBA will make a decision in 2026 on whether to move forward with the domestic expansion process. Silver said he's very cognizant of not \"teasing\" cities with drawn out talks.x.com", "quote": "Silver said the NBA will make a decision in 2026 on whether to move forward with the domestic expansion process", "outlet": "x.com", "source_url": "https://x.com/KeithSmithNBA/status/2001093129756188773", "tags": ["Adam Silver", "NBA Expansion"]}, {"date": "", "archive_date": "2025-12-16", "text": "Marc J. Spears: Adam Silver said he has talked to Chris Paul and was in bed when he got the alert that CP was sent home from the Clippers.“I’d love to see him finish off the season on another team,” Silver said. Silver said “it’s not for him to say” whether LAC should’ve handled it better.x.com", "quote": "“I’d love to see him finish off the season on another team,” Silver said. Silver said “it’s not for him to say” whether LAC should’ve handled it better", "outlet": "x.com", "source_url": "https://x.com/MarcJSpears/status/2001090435788497217", "tags": ["Los Angeles Clippers", "Chris Paul", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Oh No He Didn't:\"I've talked to Chris, I've talked to Steve Ballmer but frankly not about this.I probably was in bed when I saw an alert on my phone. I would say I was dismayed just for everyone involved...I would love to see him finish off the season on another team\"x.com", "quote": "\"I've talked to Chris, I've talked to Steve Ballmer but frankly not about this.", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001091476416086232", "tags": ["Los Angeles Clippers", "Chris Paul", "Steve Ballmer", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Marc Stein: Adam Silver acknowledges concern with the soft tissue injuries that have sidelined numerous star players this season and says the league office is \"very focused on it\" but pushes back on the notion early season game overload is causing the injuries.\"They're not,\" Silver said.x.com", "quote": "\"They're not,\" Silver said", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2001091094067425585", "tags": ["NBA", "Injuries", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Mike Vorkunov: Adam Silver is \"optimistic\" about a new WNBA CBA deal.\"We acknowledge that our players deserve to be paid significantly more than they have so far based on the increased success of the league.It’s just a question of finding a meeting of the minds on what is a fair deal.\"x.com", "quote": "\"We acknowledge that our players deserve to be paid significantly more than they have so far based on the increased success of the league.", "outlet": "x.com", "source_url": "https://x.com/MikeVorkunov/status/2001095595834921079", "tags": ["CBA", "WNBA", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "“Everything I do on the court, I couldn't do,” Allen said to reporters. “Even on the bench, trying to clap for teammates, I literally had to clap with my wrist to try to make it work.So I was struggling there for a while.” Allen explained that his first injury occurred in the second game of the season, spraining his right finger in Brooklyn on October 24, and “it's been bothering me since.” The left ring finger fracture happened five days after that, on the road in Boston. “I've basically been playing with two hurt fingers on two different hands for the past month before I sat out,” Allen said. “At this point, it's just been recovery, trying to make sure that I can get back in shape, make sure that I don't re-injure it and set myself back even further. So, it's just been a lot of conditioning, a lot of waiting, just a lot of trying to get ready to play again.”Clutch Points", "quote": "“Everything I do on the court, I couldn't do,” Allen said to reporters. “Even on the bench, trying to clap for teammates, I literally had to clap with my wrist to try to make it work.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/cavs-jarrett-allen-breaks-silence-finger-injuries-clap-wrist", "tags": ["Cleveland Cavaliers", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "These finger problems have affected Allen's ability to catch the ball and shoot with either hand. “Honestly, they both hurt equally,” Allen said.“I mean, they were both bad. This one [on my left], breaking a bone, but spraining a ligament. Like, I can't even straighten this [right] finger out anymore.That's how bad it was.”Clutch Points", "quote": "“I mean, they were both bad. This one [on my left], breaking a bone, but spraining a ligament. Like, I can't even straighten this [right] finger out anymore.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/cavs-jarrett-allen-breaks-silence-finger-injuries-clap-wrist", "tags": ["Cleveland Cavaliers", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "Allen was the only one of the three to attribute the struggles to a lack of confidence. “I feel like we know we're a good team,” Allen said.“We know that we have all this ability to do it, but sometimes we all get down on ourselves. Sometimes you question yourself. I think if we get back to how we were last year, where we're not questioning if we could do it or questioning how far we're going to take it, I think that's going to be good for us.”Clutch Points", "quote": "“We know that we have all this ability to do it, but sometimes we all get down on ourselves. Sometimes you question yourself. I think if we get back to how we were last year, where we're not questioning if we could do it or questioning how far we're going to take it, I think that's going to be good for us.”", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/darius-garland-jarrett-allen-pinpoint-reason-cavs-inconsistencies", "tags": ["Cleveland Cavaliers", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "It's pretty frustrating. I don't know if it's, like, the most frustrating I've been through,” Wade said after Tuesday's practice. “We did have a year where we won 17 games; that was pretty frustrating.With this much talent, and we're playing hard, doing the right things, it's frustrating to not see shots fall when they normally would. And I think that's the most frustrating part is we're doing everything right.We're taking the right process and doing it. It's just things aren't falling our direction right now and that is frustrating. “But I wouldn't say it's the most frustrating thing I've been a part of because we still have that belief. We know we have the talent to come out of this on the right side. So, it's frustrating, but we obviously know we're a better team than what we're showing. We've just got to get some things squared away, go through a few things, fine tune some things, and I think we'll be back – we won't even remember this frustrating part.”Clutch Points", "quote": "With this much talent, and we're playing hard, doing the right things, it's frustrating to not see shots fall when they normally would. And I think that's the most frustrating part is we're doing everything right.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/darius-garland-jarrett-allen-pinpoint-reason-cavs-inconsistencies", "tags": ["Cleveland Cavaliers", "Dean Wade"]}, {"date": "", "archive_date": "2025-12-16", "text": "Dan Weiss: Mike Brown asked if he got any intel from Victor’s French national teammate Guerschon Yabusele “I think his intel is the same as anyone playing Wemby the night before.You go to church, get down on your knees and say a prayer to the good lord.”x.com", "quote": "You go to church, get down on your knees and say a prayer to the good lord.”", "outlet": "x.com", "source_url": "https://x.com/DanWeissPBP/status/2001080388396179695", "tags": ["New York Knicks", "San Antonio Spurs", "Mike Brown", "Guerschon Yabusele", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-16", "text": "Dan Weiss:Mitch Johnson says the plan for Victor will look a lot like the last game with maybe a couple more minutes.x.com", "quote": "Mitch Johnson says the plan for Victor will look a lot like the last game with maybe a couple more minutes", "outlet": "x.com", "source_url": "https://x.com/DanWeissPBP/status/2001080832446930959", "tags": ["San Antonio Spurs", "Mitch Johnson", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-16", "text": "Law Murray: Ja Morant sprained his left ankle last night at Intuit Dome.He is questionable for tomorrow at MinnesotaBrandon Clarke (knee) is questionable to make his season debut. Cam Spencer (personal) is outx.com", "quote": "He is questionable for tomorrow at Minnesota", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/2001065716695388350", "tags": ["Memphis Grizzlies", "Minnesota Timberwolves", "Injuries", "Ja Morant", "Brandon Clarke", "Cam Spencer"]}, {"date": "", "archive_date": "2025-12-16", "text": "Lester Jones, a former top Atlanta Hawks finance executive, pleaded guilty Tuesday to a federal wire fraud charge after prosecutors alleged that he embezzled $3.8 million from the team. Jones had been a senior vice president of financial planning and analysis until last season but was indicted in October by the U.S. Attorney’s Office for the Northern District of Georgia for using his position to enrich himself on the franchise’s account.New York Times", "quote": "Lester Jones, a former top Atlanta Hawks finance executive, pleaded guilty Tuesday to a federal wire fraud charge after prosecutors alleged that he embezzled $3.8 million from the team", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6894932/2025/12/16/hawks-executive-guilty-lester-jones-nba/", "tags": ["Atlanta Hawks", "Law"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotto: \"To my understanding, Utah wants to build around Lauri Markkanen. What they want to do, ideally, they have a ton of cap space this summer. Use it to make the roster better. If they're going to be in the lottery this year, they hope that's the last time for the foreseeable future where they can start to build this thing. Re-sign Walker Kessler, but wait until you use the cap space.Lauri draws a ton of interest around the league, but right now, Utah wants to hold onto him.\"x.com", "quote": "Lauri draws a ton of interest around the league, but right now, Utah wants to hold onto him.\"", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000982943486108013", "tags": ["Utah Jazz", "Trade", "Lauri Markkanen", "Walker Kessler"]}, {"date": "", "archive_date": "2025-12-16", "text": "A season that had become a waiting game will continue to be that way for Miami Heat forward Nikola Jovic, now sidelined by an elbow injury suffered in Monday night’s loss to the Toronto Raptors. An MRI Tuesday showed only a contusion and laceration, with Jovic listed going forward as day to day.South Florida Sun-Sentinel", "quote": "A season that had become a waiting game will continue to be that way for Miami Heat forward Nikola Jovic, now sidelined by an elbow injury suffered in Monday night’s loss to the Toronto Raptors", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/16/heat-breathe-sigh-of-relief-after-nikola-jovics-injury-scare-herro-gets-mri/", "tags": ["Miami Heat", "Injuries", "Nikola Jovic"]}, {"date": "", "archive_date": "2025-12-16", "text": "The Heat also revealed a follow-up MRI on Tyler Herro’s right big toe, again showing only a contusion.Herro also is listed as day to day.South Florida Sun-Sentinel", "quote": "The Heat also revealed a follow-up MRI on Tyler Herro’s right big toe, again showing only a contusion.", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/16/heat-breathe-sigh-of-relief-after-nikola-jovics-injury-scare-herro-gets-mri/", "tags": ["Miami Heat", "Injuries", "Tyler Herro"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jon Krawczynski:Edwards questionable for tomorrow.Mike Conley remains outx.com", "quote": "Edwards questionable for tomorrow.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/2001044929322049565", "tags": ["Minnesota Timberwolves", "Injuries", "Mike Conley", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jon Krawczynski:Rudy Gobert announces the birth of his baby girl.x.com", "quote": "Rudy Gobert announces the birth of his baby girl", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/2001063693207921032", "tags": ["Minnesota Timberwolves", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-16", "text": "Nick DePaula:Tyrese Haliburton gifted the current Oshkosh North High School squads with exclusive pairs of his Puma Hali 1 signature shoe. \"Once it became a reality that I was getting my own shoe, there was no question we had to do a pair dedicated to my roots,\" says @Halix.com", "quote": "Tyrese Haliburton gifted the current Oshkosh North High School squads with exclusive pairs of his Puma Hali 1 signature shoe", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/2001063487813066763", "tags": ["Indiana Pacers", "Sneakers", "High School", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotto: \"For Milwaukee, in talking with their front office people, they still want to build around Giannis... They're still active on the trade market now trying to find another piece to help build this Bucks team withGiannis...Talking to rival executives that have interest in trading for Giannis, they've told me they don't think Milwaukee wants to move him right now.\"x.com", "quote": "Giannis...Talking to rival executives that have interest in trading for Giannis, they've told me they don't think Milwaukee wants to move him right now.\"", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000627903059669104", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotto: \"Hawks officials are hoping he (Trae Young) can come back at some point later this month... The Hawks have had a better defensive rating without Trae.Something to consider for the summer when he has a player option, and now NBA executives are thinking that he may have to pick that up.\"x.com", "quote": "Something to consider for the summer when he has a player option, and now NBA executives are thinking that he may have to pick that up.\"", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000964420483322296", "tags": ["Atlanta Hawks", "Trae Young"]}, {"date": "", "archive_date": "2025-12-16", "text": "Eric Nehm: Per league sources,the Bucks have applied for a Disabled Player Exception (DPE) for Taurean Prince. The Bucks ruled Prince out indefinitely after he underwent surgery to address the herniated disc in his neck on Nov. 13.x.com", "quote": "the Bucks have applied for a Disabled Player Exception (DPE) for Taurean Prince", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/2001034429595312337", "tags": ["Milwaukee Bucks", "Taurean Prince"]}, {"date": "", "archive_date": "2025-12-16", "text": "Keith Smith:$2.7M for this DPE.Could be used to give a player more than the prorated minimum down the line. Bulls have until March 10 to use it.x.com", "quote": "$2.7M for this DPE.", "outlet": "x.com", "source_url": "https://x.com/KeithSmithNBA/status/2001033568479248801", "tags": ["Chicago Bulls", "Noa Essengue"]}, {"date": "", "archive_date": "2025-12-16", "text": "Duane Rankin: \"Chaotic. Crazy. Everything in between.\" \"We were right there.\" Mark Williams and Royce O'Neale on Suns 116-114 loss to Lakers. Jordan Ott on Last Two-Minute report:\"Game's over. I've been through it multiple times. They do their evaluation afterwards, we do ours. Doesn't change anything. We'll move on. We've got to get better.\"x.com", "quote": "\"Game's over. I've been through it multiple times. They do their evaluation afterwards, we do ours. Doesn't change anything. We'll move on. We've got to get better.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2001033926853451887", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Royce O'Neale", "Jordan Ott", "Mark Williams"]}, {"date": "", "archive_date": "2025-12-16", "text": "Duane Rankin: Suns coach Jordan Ott on Devin Booker's response to return game after missing previous three with a right groin strain: \"Good. That was a big takeaway, big step in it. Everything seemed to be pretty good.\" On Isaiah Livers (right hip strain) progress:\"It's kind of been up and down. His injury is so unique to not only him, but everyone around the league. What he's coming back from. Being out that long. So when he feels pain or when he feels it's not right, we have to figure out exactly what it is.\"Livers missed all last season after having hip surgery.x.com", "quote": "\"It's kind of been up and down. His injury is so unique to not only him, but everyone around the league. What he's coming back from. Being out that long. So when he feels pain or when he feels it's not right, we have to figure out exactly what it is.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2001031515606786138", "tags": ["Phoenix Suns", "Injuries", "Devin Booker", "Jordan Ott", "Isaiah Livers"]}, {"date": "", "archive_date": "2025-12-16", "text": "Anthony Slater:Al Horford is back on the court. Steve Kerr said his injury issue has healed.Called him doubtful for Thursday in Phoenix, but nearing a return.Twitter @anthonyVslater", "quote": "Al Horford is back on the court. Steve Kerr said his injury issue has healed.", "outlet": "Twitter @anthonyVslater", "source_url": "https://hoopshype.com/social/", "tags": ["Golden State Warriors", "Al Horford", "Injuries"]}, {"date": "", "archive_date": "2025-12-16", "text": "Anthony Slater: In a search for better continuity,Steve Kerr said he will keep the five-man group of Steph Curry, Moses Moody, Jimmy Butler, Draymond Green and Quinten Post as the established starting lineup for the foreseeable future(barring injury).Twitter @anthonyVslater", "quote": "Steve Kerr said he will keep the five-man group of Steph Curry, Moses Moody, Jimmy Butler, Draymond Green and Quinten Post as the established starting lineup for the foreseeable future", "outlet": "Twitter @anthonyVslater", "source_url": "https://hoopshype.com/social/", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Stephen Curry", "Jimmy Butler", "Draymond Green", "Moses Moody", "Quinten Post"]}]