[{"date": "", "archive_date": "2025-12-23", "text": "Golden State Warriors coachSteve Kerr and forward Draymond Green had a heated exchange during an early third-quarter timeout Monday night, causing Green to leave the bench and miss the final 20 minutes of a 120-97 win over the Orlando Magic. The Warriors were trailing 71-66 at the time of the back-and-forth. Green had just committed a turnover and had been engaging with an official when Kerr called timeout and tried to herd his team to the huddle, saying he felt they were unfocused. That's when the argument occurred. \"We had it out a little bit,\" Kerr said. \"He made his decision to go back to the locker room to cool off. That's all I'm going to say about it. Everything is private.\"ESPN", "quote": "Steve Kerr and forward Draymond Green had a heated exchange during an early third-quarter timeout Monday night, causing Green to leave the bench and miss the final 20 minutes of a 120-97 win over the Orlando Magic", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47396653/warriors-draymond-green-steve-kerr-heated-exchange-green-leaves-court", "tags": ["Golden State Warriors", "Steve Kerr", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-23", "text": "\"Tempers spilled over, and I thought it was best that I get out of there,\" Green said.\"I don't think it was a situation where it was going to get better. It was best to remove myself.\"ESPN", "quote": "\"Tempers spilled over, and I thought it was best that I get out of there,\" Green said.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47396653/warriors-draymond-green-steve-kerr-heated-exchange-green-leaves-court", "tags": ["Golden State Warriors", "Steve Kerr", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-23", "text": "Green returned to the bench prior to the fourth quarter, but he didn't remove his warmups and never checked back into the game. Kerr said he wouldn't have gone back to Green. \"No,\" Kerr said.\"He wasn't going back in. No. He left. He went back to the locker room. We moved forward, and the guys played great.\"It was the second straight game that Green had departed prematurely. He was ejected after playing only eight minutes in Saturday's home win over the Phoenix Suns and was only on the floor for 18 minutes before choosing to depart Monday night. \"We need Draymond,\" Kerr said. \"He's a champion. We've been together for a long time. \"It's unfortunate what happened, but it happened.\"ESPN", "quote": "\"He wasn't going back in. No. He left. He went back to the locker room. We moved forward, and the guys played great.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47396653/warriors-draymond-green-steve-kerr-heated-exchange-green-leaves-court", "tags": ["Golden State Warriors", "Steve Kerr", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-23", "text": "\"I'm not frustrated at all,\" Green said. \"I had one turnover today. I had the ball the whole time I was in the game. I know how to fix problems when they're a problem. I had one turnover in my minutes. I essentially ran our offense.\" An hour after the game, Green said he still hadn't spoken with Kerr about the incident but made a point to get in front of reporters in an effort to diffuse the situation. Kerr also said there wouldn't be lingering effects. The two have engaged in several arguments on the court and in the locker room during their 12 seasons together.\"We've been at this now for a long time,\" Green said. \"Sometimes you're with people for a long time and there's a level of comfort and s--- happens. We move forward.\"ESPN", "quote": "\"We've been at this now for a long time,\" Green said. \"Sometimes you're with people for a long time and there's a level of comfort and s--- happens. We move forward.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47396653/warriors-draymond-green-steve-kerr-heated-exchange-green-leaves-court", "tags": ["Golden State Warriors", "Steve Kerr", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-23", "text": "Draymond Green:\"Steve Kerr took over, and Steve Kerr brought in a way of winning that none of us had ever experienced. He had won at a level that none of us had ever won at, and he brought that to the fold. He brought a new offense to the fold, um, that really unlocked and unleashed Steph Curry and Klay Thompson and myself.Um, I started—David Lee got hurt. I started, you know, that changed some things. Uh, Shaun Livingston signing to the—to the Warriors. Uh, Andre Iguodala the year before signing to the Warriors. You know, I think there were several things that happened. You know, getting Leandro Barbosa, Speights—like, we shored up our bench. We had incredible depth, you know, and so... I think, uh, just like the other teams that was trying to get over the hump and didn’t the first time, I think it was a little bit of the same for us.\"YouTube", "quote": "\"Steve Kerr took over, and Steve Kerr brought in a way of winning that none of us had ever experienced. He had won at a level that none of us had ever won at, and he brought that to the fold. He brought a new offense to the fold, um, that really unlocked and unleashed Steph Curry and Klay Thompson and myself.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=1VWHBtlzuG8", "tags": ["Dallas Mavericks", "Golden State Warriors", "Andre Iguodala", "Steve Kerr", "David Lee", "Leandro Barbosa", "Shaun Livingston", "Klay Thompson", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-23", "text": "Oh No He Didn't: Steph on Draymond and Steve Kerr's exchange:\"They were just having a good conversation. It's kind of for them to talk about not me. I'm pretty sure we know how to be professional though\"x.com", "quote": "\"They were just having a good conversation. It's kind of for them to talk about not me. I'm pretty sure we know how to be professional though\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2003356191918031065", "tags": ["Golden State Warriors", "Steve Kerr", "Stephen Curry", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-23", "text": "Oh No He Didn't: Podz: \"I didn't see or hear anything...it'll get figured out\" Is it a team rule that if you leave the bench then you're done?\"I have no idea\"x.com", "quote": "\"I have no idea\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2003346756948664619", "tags": ["Golden State Warriors", "Draymond Green", "Brandin Podziemski"]}, {"date": "", "archive_date": "2025-12-23", "text": "Prior to the season, much was made about the Rockets' point guard situation given the ACL injury sustained by Fred VanVleet. Thus far, Ime Udoka has shown increased trust in second year guard Reed Sheppard to handle the ball, which has eased those concerns for now. However, recently, former NBA All-Star Jeff Teague took to his Club 520 podcast to drop some advice for Houston on how to get better in that department.“They need to trade for James Harden… Tell James you want him to play like he was in Brooklyn. Be the point guard… Him and [Kevin Durant] being together… They got a real chance,” said Teague.Clutch Points", "quote": "“They need to trade for James Harden… Tell James you want him to play like he was in Brooklyn. Be the point guard… Him and [Kevin Durant] being together… They got a real chance,” said Teague", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/houston-rockets/nba-rumors-what-jeff-teague-wants-rockets-tell-james-harden-about-trade", "tags": ["Houston Rockets", "Los Angeles Clippers", "Trade", "James Harden", "Jeff Teague"]}, {"date": "", "archive_date": "2025-12-23", "text": "On Saturday’s Wine and Gold Talk podcast (YouTube link), Chris Fedor of Cleveland.com saidthe Cavs appear reluctant to part with Allen for many of the same reasons as Garland — he’s been limited by injuries, is having a down season, and they’d likely get pennies on the dollar if they thought about moving him before the deadline.As with Garland, the Cavs also seem to be higher on Allen than opposing teams, which is another factor that can’t be discounted, per Fedor.Hoops Rumors", "quote": "the Cavs appear reluctant to part with Allen for many of the same reasons as Garland — he’s been limited by injuries, is having a down season, and they’d likely get pennies on the dollar if they thought about moving him before the deadline.", "outlet": "Hoops Rumors", "source_url": "https://www.hoopsrumors.com/2025/12/cavaliers-rumors-allen-trade-candidates-atkinson-j-bryant.html", "tags": ["Cleveland Cavaliers", "Trade", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-23", "text": "On the same podcast,Fedor identified De’Andre Hunter, Max Strus, Lonzo Ball and Dean Wade as a handful of players on mid-sized salaries who could potentially be traded in the coming weeks if Cleveland’s front office decides against a more drastic overhaul.The issue, Fedor continued, is that Strus has yet to play a game as he continues to recover from offseason foot surgery, and Hunter, Ball and Wade are all struggling in 2025/26. Fedor pointed out that Ball ($10MM team option for ’26/27) and Wade ($6MM expiring contract) could be easier to move than Hunter and Strus, as the latter two make more money and have guaranteed deals next season.Hoops Rumors", "quote": "Fedor identified De’Andre Hunter, Max Strus, Lonzo Ball and Dean Wade as a handful of players on mid-sized salaries who could potentially be traded in the coming weeks if Cleveland’s front office decides against a more drastic overhaul.", "outlet": "Hoops Rumors", "source_url": "https://www.hoopsrumors.com/2025/12/cavaliers-rumors-allen-trade-candidates-atkinson-j-bryant.html", "tags": ["Cleveland Cavaliers", "Trade", "Lonzo Ball", "Max Strus", "Dean Wade"]}, {"date": "", "archive_date": "2025-12-23", "text": "NBA: \"A moment of history right here.\" Mindblowing consistency from a mindblowing scorer.100 straight 20-point games for Shaix.com", "quote": "100 straight 20-point games for Shai", "outlet": "x.com", "source_url": "https://x.com/NBA/status/2003322349316411406", "tags": ["Oklahoma City Thunder", "Statistics", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-23", "text": "Cleveland Cavaliers forward De'Andre Hunter looked as confident as he was at the beginning of the season on Monday night, scoring 27 points on 9-of-13 from the field and literally bloodying his nose in his best game in some time. It's only the third time this year that he's come off the bench, a decision that Hunter shared he and Cavs head coach Kenny Atkinson came to together last week.“It's huge that he has the respect to come to me to ask how I feel about it,” Hunter told ClutchPointsin a media scrum after Cleveland's skid-snapping 139-132 win over the Charlotte Hornets. “I think that's big, and it's kind of a mutual agreement. We both felt the same. Here we are.”Clutch Points", "quote": "“It's huge that he has the respect to come to me to ask how I feel about it,” Hunter told ClutchPoints", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/deandre-hunter-kenny-atkinson-mutual-cavs-sixth-man-agreement", "tags": ["Charlotte Hornets", "Cleveland Cavaliers", "Brooklyn Nets", "Kenny Atkinson", "De'Andre Hunter"]}, {"date": "", "archive_date": "2025-12-23", "text": "Hunter told ClutchPoints that he didn't feel any different coming into Monday's tilt with the Hornets. That may be true, but this was Hunter's highest scoring output since November 8 and his first 20-point night in over a month. That is a definite sight for sore eyes. “Just trusting my work,” Hunter said. “I've had a lot of ups and downs in my career, so a shooting slump isn't gonna stop me from shooting.”“Him just playing with no thought, man, just going out there just being a hooper as he is, it's really good to see,” Garland added. “I mean, he's a big spark for us whenever he's going like that on both sides of the ball. So it's really good to see him with some confidence and playing really well.”Clutch Points", "quote": "“Him just playing with no thought, man, just going out there just being a hooper as he is, it's really good to see,” Garland added. “I mean, he's a big spark for us whenever he's going like that on both sides of the ball. So it's really good to see him with some confidence and playing really well.”", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/deandre-hunter-kenny-atkinson-mutual-cavs-sixth-man-agreement", "tags": ["Cleveland Cavaliers", "Darius Garland", "De'Andre Hunter"]}, {"date": "", "archive_date": "2025-12-23", "text": "Brendan Vogt:When does Tim Hardaway Jr. know it’s going to be a good night for him? “After the first one goes in.”x.com", "quote": "When does Tim Hardaway Jr. know it’s going to be a good night for him? “After the first one goes in.”", "outlet": "x.com", "source_url": "https://x.com/BrendanVogt/status/2003324788891435155", "tags": ["Denver Nuggets", "Tim Hardaway Jr"]}, {"date": "", "archive_date": "2025-12-23", "text": "Oh No He Didn't: Isiah on Lamelo: \"The decision he has to make: Does he wanna entertain and be a fun guy or does he wanna win? Right now he's an entertainer, fun guy.All the players around the league likes him. When they start hating him and disliking him, that's when he'll start winning\"x.com", "quote": "All the players around the league likes him. When they start hating him and disliking him, that's when he'll start winning\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2003335428057764335", "tags": ["Charlotte Hornets", "Isiah Thomas", "LaMelo Ball"]}, {"date": "", "archive_date": "2025-12-23", "text": "Corey Kispert: Yeah, the thumb’s doing well. Surprisingly quick recovery for — I mean, it's a broken bone, and so I didn’t really know what to expect. But things are going really, really well.I've gotten in 5-on-5s in practice, 3s, live shooting, all of that. So, I'm expecting a really quick recovery from today. Only a few more days, I think.YouTube", "quote": "Corey Kispert: Yeah, the thumb’s doing well. Surprisingly quick recovery for — I mean, it's a broken bone, and so I didn’t really know what to expect. But things are going really, really well.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=R2sL8DXjOC4", "tags": ["Washington Wizards", "Injuries", "Corey Kispert"]}, {"date": "", "archive_date": "2025-12-23", "text": "We're going to get to the excitement in just a moment, but I do want to ask you first about this gambling scandal that's rocked the NBA. Of course, the NBA isn't the only league that’s been dealing with this — other sports as well. But what is your message to fans who may worry about the game's integrity right now? Adam Silver:My message is: the integrity is absolutely solid. So, the scandal, as you called it, is an incident from two and a half years ago involving one player who allegedly tipped other accomplices that he was going to be coming out of a game early because he was injured. But to me, that’s an isolated incident. That said, we take it absolutely seriously. I understand from a fan standpoint that there's nothing more important than the integrity of the game.YouTube", "quote": "My message is: the integrity is absolutely solid", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=5royLzPpdZM", "tags": ["Gambling", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-23", "text": "Adam Silver on NBA Europe: Well, it’s something we've been discussing for a while — and that is having a separate league in Europe. Basketball is the number two sport in Europe after soccer — probably 300 million fans. Many of our top players are European. Roughly 15% of the league is European players. So, the quality of basketball is amazingly high-level there, but there hasn’t been commercial success, really, ever, for a league there.Each country has its own leagues — there’s nothing that’s pan-European. So we think there’s an opportunity to come in, do something pan-European, have franchises in great European capitals like Paris, London, Berlin, Madrid, etc. The opportunity is there. It’s something we’re looking at very closely with our owners right now. We’ve been out in the marketplace talking to some of the well-known soccer clubs — who also field basketball teams — some of the biggest sports brands in the world. There’s tremendous interest. So, it’s something that, sort of, in the next few months, we’re going to sort out. But I think there’s a very good chance we’re going to move forward with something there.YouTube", "quote": "Each country has its own leagues — there’s nothing that’s pan-European. So we think there’s an opportunity to come in, do something pan-European, have franchises in great European capitals like Paris, London, Berlin, Madrid, etc", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=5royLzPpdZM", "tags": ["Adam Silver", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-23", "text": "Switching gears — I’m a huge coffee fan. I see you're launching your own coffee brand. There it is, baby! Tell us about that. How does an NBA player get into the coffee business? Corey Kispert: It kind of all started randomly. Over the past few years, I’ve been thinking about how to fill my time — hobbies, interests off the court. Coffee is a huge one.I love to drink it. I probably drink four to six cups a day. So I thought: might as well put some energy into it. If I’m drinking it all day, I might as well make some money off it instead of giving it to others. It’s been on the back burner a while. Now, I feel like I’m at a place in my career where I’ve got two feet settled in the NBA. I know who I am, what kind of player I am and can be. I’m not just focused on sticking in the league. So, it felt like a great time to put energy elsewhere.YouTube", "quote": "I love to drink it. I probably drink four to six cups a day. So I thought: might as well put some energy into it. If I’m drinking it all day, I might as well make some money off it instead of giving it to others", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=R2sL8DXjOC4", "tags": ["Washington Wizards", "Business", "Corey Kispert"]}, {"date": "", "archive_date": "2025-12-23", "text": "Detlef Schrempf:Not that it matters much in life but just being nominated would be nice?‍♂️x.com", "quote": "Not that it matters much in life but just being nominated would be nice", "outlet": "x.com", "source_url": "https://x.com/Hoophall/status/2002121418163781750", "tags": ["Hall of Fame", "Detlef Schrempf"]}, {"date": "", "archive_date": "2025-12-23", "text": "NBA Communications:More than 87 million people in the U.S. have watched NBA games this season across NBC/Peacock, ESPN, Amazon Prime Video and NBA TV, the most viewers in 15 years and up 89% vs. last year. (Excludes 2011-12 season which began on Christmas Day.)x.com", "quote": "More than 87 million people in the U.S. have watched NBA games this season across NBC/Peacock, ESPN, Amazon Prime Video and NBA TV, the most viewers in 15 years and up 89% vs. last year", "outlet": "x.com", "source_url": "https://x.com/NBAPR/status/2003119337180442961", "tags": ["TV Ratings"]}, {"date": "", "archive_date": "2025-12-23", "text": "Jimmy Butler showing love to his teammate Pat Spencer!?Instagram", "quote": "Jimmy Butler showing love to his teammate Pat Spencer!", "outlet": "Instagram", "source_url": "https://www.instagram.com/reel/DSmCdhvjjDK/", "tags": ["Golden State Warriors", "Jimmy Butler", "Frivolities", "Pat Spencer"]}, {"date": "", "archive_date": "2025-12-22", "text": "Grant Afseth:Final: Pelicans 119, Mavericks 113Anthony Davis: 35 PTS, 17 REB, 1 BLK Klay Thompson: 20 PTS, 5 REB Cooper Flagg: 16 PTS, 6 REB, 6 AST Zion Williamson: 24 PTS, 9 REB Derik Queen: 19 PTS, 11 REB, 6 AST Saddiq Bey: 19 PTS, 7 REB Dallas (11-19) hosts the Nuggets on Tuesday.x.com", "quote": "Final: Pelicans 119, Mavericks 113", "outlet": "x.com", "source_url": "https://x.com/GrantAfseth/status/2003307606144954573", "tags": ["Dallas Mavericks", "Denver Nuggets", "New Orleans Pelicans", "Klay Thompson", "Anthony Davis", "Zion Williamson", "Saddiq Bey", "Cooper Flagg", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-22", "text": "Pelicans Film Room: \"The goal was to maximize his minutes. It's a math game...I knew he was gonna respond well but for him to approach it this way in the mature, team first mentality, he deserves credit for that\"-- James Borrego on Zion coming off the benchx.com", "quote": "I knew he was gonna respond well but for him to approach it this way in the mature, team first mentality, he deserves credit for that\"", "outlet": "x.com", "source_url": "https://x.com/PelsFilmRoom/status/2003311410047283613", "tags": ["New Orleans Pelicans", "James Borrego", "Zion Williamson"]}, {"date": "", "archive_date": "2025-12-22", "text": "NBA on ESPN:Kon Knueppel the fastest player to 100 threes made BY FARHornets got onex.com", "quote": "Kon Knueppel the fastest player to 100 threes made BY FAR", "outlet": "x.com", "source_url": "https://x.com/ESPNNBA/status/2003305653536727545", "tags": ["Charlotte Hornets", "Kon Knueppel"]}, {"date": "", "archive_date": "2025-12-22", "text": "Todd Whitehead:Lowest FG% allowed as the closest defender on opponent shots in the paint this season.x.com", "quote": "Lowest FG% allowed as the closest defender on opponent shots in the paint this season", "outlet": "x.com", "source_url": "https://x.com/CrumpledJumper/status/2003290505418080591", "tags": ["Atlanta Hawks", "Boston Celtics", "Charlotte Hornets", "Dallas Mavericks", "Detroit Pistons", "Golden State Warriors", "Indiana Pacers", "Los Angeles Clippers", "Minnesota Timberwolves", "Oklahoma City Thunder", "Orlando Magic", "Portland Trail Blazers", "San Antonio Spurs", "Anthony Davis", "Statistics", "Draymond Green", "Rudy Gobert", "Kristaps Porzingis", "Ivica Zubac", "Isaiah Hartenstein", "Derrick White", "Wendell Carter", "Neemias Queta", "Isaiah Stewart", "Victor Wembanyama", "Chet Holmgren", "Jay Huff", "Donovan Clingan", "Ryan Kalkbrenner", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-22", "text": "Danny Cunningham:#Cavs beat the Charlotte Hornets 139-132 in a game that wasn't as close as the final score.Cavs make a season-high 24 3-pointers and their offense looked better than it has all season. Donovan Mitchell had 30 points and both Darius Garland and De'Andre Hunter had 27.x.com", "quote": "#Cavs beat the Charlotte Hornets 139-132 in a game that wasn't as close as the final score.", "outlet": "x.com", "source_url": "https://x.com/RealDCunningham/status/2003295131953410150", "tags": ["Charlotte Hornets", "Cleveland Cavaliers", "Donovan Mitchell", "Darius Garland", "De'Andre Hunter"]}, {"date": "", "archive_date": "2025-12-22", "text": "Omari Sankofa II:Ron Holland is out tonight with left knee soreness,JB said. Will be his first missed game due to injury. Not sure if it’s longterm. “He took a fall last game and the adrenaline was able to carry him through. We’re going to get an image done in Sacramento and see what’s next.”x.com", "quote": "Ron Holland is out tonight with left knee soreness,", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/2003278340808159339", "tags": ["Detroit Pistons", "Injuries", "Ron Holland"]}, {"date": "", "archive_date": "2025-12-22", "text": "Brandon Rahbar:Aaron Wiggins is out tonight vs the Grizzlies.x.com", "quote": "Aaron Wiggins is out tonight vs the Grizzlies", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/2003277279791919204", "tags": ["Memphis Grizzlies", "Oklahoma City Thunder", "Injuries", "Aaron Wiggins"]}, {"date": "", "archive_date": "2025-12-22", "text": "Anthony Slater:Steve Kerr said Al Horford has a chance to return for the Christmas game vs the Mavericks.Kerr also said he can bump De’Anthony Melton’s minutes up a few, if needed, but preference remains to keep it around 20 nightly.x.com", "quote": "Steve Kerr said Al Horford has a chance to return for the Christmas game vs the Mavericks.", "outlet": "x.com", "source_url": "https://x.com/anthonyVslater/status/2003274863944061129", "tags": ["Dallas Mavericks", "Golden State Warriors", "Steve Kerr", "Al Horford", "Injuries"]}, {"date": "", "archive_date": "2025-12-22", "text": "Sean Highkin:Grant is out.Tiago Splitter says right now they aren’t that concerned about the sore Achilles but they’re being careful.x.com", "quote": "Grant is out.", "outlet": "x.com", "source_url": "https://x.com/highkin/status/2003273637437276391", "tags": ["Portland Trail Blazers", "Tiago Splitter", "Injuries", "Jerami Grant"]}, {"date": "", "archive_date": "2025-12-22", "text": "Nick DePaula:Stephen Curry pulled up in the Penny Foams tonightx.com", "quote": "Stephen Curry pulled up in the Penny Foams tonight", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/2003287289410318445", "tags": ["Golden State Warriors", "Sneakers", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-22", "text": "Nick DePaula:Stephen Curry broke out the TMac 3s for his warm up: @SooWavy11x.com", "quote": "Stephen Curry broke out the TMac 3s for his warm up", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/2003288156741992866", "tags": ["Golden State Warriors", "Sneakers", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-22", "text": "Additionally, the intel from some NBA teams is a perception that Garland would like to run his own team again at some point, as opposed to being in a more complementary role next to Mitchell. “Darius is the safest option on the trade market for a team seeking a point guard upgrade,” a source said. “There are teams who think he can handle more being put on his plate.”Dallas Hoops Journal", "quote": "Additionally, the intel from some NBA teams is a perception that Garland would like to run his own team again at some point, as opposed to being in a more complementary role next to Mitchell", "outlet": "Dallas Hoops Journal", "source_url": "https://dallashoopsjournal.com/p/nba-rumors-notebook-dallas-mavericks-giannis-antetokounmpo-cleveland-cavaliers-utah-jazz-daniel-gafford-anthony-davis/", "tags": ["Cleveland Cavaliers", "Trade", "Donovan Mitchell", "Darius Garland"]}, {"date": "", "archive_date": "2025-12-22", "text": "Around the league, the most viable potential suitors for Antetokounmpo are increasingly viewed as being in the Eastern Conference, sources tell DallasHoopsJournal.com.However, there is growing skepticism among rival teams that the New York Knicks would be willing to break up their roster midseason to pursue a trade.Dallas Hoops Journal", "quote": "However, there is growing skepticism among rival teams that the New York Knicks would be willing to break up their roster midseason to pursue a trade", "outlet": "Dallas Hoops Journal", "source_url": "https://dallashoopsjournal.com/p/nba-rumors-notebook-dallas-mavericks-giannis-antetokounmpo-cleveland-cavaliers-utah-jazz-daniel-gafford-anthony-davis/", "tags": ["Milwaukee Bucks", "New York Knicks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-22", "text": "Fullcourtpass: TheWarriors made an Instagram post telling fans to vote Jimmy Butler to the All-Star gameJimmy responsex.com", "quote": "Warriors made an Instagram post telling fans to vote Jimmy Butler to the All-Star game", "outlet": "x.com", "source_url": "https://x.com/Fullcourtpass/status/2003255548486254936", "tags": ["Golden State Warriors", "All-Star", "Jimmy Butler"]}, {"date": "", "archive_date": "2025-12-22", "text": "Dan Woike:Austin Reaves upgraded to questionable,Luka Dončić out against the Sunsx.com", "quote": "Austin Reaves upgraded to questionable,", "outlet": "x.com", "source_url": "https://x.com/DanWoikeSports/status/2003254761794208124", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Injuries", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-22", "text": "Kellan Olson:Suns guard Grayson Allen is listed as doubtful for the Suns tomorrow against the Lakers due to right knee injury management.x.com", "quote": "Suns guard Grayson Allen is listed as doubtful for the Suns tomorrow against the Lakers due to right knee injury management", "outlet": "x.com", "source_url": "https://x.com/KellanOlson/status/2003259383082549572", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Injuries", "Grayson Allen"]}, {"date": "", "archive_date": "2025-12-22", "text": "Justin Russo:LA Clippers injury report for tomorrow vs Rockets:OUT Bradley Beal - Left Hip Fracture Derrick Jones Jr. - Right Knee Sprain Chris Paul - Not With Team Ivica Zubac - Left Ankle Sprainx.com", "quote": "LA Clippers injury report for tomorrow vs Rockets:", "outlet": "x.com", "source_url": "https://x.com/FlyByKnite/status/2003268292316922292", "tags": ["Houston Rockets", "Los Angeles Clippers", "Chris Paul", "Injuries", "Bradley Beal", "Derrick Jones", "Ivica Zubac"]}, {"date": "", "archive_date": "2025-12-22", "text": "Celtics on CLNS:Rick Carlisle advocated for former #Celtics trainer Ed Lacerte, who's battling leukemia and searching for a stem cell donation,pre-game before Celtics-Pacers tonight. - @CLNSMediax.com", "quote": "Rick Carlisle advocated for former #Celtics trainer Ed Lacerte, who's battling leukemia and searching for a stem cell donation,", "outlet": "x.com", "source_url": "https://x.com/CelticsCLNS/status/2003257223137628483", "tags": ["Boston Celtics", "Indiana Pacers", "Rick Carlisle"]}, {"date": "", "archive_date": "2025-12-22", "text": "Following Lakers practice on Monday, JJ Redick spoke about why he feels Austin Reaves is worthy of being named a first time All-Star this season, and what the honor would mean to Reaves. “I would imagine it would mean a lot, a whole lot to him. He and I have had discussions just about how surreal it is for him to be playing at this level and in this position.I obviously absolutely think he should be an All-Star this year,” Redick said.“You always got to be careful as an athlete, to stop and smell the roses. It’s the nature of competition. When there’s 82 games, there’s not really a time to take your foot off the gas. That’s the offseason.” “I think he’s the type of player who consistently wants to get better, consistently wants more,” Redick continued. He’s willing to put in the work, and he’s willing to then go out and play hard enough to actually go for more. He’s proven that over and over and over again.”Clutch Points", "quote": "I obviously absolutely think he should be an All-Star this year,” Redick said.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/los-angeles-lakers/lakers-news-jj-redick-austin-reaves-all-star-endorsement", "tags": ["Los Angeles Lakers", "JJ Redick", "All-Star", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-22", "text": "Duane Rankin: OFFICIAL:Jalen Green (right hamstring strain) will be re-evaluated in two to three weeks.#Sunsx.com", "quote": "Jalen Green (right hamstring strain) will be re-evaluated in two to three weeks.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2003248514852356431", "tags": ["Phoenix Suns", "Injuries", "Jalen Green"]}, {"date": "", "archive_date": "2025-12-22", "text": "MrBuckBuck: NBA Commissioner Adam Silver message to fans worried about the game's integrity: “My message is the integrity is absolutely solid…I understand from a fan's standpoint that there is nothing more important than the integrity of the game.”x.com", "quote": "I understand from a fan's standpoint that there is nothing more important than the integrity of the game.”", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2003251423837065384", "tags": ["Gambling", "Adam Silver", "Betting"]}, {"date": "", "archive_date": "2025-12-22", "text": "Marc Stein:At his pregame availability tonight, Pacers coach Rick Carlisle re-iterated that he will no longer be president of the NBA Coaches Association when the calendar flips to 2026 and says he will be succeeded by Detroit's J.B. Bickerstaff after a two-decade tenure.x.com", "quote": "At his pregame availability tonight, Pacers coach Rick Carlisle re-iterated that he will no longer be president of the NBA Coaches Association when the calendar flips to 2026 and says he will be succeeded by Detroit's J.B. Bickerstaff after a two-decade tenure", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2003249834111774949", "tags": ["Detroit Pistons", "Indiana Pacers", "Coaching", "Rick Carlisle", "JB Bickerstaff"]}, {"date": "", "archive_date": "2025-12-22", "text": "Mike Curtis: Jason Kidd on Cooper Flagg's durability:\"He's a tough kid. Whether he's sore or playing a lot of minutes, he's one that we've leaned on when he's on the floor. To be able to play at the level he's playing, it's just shows being 19 & you can play the game at a high level. He was asked was it weird saying he's 19: \"I've been practicing that all day.\"x.com", "quote": "\"He's a tough kid. Whether he's sore or playing a lot of minutes, he's one that we've leaned on when he's on the floor. To be able to play at the level he's playing, it's just shows being 19 & you can play the game at a high level", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/2003250986337345931", "tags": ["Dallas Mavericks", "Jason Kidd", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-22", "text": "Mike Curtis:Jason Kidd said Cooper Flagg and Klay Thompson are available for tonight’s game against the #Pelicans. Max Christie is out.x.com", "quote": "Jason Kidd said Cooper Flagg and Klay Thompson are available for tonight’s game against the #Pelicans", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/2003247403659559199", "tags": ["Dallas Mavericks", "New Orleans Pelicans", "Jason Kidd", "Injuries", "Klay Thompson", "Max Christie", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-22", "text": "Austin Krell:Joel Embiid (Right knee injury management) is PROBABLE for tomorrow's game vs BKN.x.com", "quote": "Joel Embiid (Right knee injury management) is PROBABLE for tomorrow's game vs BKN", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/2003224168033378568", "tags": ["Philadelphia 76ers", "Injuries", "Joel Embiid"]}, {"date": "", "archive_date": "2025-12-22", "text": "Austin Krell:Dominick Barlow and Quentin Grimes are QUESTIONABLE due to illness.x.com", "quote": "Dominick Barlow and Quentin Grimes are QUESTIONABLE due to illness", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/2003224352163344670", "tags": ["Philadelphia 76ers", "Injuries", "Quentin Grimes", "Dominick Barlow"]}, {"date": "", "archive_date": "2025-12-22", "text": "Dave McMenamin: “I’m speechless … I tried my best to give back and just contribute …I truly appreciate the community, especially the Lakers, people being on this platform, making it worldwide.” - Deandre Ayton on being recognized tor his hurricane relief efforts in the Bahamasx.com", "quote": "I truly appreciate the community, especially the Lakers, people being on this platform, making it worldwide.” - Deandre Ayton on being recognized tor his hurricane relief efforts in the Bahamas", "outlet": "x.com", "source_url": "https://x.com/mcten/status/2003223152697196575", "tags": ["Los Angeles Lakers", "Philanthropy", "Deandre Ayton"]}, {"date": "", "archive_date": "2025-12-22", "text": "Law Murray:Brook Lopez: \"I've always been a team player.I just -- I want whatever team I'm on to succeed. And I want to contribute to winning, however that may happen. So, whether I'm playing or not, I'm gonna try to find ways to help the team win nightly.\"x.com", "quote": "Brook Lopez: \"I've always been a team player.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/2003219974123585604", "tags": ["Los Angeles Clippers", "Brook Lopez"]}, {"date": "", "archive_date": "2025-12-22", "text": "Law Murray: Brook Lopez:\"I'm going to come in, get my work in, get in the weight room, get in my treatment, because you never know what is going to happen in the NBA.You got to be ready, you got to stay ready. Things can flip immediately, you know?… I think we're all ready to go tomorrow\"x.com", "quote": "\"I'm going to come in, get my work in, get in the weight room, get in my treatment, because you never know what is going to happen in the NBA.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/2003220764007498050", "tags": ["Los Angeles Clippers", "Brook Lopez"]}, {"date": "", "archive_date": "2025-12-22", "text": "Ira Winderman:Tyler Herro (toe) again out for Heat on Tuesday vs Raptors.Remaining out are Pelle Larsson (ankle), Nikola Jovic (elbow).x.com", "quote": "Tyler Herro (toe) again out for Heat on Tuesday vs Raptors.", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/2003222093559964157", "tags": ["Miami Heat", "Toronto Raptors", "Injuries", "Tyler Herro", "Nikola Jovic", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-22", "text": "Nearly a year after emerging from bankruptcy, regional sports network operator Main Street Sports is once again teetering on the brink of financial calamity. The company is in advanced talks on a deal to sell itself to DAZN, the London-based sports streamer. If an agreement for DAZN to take majority control does not happen by January, however, Main Street Sports is planning to shut itself down entirely, industry sources said. Such a move would revert the local rights of nine Major League Baseball teams, 13 in the NBA, and seven in the NHL back to those respective leagues and franchises. Resolution on the future path of Main Street Sports is expected by early January.MLB’s Cardinals did not receive a scheduled December rights payment from Main Street Sports, and there is a chance that several other teams, particularly in the NBA, could suffer the same fate in the coming weeks. St. Louis, however, has not terminated its rights agreement.Front Office Sports", "quote": "MLB’s Cardinals did not receive a scheduled December rights payment from Main Street Sports, and there is a chance that several other teams, particularly in the NBA, could suffer the same fate in the coming weeks. St. Louis, however, has not terminated its rights agreement", "outlet": "Front Office Sports", "source_url": "https://frontofficesports.com/newsletter/mlb-nba-rsns-at-risk-of-collapse/", "tags": ["Business", "NBA", "TV Rights"]}, {"date": "", "archive_date": "2025-12-22", "text": "Duane Rankin:\"I think they should just get rid of it overall. I think it just adds more frustration to everybody.\"Devin Booker on NBA's Last Two-Minute Report as it was an \"incorrect non-call\" when Booker wasn't called for a foul on Stephen Curry with 9.1 seconds left as he tried to foul Curry with Suns down 117-116 Saturday. Curry scored on the play to make the difference three with 5.7 seconds left. Suns lost 119-116 as Booker's near half-court heave went array at the buzzer. \"It kind of calls out referees in a way, but a lot of those plays, too, I try to see it from both sides. Not specifically that call, but some calls, you put yourself in the shoes of the other team and you're like, OK, I could see why I'd want that call if I was the other team, but other than that, yeah, it's just a waste.\" On wanting consistency with the officiating: \"Just consistency in the game. I think one of my big problems is I watch all the games mostly every night and expect to get similar calls to people that have the same usage rate as me, but that's not the case. But in the game, with the referee crew you have, I think if similar plays happen on both sides, they should be called or not called.\" #Sunsx.com", "quote": "\"I think they should just get rid of it overall. I think it just adds more frustration to everybody.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2003209203780120695", "tags": ["Golden State Warriors", "Phoenix Suns", "Stephen Curry", "Referees", "Officiating", "Devin Booker"]}, {"date": "", "archive_date": "2025-12-22", "text": "Crazy Stats:Last night, Kevin Durant became the third-fastest player to notch 30,000 points, 5,000 rebounds, and 5,000 assists, doing so in 1,147 games.The only players to do it faster are Michael Jordan (960) and LeBron James (1,107).x.com", "quote": "Last night, Kevin Durant became the third-fastest player to notch 30,000 points, 5,000 rebounds, and 5,000 assists, doing so in 1,147 games.", "outlet": "x.com", "source_url": "https://x.com/NBAcrazystats/status/2003208239790588366", "tags": ["Houston Rockets", "Los Angeles Lakers", "LeBron James", "Kevin Durant", "Michael Jordan", "Statistics"]}, {"date": "", "archive_date": "2025-12-22", "text": "Joey Linn: Will Yanic Konan Niederhauser be in the Clippers’ rotation with Ivica Zubac out? Ty Lue:“We’ll see.”x.com", "quote": "“We’ll see.”", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/2003208514949587089", "tags": ["Los Angeles Clippers", "Ivica Zubac", "Yanic Konan Niederhauser"]}, {"date": "", "archive_date": "2025-12-22", "text": "Joey Linn:Derrick Jones Jr. went through parts of Clippers practice today and Yanic Konan Niederhauser was a full participant.x.com", "quote": "Derrick Jones Jr. went through parts of Clippers practice today and Yanic Konan Niederhauser was a full participant", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/2003206505647177788", "tags": ["Los Angeles Clippers", "Injuries", "Derrick Jones", "Yanic Konan Niederhauser"]}, {"date": "", "archive_date": "2025-12-22", "text": "Josh Lewenberg:Poeltl and Barrett are both OUT for tomorrow’s game in Miami.Injury report now listing Jak as having a lower back strain, no longer “injury management”x.com", "quote": "Poeltl and Barrett are both OUT for tomorrow’s game in Miami.", "outlet": "x.com", "source_url": "https://x.com/JLew1050/status/2003211346943574062", "tags": ["Miami Heat", "Toronto Raptors", "Injuries", "Jakob Poeltl", "RJ Barrett"]}, {"date": "", "archive_date": "2025-12-22", "text": "Sean Highkin:Jerami Grant has been downgraded from \"questionable\" to \"doubtful\" for tonight vs. Detroit.He missed Saturday's game in Sacramento with left Achilles soreness.x.com", "quote": "Jerami Grant has been downgraded from \"questionable\" to \"doubtful\" for tonight vs. Detroit.", "outlet": "x.com", "source_url": "https://x.com/highkin/status/2003210537753051234", "tags": ["Detroit Pistons", "Portland Trail Blazers", "Injuries", "Jerami Grant"]}, {"date": "", "archive_date": "2025-12-22", "text": "Jon Krawczinski:Not getting the sense there's anything serious with Jaden McDaniels' hip injury.Likely just a day-to-day thing right now.Twitter @JonKrawczynski", "quote": "Not getting the sense there's anything serious with Jaden McDaniels' hip injury.", "outlet": "Twitter @JonKrawczynski", "source_url": "https://hoopshype.com/social/", "tags": ["Minnesota Timberwolves", "Jaden McDaniels"]}, {"date": "", "archive_date": "2025-12-22", "text": "Duane Rankin: \"We've consistently played hard.We've been in a lot of dogfights, a lot of late-game situations. A lot of situations to learn from. Moving forward, hopefully we don't make the same mistakes, specifically late game and close out some of these close games better.\" Devin Bookeras Suns are 4-6 in games decided by four points or less.Twitter @DuaneRankin", "quote": "We've been in a lot of dogfights, a lot of late-game situations. A lot of situations to learn from. Moving forward, hopefully we don't make the same mistakes, specifically late game and close out some of these close games better.\" Devin Booker", "outlet": "Twitter @DuaneRankin", "source_url": "https://hoopshype.com/social/", "tags": ["Phoenix Suns", "Devin Booker"]}, {"date": "", "archive_date": "2025-12-22", "text": "Zack Cox:Jordan Walsh (illness) is OUT tonight for the Celtics.He sat out the second half of Saturday’s win at Toronto.Twitter", "quote": "Jordan Walsh (illness) is OUT tonight for the Celtics.", "outlet": "Twitter", "source_url": "http://twitter.com/zm_cox/status/2003203125193359389", "tags": ["Boston Celtics", "Injuries", "Jordan Walsh"]}, {"date": "", "archive_date": "2025-12-22", "text": "NBA Communications:Memphis Grizzlies forward-center Jaren Jackson Jr. and New York Knicks guard Jalen Brunson have been named the NBA Western and Eastern Conference Players of the Week,respectively, for Week 9 of the 2025-26 season (Dec. 15-21).Twitter", "quote": "Memphis Grizzlies forward-center Jaren Jackson Jr. and New York Knicks guard Jalen Brunson have been named the NBA Western and Eastern Conference Players of the Week,", "outlet": "Twitter", "source_url": "http://twitter.com/NBAPR/status/2003201395504349629", "tags": ["Memphis Grizzlies", "New York Knicks", "Awards", "Jalen Brunson", "Jaren Jackson Jr"]}, {"date": "", "archive_date": "2025-12-22", "text": "NBA Communications:Other nominees... West: Deni Avdija and Shaedon Sharpe (POR), Anthony Edwards and Rudy Gobert (MIN), Keyonte George (UTA), Shai Gilgeous-Alexander (OKC) and Nikola Jokić (DEN) East: Cade Cunningham (DET), Josh Giddey and Nikola Vučević (CHI), Kon Knueppel (CHA), Tyrese Maxey (PHI) and Derrick White (BOS)Twitter", "quote": "Other nominees..", "outlet": "Twitter", "source_url": "http://twitter.com/NBAPR/status/2003202400706761196", "tags": ["Boston Celtics", "Charlotte Hornets", "Chicago Bulls", "Denver Nuggets", "Detroit Pistons", "Minnesota Timberwolves", "Oklahoma City Thunder", "Philadelphia 76ers", "Portland Trail Blazers", "Utah Jazz", "Nikola Vucevic", "Rudy Gobert", "Nikola Jokic", "Derrick White", "Shai Gilgeous-Alexander", "Deni Avdija", "Tyrese Maxey", "Anthony Edwards", "Cade Cunningham", "Josh Giddey", "Shaedon Sharpe", "Keyonte George", "Kon Knueppel"]}, {"date": "", "archive_date": "2025-12-22", "text": "Big Sean is taking his white buffs from the block to the boardroom after being named the Detroit Pistons’ Creative Director of Global Experience on Sunday(December 21). The expanded role was created to deepen the organization’s commitment to global fan growth, cultural connection, and innovation—continuing to connect basketball, music, fashion, and art rooted in Detroit’s voice, talent, and identity.BET", "quote": "Big Sean is taking his white buffs from the block to the boardroom after being named the Detroit Pistons’ Creative Director of Global Experience on Sunday", "outlet": "BET", "source_url": "https://www.bet.com/article/0vol5f/detroits-own-big-sean-named-pistons-creative-director-of-global-experience", "tags": ["Detroit Pistons", "Showbusiness", "Big Sean"]}, {"date": "", "archive_date": "2025-12-22", "text": "The multi-platinum hip-hop star will work alongside the Pistons on future global fan development and community engagement efforts, using his platform and hometown pride to usher in new audiences worldwide.In celebration of World Basketball Day, the Pistons and Big Sean also launched a new global initiative titled Creatives Across Continents, inviting cultural tastemakers, designers, and artists from around the world to create original work inspired by Detroit Basketball.BET", "quote": "The multi-platinum hip-hop star will work alongside the Pistons on future global fan development and community engagement efforts, using his platform and hometown pride to usher in new audiences worldwide.", "outlet": "BET", "source_url": "https://www.bet.com/article/0vol5f/detroits-own-big-sean-named-pistons-creative-director-of-global-experience", "tags": ["Detroit Pistons", "Showbusiness", "Big Sean"]}, {"date": "", "archive_date": "2025-12-22", "text": "The Knicks have ruled out Jalen Brunson (right ankle injury management) for Tuesday’s game against Minnesota.OG Anunoby (left ankle soreness) and Guerschon Yabusele (illness) have also been downgraded to out.HoopsHype", "quote": "The Knicks have ruled out Jalen Brunson (right ankle injury management) for Tuesday’s game against Minnesota.", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/10/23/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["New York Knicks", "Injuries", "Guerschon Yabusele", "OG Anunoby", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-22", "text": "Dave McMenamin:Luka Doncic has a wrap on his left leg after practice Monday.JJ Redick said Doncic was evaluated since the Clippers game and a left calf contusion was confirmed.Twitter @mcten", "quote": "Luka Doncic has a wrap on his left leg after practice Monday.", "outlet": "Twitter @mcten", "source_url": "https://hoopshype.com/social/", "tags": ["Los Angeles Lakers", "Injuries", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-22", "text": "Dave McMenamin:JJ Redick with an injury update on the Lakers: Luka Doncic, Austin Reaves and Rui Hachimura remain day to day.Deandre Ayton was a full participant in practice. Gabe Vincent is out.Twitter @mcten", "quote": "JJ Redick with an injury update on the Lakers: Luka Doncic, Austin Reaves and Rui Hachimura remain day to day.", "outlet": "Twitter @mcten", "source_url": "https://hoopshype.com/social/", "tags": ["Los Angeles Lakers", "Injuries", "Luka Doncic", "Deandre Ayton", "Rui Hachimura", "Gabe Vincent", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-22", "text": "The Nuggets have downgraded Jonas Valanciunas (illness) to probablefor Monday's game against Utah.HoopsHype", "quote": "The Nuggets have downgraded Jonas Valanciunas (illness) to probable", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Denver Nuggets", "Injuries", "Jonas Valanciunas"]}, {"date": "", "archive_date": "2025-12-22", "text": "The Jazz have upgraded Lauri Markkanen (right groin injury management) to available for Monday’s gameagainst Denver.HoopsHype", "quote": "The Jazz have upgraded Lauri Markkanen (right groin injury management) to available for Monday’s game", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Utah Jazz", "Injuries", "Lauri Markkanen"]}, {"date": "", "archive_date": "2025-12-22", "text": "The Thunder have ruled out Alex Caruso (right middle finger sprain) for Monday’s gameagainst Memphis.HoopsHype", "quote": "The Thunder have ruled out Alex Caruso (right middle finger sprain) for Monday’s game", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Oklahoma City Thunder", "Injuries", "Alex Caruso"]}, {"date": "", "archive_date": "2025-12-22", "text": "Vinny Benedetto: The Nuggets just announced rookie guardTamar Bates had surgery to repair a fracture in his left foot.He will be reevaluated in 12 weeks.Bluesky", "quote": "Tamar Bates had surgery to repair a fracture in his left foot.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/vbenedetto.bsky.social/post/3maluiza4js2r", "tags": ["Denver Nuggets", "Injuries", "Tamar Bates"]}, {"date": "", "archive_date": "2025-12-22", "text": "Michael Scotto: Memphis Grizzlies sayBrandon Clarke will be re-evaluated in three weeks after suffering a Grade 2 right calf strainin Saturday's game against the Washington Wizards.Twitter @MikeAScotto", "quote": "Brandon Clarke will be re-evaluated in three weeks after suffering a Grade 2 right calf strain", "outlet": "Twitter @MikeAScotto", "source_url": "https://hoopshype.com/social/", "tags": ["Memphis Grizzlies", "Injuries", "Brandon Clarke"]}, {"date": "", "archive_date": "2025-12-22", "text": "Rod Boone:Ryan Kalkbrenner joins Collin Sexton as out.LaMelo Ball is available.Bluesky", "quote": "Ryan Kalkbrenner joins Collin Sexton as out.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/rodboone.bsky.social/post/3malscjrxc225", "tags": ["Charlotte Hornets", "Injuries", "LaMelo Ball", "Collin Sexton", "Ryan Kalkbrenner"]}, {"date": "", "archive_date": "2025-12-22", "text": "Chet Holmgren (illness) has been downgraded to out for Monday's gameagainst Memphis.HoopsHype", "quote": "Chet Holmgren (illness) has been downgraded to out for Monday's game", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Oklahoma City Thunder", "Injuries", "Chet Holmgren"]}, {"date": "", "archive_date": "2025-12-22", "text": "Adam Aaronson:Nick Nurse says Joel Embiid is feeling better and moving better, and that he practiced today.No official update on his status for tomorrow’s game @ Brooklyn until the injury report.Bluesky", "quote": "Nick Nurse says Joel Embiid is feeling better and moving better, and that he practiced today.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/adamaaronson.bsky.social/post/3malqmx5l7c2z", "tags": ["Philadelphia 76ers", "Injuries", "Joel Embiid"]}, {"date": "", "archive_date": "2025-12-22", "text": "Adam Aaronson:Nick Nurse described Kelly Oubre Jr.‘s individual workout today as the most intense since he suffered a left knee LCL sprainon Nov. 14.Bluesky", "quote": "Nick Nurse described Kelly Oubre Jr.‘s individual workout today as the most intense since he suffered a left knee LCL sprain", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/adamaaronson.bsky.social/post/3malqnyzlok2z", "tags": ["Philadelphia 76ers", "Injuries", "Kelly Oubre"]}, {"date": "", "archive_date": "2025-12-22", "text": "Jim Eichenhofer:Herb Jones status was just changed to available for Monday's game vs. Mavericks.He was previously listed as questionable (migraine) #PelicansTwitter @Jim_Eichenhofer", "quote": "Herb Jones status was just changed to available for Monday's game vs. Mavericks.", "outlet": "Twitter @Jim_Eichenhofer", "source_url": "https://hoopshype.com/social/", "tags": ["New Orleans Pelicans", "Injuries", "Herb Jones"]}, {"date": "", "archive_date": "2025-12-22", "text": "Klay Thompson (left knee soreness) has been upgraded to probable for Monday's gameagainst New Orleans.HoopsHype", "quote": "Klay Thompson (left knee soreness) has been upgraded to probable for Monday's game", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Dallas Mavericks", "Injuries", "Klay Thompson"]}, {"date": "", "archive_date": "2025-12-22", "text": "TJ McConnell (left knee soreness) has been ruled out for Monday's game against Boston.Johnny Furphy (left ankle sprain) is available.HoopsHype", "quote": "TJ McConnell (left knee soreness) has been ruled out for Monday's game against Boston.", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Indiana Pacers", "Injuries", "TJ McConnell", "Johnny Furphy"]}, {"date": "", "archive_date": "2025-12-22", "text": "Snoop Dogg will be a game analyst on Peacock’s Los Angeles Clippers versus Golden State Warriors game on Monday, Jan. 5,sources briefed on the move told The Athletic. Snoop, whose real name is Calvin Broadus Jr., will call the game’s second half from courtside with Terry Gannon and Reggie Miller. Snoop will attend the pregame meetings and then observe the first half before putting on his headset.New York Times", "quote": "Snoop Dogg will be a game analyst on Peacock’s Los Angeles Clippers versus Golden State Warriors game on Monday, Jan. 5,", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6911386/2025/12/22/snoop-dogg-analyst-nbc-clippers-warriors-nba/", "tags": ["Golden State Warriors", "Los Angeles Clippers", "Media", "Reggie Miller", "Snoop Dogg", "Terry Gannon"]}, {"date": "", "archive_date": "2025-12-22", "text": "Greensboro Swarm: OFFICIAL:@hornets have recalled Liam McNeeley from the @Greensboro Swarmconcluding his @NBA G League assignmentTwitter", "quote": "@hornets have recalled Liam McNeeley from the @Greensboro Swarm", "outlet": "Twitter", "source_url": "http://twitter.com/greensboroswarm/status/2003133550816804963", "tags": ["Charlotte Hornets", "G League", "Liam McNeeley"]}, {"date": "", "archive_date": "2025-12-22", "text": "Grizzlies PR:The @Memphis Grizzlies today announced the team signed Christian Koloko to a 10-day contract.Twitter @GrizzliesPR", "quote": "The @Memphis Grizzlies today announced the team signed Christian Koloko to a 10-day contract", "outlet": "Twitter @GrizzliesPR", "source_url": "https://hoopshype.com/social/", "tags": ["Memphis Grizzlies", "Christian Koloko"]}, {"date": "", "archive_date": "2025-12-22", "text": "Noa Dalzell:Jaylen Brown (non-COVID illness) is AVAILABLE tonight vs Pacers. Jordan Walsh is still QUESTIONABLE,also with illness.Twitter", "quote": "Jaylen Brown (non-COVID illness) is AVAILABLE tonight vs Pacers. Jordan Walsh is still QUESTIONABLE,", "outlet": "Twitter", "source_url": "http://twitter.com/NoaDalzell/status/2003140369866014890", "tags": ["Boston Celtics", "Injuries", "Jaylen Brown", "Jordan Walsh"]}, {"date": "", "archive_date": "2025-12-22", "text": "Jon Krawczynski:Chris Finch on Micah Nori filling in: \"I'm trying to get this guy a job. How far do I have to go to get this guy off my staff?\"Twitter @JonKrawczynski", "quote": "Chris Finch on Micah Nori filling in: \"I'm trying to get this guy a job. How far do I have to go to get this guy off my staff?\"", "outlet": "Twitter @JonKrawczynski", "source_url": "https://hoopshype.com/social/", "tags": ["Minnesota Timberwolves", "Coaching", "Chris Finch", "Micah Nori"]}, {"date": "", "archive_date": "2025-12-22", "text": "Shams Charania:The Memphis Grizzlies are signing former Lakers and Raptors center Christian Koloko to a 10-day contract via hardship exception,sources tell ESPN.Twitter @ShamsCharania", "quote": "The Memphis Grizzlies are signing former Lakers and Raptors center Christian Koloko to a 10-day contract via hardship exception,", "outlet": "Twitter @ShamsCharania", "source_url": "https://hoopshype.com/social/", "tags": ["Memphis Grizzlies", "Christian Koloko"]}, {"date": "", "archive_date": "2025-12-22", "text": "Tommy Beer:Knicks ranks league-wide over the past month: * 1st in wins (11)* 2nd in Net Rating (+11.2) * 2nd in TS% (61.7%) * 3rd in Offensive Rating (124.1)Bluesky", "quote": "Knicks ranks league-wide over the past month: * 1st in wins (11)", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/tommybeernba.bsky.social/post/3maljljzg3k2i", "tags": ["New York Knicks"]}, {"date": "", "archive_date": "2025-12-22", "text": "The loudest league chatter about the Knicks is that they are open to trading Guerschon Yabusele,the team’s biggest free-agency signing last offseason. He signed a two-year contract that will pay him $5.5 million this season and has a $5.7 million player option for next season. Yabusele hasn’t found his footing with the Knicks after an OK season with a bad Philadelphia 76ers team last season. The 30-year-old has struggled defensively while also shooting below 31 percent from 3 and less than 40 percent from the field overall and averaging under 10 minutes per game for head coach Mike Brown.New York Times", "quote": "The loudest league chatter about the Knicks is that they are open to trading Guerschon Yabusele,", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6908462/2025/12/22/knicks-trade-deadline-moves-nba/", "tags": ["New York Knicks", "Trade", "Guerschon Yabusele"]}, {"date": "", "archive_date": "2025-12-22", "text": "Given New York’s financial situation, it can’t afford to get nothing out of that salary slot. Multipleleague executives believe the Knicks would have to attach something to Yabusele in order to have a chance to move him before the deadline. Other than what New York does or doesn’t do with Yabusele, the franchise has long put out feelers about adding another ballhandlerand/or frontcourt player, per league sources.New York Times", "quote": "league executives believe the Knicks would have to attach something to Yabusele in order to have a chance to move him before the deadline. Other than what New York does or doesn’t do with Yabusele, the franchise has long put out feelers about adding another ballhandler", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6908462/2025/12/22/knicks-trade-deadline-moves-nba/", "tags": ["New York Knicks", "Trade", "Guerschon Yabusele"]}, {"date": "", "archive_date": "2025-12-22", "text": "Credit Brown for keeping an open mind. Hart’s ability to push the ball in transition has changed the Knicks. “Josh gets in (and) he's probably one of the fastest with the ball; he's going to the rim, or he's driving in the paint, trying to find guys,” Bridges says. “I think his ability to get in transition and push and create opens up a lot.” Hart’s individual numbers as a starter are strong. He’s averaging 15 points, 9.3 rebounds and 5.7 assists while shooting 52.6 percent from the floor and 40.7 on threes. And the Knicks have done a lot of winning with Hart in the starting lineup.“He’s our Draymond Green,” one Knick staffer said recently.SportsNet New York", "quote": "“He’s our Draymond Green,” one Knick staffer said recently", "outlet": "SportsNet New York", "source_url": "https://sny.tv/articles/knicks-josh-hart-starting-lineup-all-star-case-122025", "tags": ["Golden State Warriors", "New York Knicks", "Draymond Green", "Josh Hart"]}, {"date": "", "archive_date": "2025-12-22", "text": "NBA Stat:Jalen Johnson has recorded at least 7 points, 7 rebounds, and 7 assists in 17 consecutive games. In NBA history, only two players have recorded longer such streaks:Oscar Robertson (20 games, twice) and Wilt Chamberlain (19 games). (via CrazyStats)Bluesky", "quote": "Jalen Johnson has recorded at least 7 points, 7 rebounds, and 7 assists in 17 consecutive games. In NBA history, only two players have recorded longer such streaks:", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/nbastat.bsky.social/post/3malbij4uvc2w", "tags": ["Atlanta Hawks", "Oscar Robertson", "Wilt Chamberlain", "Statistics", "Jalen Johnson"]}, {"date": "", "archive_date": "2025-12-22", "text": "After Thomas suffered yet another hamstring injury Nov. 5 — his fourth since the start of last season — he finally was cleared for 5-on-5 work Saturday. But head coach Jordi Fernández was non-committal about when his guard would go full contact, much less play in a live game.“CT is doing great. He had his 5-on-5 [Saturday], looked really good,” Fernández said. “And he’s going to continue to do that until we feel he’s ready to go.New York Post", "quote": "“CT is doing great. He had his 5-on-5 [Saturday], looked really good,” Fernández said. “And he’s going to continue to do that until we feel he’s ready to go", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/22/sports/cam-thomas-nets-return-remains-murky-even-after-taking-big-step/", "tags": ["Brooklyn Nets", "Injuries", "Cam Thomas"]}, {"date": "", "archive_date": "2025-12-22", "text": "The NBA and FIBA are poised to launch a new European basketball league, and will commence the process of engaging teams and owners next month. This ambitious joint venture aims to reshape the continent's basketball landscape, offering both stability and a clear path for emerging talent. The proposed league structure will incorporate permanent team placements and a \"merit-based pathway\" for annual qualification.Yahoo! Sports", "quote": "The NBA and FIBA are poised to launch a new European basketball league, and will commence the process of engaging teams and owners next month", "outlet": "Yahoo! Sports", "source_url": "https://uk.news.yahoo.com/nba-chief-delivers-proposed-european-132804908.html", "tags": ["NBA Europe"]}, {"date": "", "archive_date": "2025-12-22", "text": "One source close to the process, however, pushed back to The Stein Line on the idea that any dismay from Gilbert would have any immediate impact on Atkinson,noting that Gilbert had perhaps the strongest voice in Northeast Ohio backing the selection of Atkinson as J.B. Bickerstaff's successor over current New Orleans interim coach James Borrego.marcstein.substack.com", "quote": "One source close to the process, however, pushed back to The Stein Line on the idea that any dismay from Gilbert would have any immediate impact on Atkinson,", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/sunday-best-the-latest-from-nba-trade?utm_campaign=posts-open-in-app&triedRedirect=true", "tags": ["Cleveland Cavaliers", "Coaching", "Kenny Atkinson"]}, {"date": "", "archive_date": "2025-12-22", "text": "Jaylen Brown: Like, I have a lot of other interests, and basketball is the number one focus. But by the time I get past 15 years of my life, do I want to still have it dominate so much of my life? I'm not sure. Like, I want to go back to school and things like that. Like, there are other things that I potentially — we might get into.So we'll see. I'm just taking one day at a time. But if you ask me — if I had to answer right now — I'm gonna be like: \"Give me five more, and I'll go with that.\"YouTube", "quote": "So we'll see. I'm just taking one day at a time. But if you ask me — if I had to answer right now — I'm gonna be like: \"Give me five more, and I'll go with that.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=ovhgoRBPB-s", "tags": ["Boston Celtics", "Jaylen Brown"]}, {"date": "", "archive_date": "2025-12-22", "text": "10-year NBA guardCameron Payne appears to be on the verge of becoming a new Partizan Mozzart Bet Belgrade player, with the move now looking like a matter of timing rather than uncertainty. On Sunday, Payne seemingly confirmed the transfer himself by posting black-and-white heart emojis on his Instagram stories — a gesture widely interpreted as a nod to Partizan's iconic colors. Although the agreement is reportedly finalized, Payne's official arrival is expected to wait until Tuesday, when Partizan are set to introduce their new head coach, Joan Penarroya.BasketNews", "quote": "Cameron Payne appears to be on the verge of becoming a new Partizan Mozzart Bet Belgrade player, with the move now looking like a matter of timing rather than uncertainty", "outlet": "BasketNews", "source_url": "https://basketnews.com/news-237316-cameron-payne-joins-partizan-belgrade-euroleague.html", "tags": ["Free Agency", "Serbia", "Cameron Payne"]}, {"date": "", "archive_date": "2025-12-22", "text": "[Highlight] Jalen Brunson post game interview after Garden career high 47 points against Miami answers who had the biggest shot down the stretch:\"Unfortunately I'mma say Josh. He's been a pretty terrible friend as of recently but I'mma say Josh.\"reddit", "quote": "\"Unfortunately I'mma say Josh. He's been a pretty terrible friend as of recently but I'mma say Josh.\"", "outlet": "reddit", "source_url": "https://www.reddit.com/r/nba/comments/1psna31/highlight_jalen_brunson_post_game_interview_after/", "tags": ["New York Knicks", "Frivolities", "Josh Hart", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-22", "text": "Oh No He Didn't: \"Obviously you're one of the better or the best rebounding guard\" Russ: \"I didn't hear you\"\"The best\" Russ: \"There you go...don't play around with it\"x.com", "quote": "\"The best\" Russ: \"There you go...don't play around with it\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2002988057600066005", "tags": ["Sacramento Kings", "Russell Westbrook", "Frivolities"]}, {"date": "", "archive_date": "2025-12-22", "text": "Law Murray: Ime Udoka in Sacramento tonight:\"We didn't really deserve to win that...I gotta do a better job of getting them motivated in games against lesser opponents\"x.com", "quote": "\"We didn't really deserve to win that...", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/2002981924462309680", "tags": ["Houston Rockets", "Sacramento Kings", "Ime Udoka"]}]