[{"date": "", "archive_date": "2025-12-11", "text": "As has been the case so often in recent years, the Rockets found a way to get what they wanted without shortening the team's shelf life by making desperate moves. That’s been a mantra of sorts for Stone, who values this young core greatly and has frequently resisted the temptation to reach for overpriced roster shortcuts. Case in point,league sources say they’re not interested in pursuing Memphis’ Ja Morant despite having lost veteran point guard Fred VanVleet for the season with a torn ACL.New York Times", "quote": "league sources say they’re not interested in pursuing Memphis’ Ja Morant despite having lost veteran point guard Fred VanVleet for the season with a torn ACL", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Houston Rockets", "Memphis Grizzlies", "Trade", "Fred VanVleet", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-11", "text": "Pat Spencer is still playing on borrowed time. He has logged 17 of his 50 eligible games as a two-way player. Eventually, the Warriors will need to convert him to a full-time contract — or send him back to the G League. Only one of those options is acceptable to the guard. Spencer doesn’t want much. He isn’t in this for the fame and fortune.The guard still drives the same 2011 Honda CRV that shuttled him between lacrosse and basketball practices in high school. He prides himself on simplicity. “Look, this is cliche, but if you told me I could live and my family would be taken care of and I could do all of this for free — then I would do it,” Spencer said.Chicago Tribune", "quote": "The guard still drives the same 2011 Honda CRV that shuttled him between lacrosse and basketball practices in high school. He prides himself on simplicity. “Look, this is cliche, but if you told me I could live and my family would be taken care of and I could do all of this for free — then I would do it,” Spencer said", "outlet": "Chicago Tribune", "source_url": "https://www.chicagotribune.com/2025/12/11/pat-spencer-northwestern-golden-state-warriors/", "tags": ["Golden State Warriors", "Pat Spencer"]}, {"date": "", "archive_date": "2025-12-11", "text": "Many offensive fundamentals of lacrosse are intertwined with the basics of basketball. Attackers utilize screen actions to create spacing. The sports even share similar vocabulary — pick-and-roll, drive-and-kick. In summer workouts, Collins noticed that Spencer manipulated screens with the adept confidence of a veteran guard. By opening day, he had won the starting point guard position.Collins still believes Spencer could have grown into a All-Big Ten player if he had one more year of eligibility. But even on its own, that solo season showcased his potential. “It just reaffirmed my belief in myself,” Spencer said. “It was a testament to the fact that — look, I can’t even shoot the ball yet. My body’s not where I wanted it to be yet.And I’m still able to do what I was doing. It reaffirmed that, OK, if I put my head down and start working, I’m going to make this thing happen.”Chicago Tribune", "quote": "Collins still believes Spencer could have grown into a All-Big Ten player if he had one more year of eligibility. But even on its own, that solo season showcased his potential. “It just reaffirmed my belief in myself,” Spencer said. “It was a testament to the fact that — look, I can’t even shoot the ball yet. My body’s not where I wanted it to be yet.", "outlet": "Chicago Tribune", "source_url": "https://www.chicagotribune.com/2025/12/11/pat-spencer-northwestern-golden-state-warriors/", "tags": ["Golden State Warriors", "Pat Spencer", "lacrosse"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jason Collins: I have Stage 4 glioblastoma, one of the deadliest forms of brain cancer. It came on incredibly fast. In May I married the love of my life, Brunson Green, at a ceremony in Austin, Texas, that couldn't have been more perfect. In August, we were supposed to go to the US Open, just as every year, but when the car came to take us to the airport, I was nowhere near ready. And for the first time in decades, we missed the flight because I couldn't stay focused to pack. I had been having weird symptoms like this for a week or two, but unless something is really wrong, I'm going to push through. I'm an athlete.ESPN", "quote": "Jason Collins: I have Stage 4 glioblastoma, one of the deadliest forms of brain cancer. It came on incredibly fast", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47266076/jason-collins-stage-4-glioblastoma", "tags": ["Jason Collins"]}, {"date": "", "archive_date": "2025-12-11", "text": "Doncic recently said the NBA Cup courts pose a safety issue. Between the design and such concerns, what are players’ actual feelings about the courts?Jonathan Isaac, Magic forward: “I would say (they’re) a little bit of a distraction, and that’s just me personally. Minnesota’s court was like you could see the colors coming off the ground onto the players’ jerseys and stuff (on TV).That’s just a little much. I feel like if we tone it down just a little bit, it’d be better.”New York Times", "quote": "Jonathan Isaac, Magic forward: “I would say (they’re) a little bit of a distraction, and that’s just me personally. Minnesota’s court was like you could see the colors coming off the ground onto the players’ jerseys and stuff (on TV).", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6878535/2025/12/11/nba-cup-las-vegas-reaction", "tags": ["Minnesota Timberwolves", "Orlando Magic", "Jonathan Isaac", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "In Year 3, how has the attitude toward the NBA Cup shifted? How seriously is the cup taken by fellow players and why/why not?Lu Dort, Oklahoma City Thunder guard: “I like it. It’s fun. Obviously, we are playing for something — which is entertaining, especially in the middle of the season — and the team gets to go to Vegas.It was a nice experience last year. We didn’t finish the job, but just the experience overall was amazing.”New York Times", "quote": "Lu Dort, Oklahoma City Thunder guard: “I like it. It’s fun. Obviously, we are playing for something — which is entertaining, especially in the middle of the season — and the team gets to go to Vegas.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6878535/2025/12/11/nba-cup-las-vegas-reaction/", "tags": ["Oklahoma City Thunder", "Luguentz Dort", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jalen Brunson, New York Knicks guard: “I think there is competitive basketball night in and night out. There’s a little added juice to it knowing what’s at stake.If you win, you move on and try to win something. We have a lot of guys and coaches who don’t make as much as some guys on this team, so it’s an added bonus for them, as well. You’re not just playing for yourself, you’re playing for the entire team.”New York Times", "quote": "Jalen Brunson, New York Knicks guard: “I think there is competitive basketball night in and night out. There’s a little added juice to it knowing what’s at stake.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6878535/2025/12/11/nba-cup-las-vegas-reaction/", "tags": ["New York Knicks", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "The Thunder advanced to the Las Vegas portion of NBA Cup play for the second year in a row and will face the San Antonio Spurs in the West semifinals on Saturday. The winner of that game will play in the Cup championship game on Tuesday.“Winning is never boring,” Williams said. “There was a time when some players on our team were getting blown out. I’m not going to name names, but we lost by 70.I think some guys have it in the back of their minds. Even my first year, we weren’t winning a ton. We were solid. But I think I have that in the back of my mind. You can’t get bored with the process.”New York Times", "quote": "“Winning is never boring,” Williams said. “There was a time when some players on our team were getting blown out. I’m not going to name names, but we lost by 70.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881055/2025/12/11/thunder-nba-cup-quarterfinals-suns-streak/", "tags": ["Oklahoma City Thunder", "Jalen Williams", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "Still, Maciej Lampe is interested in continuing his path in basketball as a coach.“There is a small chance, a possibility, that I could join Real Madrid’s coaching staff. Sergio Scariolo was my coach when I was at Real, when I debuted as the youngest player in the club’s history — until Luka Dončić broke my record.I called Sergio at the beginning of the year and told him: ‘It would be nice if I could start my coaching career where I began my playing career.’ He was open to the idea. He told me: ‘Try to find a job as an assistant or a head coach somewhere, do well, and then you’ll increase your chances of coming to Real in the future.’ That’s my plan now,” he continued, adding that Sergio Scariolo had a big influence on him early in his career.EuroHoops.net", "quote": "“There is a small chance, a possibility, that I could join Real Madrid’s coaching staff. Sergio Scariolo was my coach when I was at Real, when I debuted as the youngest player in the club’s history — until Luka Dončić broke my record.", "outlet": "EuroHoops.net", "source_url": "https://www.eurohoops.net/en/euroleague/1905675/maciej-lampe-there-is-a-small-chance-that-i-could-join-real-madrids-coaching-staff/", "tags": ["Real Madrid", "Sergio Scariolo", "Maciej Lampe"]}, {"date": "", "archive_date": "2025-12-11", "text": "Madison Square Garden, the oldest active arena in the NHL and NBA, opened in 1968. Older buildings have quirks, but none has an entrance quite like the Garden’s. The ramp is part of the building’s lore: something players can both rue for its steepness and appreciate as distinct. The arena’s playing surface — ice for hockey, hardwood for basketball — is on the fifth floor, above both Penn Station and an active theater used for shows and smaller concerts. Some vehicles, such as black cars that bring celebrities to games, can fit up the ramp, but it’s too narrow and winding for buses. Rangers and Knicks players have the luxury of an elevator. Visitors? Get ready to hike. It’s about 150 steps, depending on stride length. “It’s kind of what makes it special, though,” Martinook said. “You know you’re doing this walk, and you’re walking up to one of the most famous arenas in the world.”New York Times", "quote": "Madison Square Garden, the oldest active arena in the NHL and NBA, opened in 1968. Older buildings have quirks, but none has an entrance quite like the Garden’s. The ramp is part of the building’s lore: something players can both rue for its steepness and appreciate as distinct", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6879514/2025/12/11/msg-madison-square-garden-ramp-knicks-rangers/", "tags": ["New York Knicks", "Madison Square Garden"]}, {"date": "", "archive_date": "2025-12-11", "text": "Still, most Rangers and Knicks who had to make the walk with their former teams don’t miss it. “It’s a kind of challenging two minutes,” said Rangers defenseman Vladislav Gavrikov, who came to New York from the Los Angeles Kings as a free agent over the summer. “Legs get burning. I needed to catch my breath after that.”“It’s definitely a hike,” added Knicks wing Josh Hart, who went up the ramp while playing for the Los Angeles Lakers, New Orleans Pelicans and Portland Trail Blazers.New York Times", "quote": "“It’s definitely a hike,” added Knicks wing Josh Hart, who went up the ramp while playing for the Los Angeles Lakers, New Orleans Pelicans and Portland Trail Blazers", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6879514/2025/12/11/msg-madison-square-garden-ramp-knicks-rangers/", "tags": ["New York Knicks", "Madison Square Garden", "Josh Hart"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jake Fischer:“The only player I think in the league that Golden State would be willing to move Draymond Green for would be Giannis Antetokounmpo. That’s the only player. Between him and Jonathan Kuminga and Brandin Podziemski, all of a sudden Golden State probably does have an intriguing package if you're Milwaukee. But I don't think that they are going to be pushing Draymond's salary onto the table — or Jimmy Butler’s salary — for anyone short of him.”YouTube", "quote": "“The only player I think in the league that Golden State would be willing to move Draymond Green for would be Giannis Antetokounmpo. That’s the only player", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=xAMVMh9f7KA", "tags": ["Golden State Warriors", "Milwaukee Bucks", "Trade", "Draymond Green", "Giannis Antetokounmpo", "Jonathan Kuminga", "Brandin Podziemski"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jake Fischer: “ButI’d say overall from my conversations with people around the league, with people around Milwaukee, with people around the Antetokounmpo brothers, that the writing is on the wall.And we are in this position right now because Antetokounmpo’s agent, Alex Saratsis, told the Bucks this past summer that they were going to re-evaluate things about 20 games into the year.”YouTube", "quote": "I’d say overall from my conversations with people around the league, with people around Milwaukee, with people around the Antetokounmpo brothers, that the writing is on the wall.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=xAMVMh9f7KA", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo", "Alex Saratsis"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jake Fischer: “Now, on to Anthony Davis — this is our final segment. There was reporting from ESPN this morning that there are three teams to monitor as potential landing spots for AD: Detroit, Atlanta, and Toronto. And not to pour cold water on someone else’s work, but I’m going to say right now —I find the Pistons to be an incredibly unlikely landing spot for Anthony Davis. We talked about this with Lauri Markkanen a couple weeks ago. The fact is: the Pistons are near the top of the Eastern Conference standings, and they have tradable salary pieces like Tobias Harris, Caris LeVert, and Duncan Robinson...”YouTube", "quote": "I find the Pistons to be an incredibly unlikely landing spot for Anthony Davis", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=xAMVMh9f7KA", "tags": ["Dallas Mavericks", "Detroit Pistons", "Trade", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-11", "text": "Kuminga’s removal from Golden State’s rotation – however temporary or not – came five-plus weeks ahead of Jan. 15, when the bouncy fifth-year forward becomes eligible for trades. Kuminga signed a two-year contract worth $48.5 million in October with a team option for 2026-27 that grants inherent flexibility after a summer of tense negotiations during Kuminga’s restricted free agency. Kerr said he’s talked to Kuminga about the business of basketball and “I can imagine it’s not easy for him. And we’ve talked about the situation.My desire for JK is to become the best player he can possibly be – regardless of where he ends up, whether it’s here or elsewhere.”San Francisco Chronicle", "quote": "My desire for JK is to become the best player he can possibly be – regardless of where he ends up, whether it’s here or elsewhere.”", "outlet": "San Francisco Chronicle", "source_url": "https://www.sfchronicle.com/sports/warriors/article/warriors-kerr-wants-kuminga-succeed-or-21236006.php", "tags": ["Golden State Warriors", "Trade", "Steve Kerr", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jake Fischer:I don’t think Sacramento is really interested in LaMelo Ball. I think everything Scott Perry has talked about, both privately and publicly since taking over this team, points to a desire to reestablish a tough, gritty identity. Someone I spoke with on the phone this morning — a prominent NBA figure — called LaMelo Ball ‘the most unserious player in the NBA.’That’s not my opinion — that was a quote from someone inside the league. I don’t think Sacramento would view LaMelo as someone to really reinvigorate their culture around.”YouTube", "quote": "I don’t think Sacramento is really interested in LaMelo Ball. I think everything Scott Perry has talked about, both privately and publicly since taking over this team, points to a desire to reestablish a tough, gritty identity. Someone I spoke with on the phone this morning — a prominent NBA figure — called LaMelo Ball ‘the most unserious player in the NBA.’", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=xAMVMh9f7KA", "tags": ["Charlotte Hornets", "Sacramento Kings", "Trade", "Scott Perry", "LaMelo Ball"]}, {"date": "", "archive_date": "2025-12-11", "text": "With real stakes on the line for the Lakers in the NBA Cup quarterfinals -- a $530,000 cash prize per player and a second Cup championship in three years for the franchise hinging on the result -- L.A. was thoroughly outplayed in a 132-119 loss to the San Antonio Spurs on Wednesday. The Spurs exposed the Lakers' already suspect perimeter defense, which ranked in the bottom five in the league in opponents' 3-point percentage (38.2%), by hitting 17-of-38 from the outside (44.7%) and leading by as many as 24 points in the elimination game for the in-season tournament.ESPN", "quote": "With real stakes on the line for the Lakers in the NBA Cup quarterfinals -- a $530,000 cash prize per player and a second Cup championship in three years for the franchise hinging on the result -- L.A. was thoroughly outplayed in a 132-119 loss to the San Antonio Spurs on Wednesday", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47274638/lakers-focus-reeling-d-not-playoff-talk-loss-spurs", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "After the loss to the Spurs, James was asked if L.A.'s showing in the NBA Cup will have any bearing on his team's playoff outlook and the 23-year veteran said that discussion was entirely premature. \"Ican't think about what we can do in the playoffs in December,\" James said after finishing with 19 points, 15 rebounds and 8 assists. \"What I can say is that the habits that we build throughout the regular season each month [are what is important].If we are in a position to make it to the postseason and be able to get to that point, well, we have to build it now. \"But as far as talking about what type of damage we're going to do in the postseason in December, that's not right for the basketball gods, not for me.\"ESPN", "quote": "can't think about what we can do in the playoffs in December,\" James said after finishing with 19 points, 15 rebounds and 8 assists. \"What I can say is that the habits that we build throughout the regular season each month [are what is important].", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47274638/lakers-focus-reeling-d-not-playoff-talk-loss-spurs", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "LeBron James", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "Khobi Price:LeBron James mentioned \"five guys being on a string\" when asked how the Lakers' perimeter on-ball defense can improve: \"It has to be five guys on a string.Communication, always at an all-time high, letting you know what's going on behind you and things of that nature.\"Bluesky", "quote": "LeBron James mentioned \"five guys being on a string\" when asked how the Lakers' perimeter on-ball defense can improve: \"It has to be five guys on a string.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/khobiprice.bsky.social/post/3m7oxbepyns2r", "tags": ["Los Angeles Lakers", "LeBron James"]}, {"date": "", "archive_date": "2025-12-11", "text": "Luka Doncic just played 40+ minutes for the sixth time already this season Lakers lost his early quarter rest minutes by 12 points in a game decided by 14 points before garbage time Asked Doncic about the bench\"I'm comfortable sitting… We have a group that can do it\"Bluesky", "quote": "\"I'm comfortable sitting… We have a group that can do it\"", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/lawmurraythenu.bsky.social/post/3m7ozn55j2k2u", "tags": ["Los Angeles Lakers", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-11", "text": "Lakers Daily:JJ Redick on Austin: \"The guys carried us for 6 weeks and that takes a toll on you. He kept fighting and I appreciate that. He's gonna have a lot more great nights than frustrating nights.\"x.com", "quote": "JJ Redick on Austin: \"The guys carried us for 6 weeks and that takes a toll on you. He kept fighting and I appreciate that. He's gonna have a lot more great nights than frustrating nights.\"", "outlet": "x.com", "source_url": "https://x.com/LakersDailyCom/status/1998994357907763264", "tags": ["Los Angeles Lakers", "JJ Redick", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-11", "text": "Tim Bontemps: Per the great @StatsWilliams :The Oklahoma City Thunder have led by at least 20 points for 264 minutes and 17 seconds this season. They have trailed for 249 minutes and 53 seconds. Not bad.x.com", "quote": "The Oklahoma City Thunder have led by at least 20 points for 264 minutes and 17 seconds this season. They have trailed for 249 minutes and 53 seconds", "outlet": "x.com", "source_url": "https://x.com/TimBontemps/status/1998952824596804050", "tags": ["Oklahoma City Thunder", "Statistics"]}, {"date": "", "archive_date": "2025-12-11", "text": "However, extending the Thunder's streak has never been a priority, according to Daigneault, which has been critical in securing the consecutive wins one game at a time. Daigneault delivered an honest response when a reporter asked him what the secret was to the Thunder's emphatic 16-game winning streak.“Not focusing on the win streak,” Daigneault said. “You just gotta play the next possession, get better the next day, win the next quarter, and compete in the next game. If you do that and you're present in the process, sometimes you look up, and you win a certain amount of games in a row. But we certainly need to understand that we still have a lot of improvement to make. We have a lot of things to sustain and a lot of competitive challenges ahead. “There's a lot of season ahead of us. But guys have done a great job of staying very present in the season, so far, competing in the moment, and it's put us in a nice position,” Daigneault concluded.Clutch Points", "quote": "“Not focusing on the win streak,” Daigneault said. “You just gotta play the next possession, get better the next day, win the next quarter, and compete in the next game. If you do that and you're present in the process, sometimes you look up, and you win a certain amount of games in a row. But we certainly need to understand that we still have a lot of improvement to make. We have a lot of things to sustain and a lot of competitive challenges ahead", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/oklahoma-city-thunder/thunder-news-why-mark-daigneault-isnt-focused-16-game-win-streak", "tags": ["Oklahoma City Thunder", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-11", "text": "Oh No He Didn't:JDub: \"It's not anything really to be like blown up. As bad as I want it to be something that's blown up, it's the NBA. Nobody really fights anyway\"x.com", "quote": "JDub: \"It's not anything really to be like blown up. As bad as I want it to be something that's blown up, it's the NBA. Nobody really fights anyway\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/1998987343706075212", "tags": ["Oklahoma City Thunder", "Jalen Williams"]}, {"date": "", "archive_date": "2025-12-11", "text": "EVERY TIME DORT watches film, Paul pops into his mind. That's because Dort still uses the iPad that Paul bought for him during their season as teammates, when a purchase that expensive would have put a significant dent in the paycheck Dort received while on a two-way contract. \"What I saw in Lu really quick was that he had the work ethic,\" Paul said.Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years.Paul made sure that Dort had access to Second Spectrum, a subscription service used by NBA teams, and tutored him on how to filter clips by using specific searches by play categories or statistics. And Paul often watched film with Dort, pointing out nuances he should notice and advising him on how to take notes. \"Being CP3's rook, honestly, it was amazing, especially in the position that I was in on a two-way,\" Dort told ESPN. \"Obviously, Chris is Chris, and me coming out of college, I see Chris as a big superstar. So at first we didn't have that many conversations, but as I got more with the team, we got closer and I could see what type of guy Chris really was. And he was a great dude, honestly.ESPN", "quote": "Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Los Angeles Clippers", "Oklahoma City Thunder", "Chris Paul", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-11", "text": "Mark Medina: Spurs coachMitch Johnson on if Victor Wembanyama can return for NBA Cup semifinal vs OKC on Sat: \"Very much so. He had a very good day today.He had a very intense day this morning. We'll have to see how he responds and reacts tomorrow.\"x.com", "quote": "Mitch Johnson on if Victor Wembanyama can return for NBA Cup semifinal vs OKC on Sat: \"Very much so. He had a very good day today.", "outlet": "x.com", "source_url": "https://x.com/MarkG_Medina/status/1998993975932498133", "tags": ["San Antonio Spurs", "Injuries", "Mitch Johnson", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "Grant Hill: I think you you know, the World Cup and and the Olympics are very different. Um, you know, I think the Paris Olympics in 24 certainly hopeful with the 28 Olympics in Los Angeles, players wanted to play.They wanted to be a part of that and we're real grateful and thankful for that. You know, it's a little bit of a of a tougher sell with the World Cup if I'm being honest.And so, it's an opportunity, I think, to really the idea of really truly building a roster. And, you know, I loved the guys that we had in in in 2023 in World Cup. And, uh, we came close. You know, we [clears throat] we we we competed, we played hard. Offensively, we were the most efficient offensive team since 2004 in in terms of USA basketball. We were also the the least uh efficient defensive team since 2004.YouTube", "quote": "They wanted to be a part of that and we're real grateful and thankful for that. You know, it's a little bit of a of a tougher sell with the World Cup if I'm being honest.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=0swyN4VEleI", "tags": ["USA Basketball", "Grant Hill", "World Cup"]}, {"date": "", "archive_date": "2025-12-11", "text": "JB Bickerstaff: To me the best places have a true partnership uh where you know the conversations are had and by the end of the day you leave there with uh you know a succinct idea of what we're going to do and then now as a coach it's our responsibility to go out and execute the basketball part of it. But you know there's some places where you know they will tell you who to hire on your staff.\"They will tell you who to hire on your staff. They will tell you what players have to play and how many minutes they have to get. They will tell you, you know, how many pick and rolls does this young player need to play every single night.Uh, and then there’s some guys that just hire you and they let you do the job and, uh, you know, they trust that you're going to execute the vision that you guys sit down, uh, and talk through.\"YouTube", "quote": "\"They will tell you who to hire on your staff. They will tell you what players have to play and how many minutes they have to get. They will tell you, you know, how many pick and rolls does this young player need to play every single night.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=JjOkvNMvMzA", "tags": ["Detroit Pistons", "Coaching", "JB Bickerstaff"]}, {"date": "", "archive_date": "2025-12-11", "text": "JB Bickerstaff:There are owners in the league that can get in the way. You know, they hire people to do a job, but then they meddle in how those people do the job based on their own opinion.And sometimes we laugh about it, but it's like, you know, in their other businesses that made them money, you know, they hire people that they trust or, you know, they know what they're doing and they have the experience, so they trust themselves and it's worked for them. But Tom (Gores) is phenomenal in the amount of support that he lends. Um, the trust that he has in myself to do the job. But his question that he asks me every single time we talk is, 'Do you need anything? And how can I help you?' And for me, you know, that just gives me the utmost confidence that I can go out and do the job the way the job needs to be done because, you know, from top down, you've got a guy who supports you, uh, who trusts you, you know, to do the job.\"YouTube", "quote": "There are owners in the league that can get in the way. You know, they hire people to do a job, but then they meddle in how those people do the job based on their own opinion.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=JjOkvNMvMzA", "tags": ["JB Bickerstaff"]}, {"date": "", "archive_date": "2025-12-11", "text": "None of those moves was as monumental as the Dallas Mavericks’ decision to fire Nico Harrison, whose ill-fated decision to send Luka Dončić to the Los Angeles Lakers in February seems destined to go down as one of the worst trades of all time. But from Sacramento to New Orleans, Denver, Atlanta, Phoenix and Toronto, the top roster builder was shown the door, in essence, because they failed to keep up with the Prestis. To no one’s surprise, longtimeThunder president of basketball operations Sam Presti and his staff were the winners of this honor for the second consecutive season.Yet the unique part about what Presti and his group are doing, and the thing that helped them extend their lead on the rest of the field from last time around, is that they’re still building at an elite level during this time when the current roster looks worthy of evolving into a dynasty as it is. As our John Hollinger details below, that’s a remarkable feat to pull off. From there, though, there were all kinds of shifts in the reputational rankings that are worth chronicling.New York Times", "quote": "Thunder president of basketball operations Sam Presti and his staff were the winners of this honor for the second consecutive season.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Oklahoma City Thunder", "Sam Presti"]}, {"date": "", "archive_date": "2025-12-11", "text": "Basketball legendDavid Rivers reinvents himself as a business executive and market disruptor with $60B breakthroughEuroHoops.net", "quote": "David Rivers reinvents himself as a business executive and market disruptor with $60B breakthrough", "outlet": "EuroHoops.net", "source_url": "https://www.eurohoops.net/en/euroleague/1905587/basketball-legend-david-rivers-reinvents-himself-as-a-business-executive-and-market-disruptor-with-60b-breakthrough/", "tags": ["Business", "David Rivers"]}, {"date": "", "archive_date": "2025-12-11", "text": "NBA championIsaiah Rider was arrested earlier this month after he allegedly violated a court order ... TMZ Sports has learned. Law enforcement sources tell us that the 54-year-old was arrested on December 4 and charged with one count of interfering with judicial proceedings.TMZ.com", "quote": "Isaiah Rider was arrested earlier this month after he allegedly violated a court order ... TMZ Sports has learned", "outlet": "TMZ.com", "source_url": "https://www.tmz.com/2025/12/11/former-nba-isaiah-rider-arrested-violating-protective-order/", "tags": ["Law", "Isaiah Rider"]}, {"date": "", "archive_date": "2025-12-10", "text": "Clemente Almanza:FINAL: Thunder 138, Suns 89SGA - 28 points, 8 assists Holmgren - 24 points, 8 rebounds, 3 blocks Williams - 15 points, 5 rebounds, 5 assists Wallace - 9 points, 4 steals Brooks - 16 points, 2 rebounds Allen - 10 points, 4 assists Goodwin - 15 points, 3 rebounds OKC is 24-1x.com", "quote": "FINAL: Thunder 138, Suns 89", "outlet": "x.com", "source_url": "https://x.com/CAlmanza1007/status/1998948122937233770", "tags": ["Oklahoma City Thunder", "Phoenix Suns", "Archie Goodwin", "Grayson Allen", "Dillon Brooks", "Shai Gilgeous-Alexander", "Chet Holmgren", "Jalen Williams"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brandon Rahbar:Thunder improve to 24-1. 12-0 at home. 16 straight wins (best in OKC history). Tie 2016 Warriors for best start in NBA history. Punch ticket to the NBA Cup Semifinals. Next up: Lakers/Spurs winner on Saturday in Las Vegas.x.com", "quote": "Thunder improve to 24-1", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998947383741395055", "tags": ["Golden State Warriors", "Los Angeles Lakers", "Oklahoma City Thunder", "San Antonio Spurs", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "Keerthika Uthayakumar:OKC has outscored opponents by 437 points this season, the largest differential through the first 25 games of a season in NBA history. 90 points higher than the team with the second-best differential, the 2007-08 Boston Celtics.x.com", "quote": "OKC has outscored opponents by 437 points this season, the largest differential through the first 25 games of a season in NBA history", "outlet": "x.com", "source_url": "https://x.com/keerthikau/status/1998950305871049171", "tags": ["Boston Celtics"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brandon Rahbar:Mark Daigneault says Cason Wallace was ruled out for the game but that the team will check him out tomorrow. Daigneault says he doesn't know what was going on with him.x.com", "quote": "Mark Daigneault says Cason Wallace was ruled out for the game but that the team will check him out tomorrow", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998954316376449384", "tags": ["Oklahoma City Thunder", "Injuries", "Mark Daigneault", "Cason Wallace"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brandon Rahbar: Mark Daigneault on what he's noticed about OKC's 16 game win streak:\"Not focusing on the win streak.\"x.com", "quote": "\"Not focusing on the win streak.\"", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998953075625828848", "tags": ["Oklahoma City Thunder", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brandon Rahbar: Mark Daigneault: \"Anything that happened in the past takes you out of the present moment.Anything that happens in the future takes you out of the present moment.\"x.com", "quote": "Anything that happens in the future takes you out of the present moment.\"", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998953892512698423", "tags": ["Oklahoma City Thunder", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brandon Rahbar: Mark Daigneault on OKC's 24-1 start and historic point differential:\"All of that's great, but none of that matters Saturday.\"x.com", "quote": "\"All of that's great, but none of that matters Saturday.\"", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998953528845545481", "tags": ["Oklahoma City Thunder", "Mark Daigneault"]}, {"date": "", "archive_date": "2025-12-10", "text": "Golden State Warriors guard Stephen Curry returned to practice on Wednesday after missing the last five games because of a left quad contusion. Warriors coach Steve Kerr said Curry went through all of practice and remains hopeful that the 37-year-old guard will be able to return for Friday’s game against the Minnesota Timberwolves.New York Times", "quote": "Golden State Warriors guard Stephen Curry returned to practice on Wednesday after missing the last five games because of a left quad contusion", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6880712/2025/12/10/steph-curry-returns-practice-warriors/", "tags": ["Golden State Warriors", "Minnesota Timberwolves", "Steve Kerr", "Injuries", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-10", "text": "Anthony Slater: De’Anthony Melton has played 21 and 17 minutes in his two games.Steve Kerr said the Warriors will keep him in that range for now and probably rest him one side of back-to-backs, but eventually will let him loose as he gets his conditioning/rhythm back.x.com", "quote": "Steve Kerr said the Warriors will keep him in that range for now and probably rest him one side of back-to-backs, but eventually will let him loose as he gets his conditioning/rhythm back", "outlet": "x.com", "source_url": "https://x.com/anthonyVslater/status/1998943699615752200", "tags": ["Golden State Warriors", "Steve Kerr", "De'Anthony Melton"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jack Maloney: asked kyle kuzma about this report today after practice his response:\"i don't really remember a time he met with us. he didn't sit us down like the apprentice. it didn't go down like that\"x.com", "quote": "\"i don't really remember a time he met with us. he didn't sit us down like the apprentice. it didn't go down like that\"", "outlet": "x.com", "source_url": "https://x.com/jackmaloneycbs/status/1998857758201045092", "tags": ["Milwaukee Bucks", "Giannis Antetokounmpo", "Kyle Kuzma"]}, {"date": "", "archive_date": "2025-12-10", "text": "Duane Rankin: Suns injury update;Devin Booker (groin) OUT.#Sunsx.com", "quote": "Devin Booker (groin) OUT.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/1998889870501241154", "tags": ["Phoenix Suns", "Injuries", "Devin Booker", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "Law Murray:Jordan Miller (hamstring, back) will be available to return tomorrow when the LA Clippers visit the Houston Rocketsx.com", "quote": "Jordan Miller (hamstring, back) will be available to return tomorrow when the LA Clippers visit the Houston Rockets", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1998894125094154322", "tags": ["Houston Rockets", "Los Angeles Clippers", "Injuries", "Jordan Miller"]}, {"date": "", "archive_date": "2025-12-10", "text": "Trail Blazers PR: (2/2):QUESTIONABLERobert Williams III (Illness) Yang Hansen (Face Contusion)x.com", "quote": "QUESTIONABLE", "outlet": "x.com", "source_url": "https://x.com/TrailBlazersPR/status/1998888769345433764", "tags": ["Portland Trail Blazers", "Injuries", "Robert Williams", "Robert Williams III", "Yang Hansen"]}, {"date": "", "archive_date": "2025-12-10", "text": "Eric Nehm:Here is the Bucks' injury report for Thursday's game vs. Boston:Out: Alex Antetokounmpo, Mark Sears (G League - Two-Way) Giannis Antetokounmpo (right calf strain) Taurean Prince (neck surgery) Questionable: AJ Green (left AC joint sprain)x.com", "quote": "Here is the Bucks' injury report for Thursday's game vs. Boston:", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/1998887556709233003", "tags": ["Boston Celtics", "Milwaukee Bucks", "G League", "Injuries", "Giannis Antetokounmpo", "Taurean Prince", "Alex Antetokounmpo", "AJ Green", "Mark Sears"]}, {"date": "", "archive_date": "2025-12-10", "text": "With Jayson Tatum already back to playing one-on-one after tearing his right Achilles tendon in May, Boston Celtics head coach Joe Mazzulla was asked Wednesday when the team will begin conversations about the All-Star’s potential return.“It’s all up to him,” Mazzulla said after his team’s practice.“At the end of the day, his health is the most important thing, his process is the most important thing. You trust him, trust the team that’s around him — he’s got a great team — and then you just kind of go from there. So it kind of just all starts (with) where him and his team think he’s at.”New York Times", "quote": "“It’s all up to him,” Mazzulla said after his team’s practice.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6879162/2025/12/10/jayson-tatum-return-joe-mazzulla/", "tags": ["Boston Celtics", "Jayson Tatum", "Joe Mazzulla"]}, {"date": "", "archive_date": "2025-12-10", "text": "For Hukporti, every second is an opportunity — and on a team stacked with shooters and scorers, his path to staying on the floor is simple: remain fully locked in on defense.“I feel like that’s why I’m here: to play defense,” Hukporti told The News.“Being a defensive anchor. Being there for my teammates… just doing my job. I feel like everyone has their specific role, and I feel like I’m a fantastic player in my own role. So I’m trying to embrace it and I’m trying to bring that every day.”New York Daily News", "quote": "“I feel like that’s why I’m here: to play defense,” Hukporti told The News.", "outlet": "New York Daily News", "source_url": "https://www.nydailynews.com/2025/12/09/ariel-hukporti-knicks-mike-brown/", "tags": ["New York Knicks", "Ariel Hukporti"]}, {"date": "", "archive_date": "2025-12-10", "text": "New Orleans Pelicans:Jordan Poole (left quad strain) is questionable for Thursday's game vs Portland#Pelicans | @MorrisBartLLCx.com", "quote": "Jordan Poole (left quad strain) is questionable for Thursday's game vs Portland", "outlet": "x.com", "source_url": "https://x.com/PelicansNBA/status/1998869267589026173", "tags": ["New Orleans Pelicans", "Portland Trail Blazers", "Injuries", "Jordan Poole"]}, {"date": "", "archive_date": "2025-12-10", "text": "First, know that Kessler’s shoulder has been an ongoing issue for him. “I’ve had a posterior labrum tear on my left shoulder since Auburn. I think the Tennessee game, I tore it and just kind of tried to play through and strengthen it,” Kessler said.“The doctor explained it ... there’s no amount of strength that’ll keep it from slipping out again and again. So he told me, ‘You got to have the surgery.’”Salt Lake Tribune", "quote": "“The doctor explained it ... there’s no amount of strength that’ll keep it from slipping out again and again. So he told me, ‘You got to have the surgery.’”", "outlet": "Salt Lake Tribune", "source_url": "https://www.sltrib.com/sports/jazz/2025/12/09/utah-jazz-coach-will-hardy-goes/", "tags": ["Utah Jazz", "Injuries", "Walker Kessler"]}, {"date": "", "archive_date": "2025-12-10", "text": "Marc Stein: The Lakers will play host tonight to San Antonio on the @NBAonPrime on their standard floor again as opposed to their NBA Cup floor, which was sent in for repairs before the last group game.Maxi Kleber, though, has been ruled out for the NBA Cup quarterfinal against the Spurs.x.com", "quote": "Maxi Kleber, though, has been ruled out for the NBA Cup quarterfinal against the Spurs", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/1998885588406251961", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "Injuries", "Maxi Kleber", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "“We are only 5 1/2 games away from the third seed, so I don’t think it’s time to panic personally; I think it’s time to be aware,” Turner said.“I think being aware and panicking are two very different things. Just aware that we’re not where we want to be, but we’re also not far away. “With the group we have right now, I think that we’re very capable of making an extra push. But we can talk about it all we want to; it’s a matter of going out there and getting it done.”New York Times", "quote": "“We are only 5 1/2 games away from the third seed, so I don’t think it’s time to panic personally; I think it’s time to be aware,” Turner said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6876971/2025/12/10/bucks-offensive-players-kevin-porter-myles-turner-giannis/", "tags": ["Milwaukee Bucks", "Myles Turner"]}, {"date": "", "archive_date": "2025-12-10", "text": "Eric Nehm: Following today's practice, Kevin Porter Jr. was asked about the latest batch of reporting about Giannis Antetokounmpo and the Bucks on Tuesday. Porter: \"This is the last thing I'm going to say on false information.At the end of the day, everyone needs to wait until Giannis says something because all this is just he say, she say and I guarantee when we start winning and we go 8-0, 9-0, you won't see nothing about the Bucks.You won't see, 'Oh, the Bucks are 8-0, 9-0, they're flourishing and Giannis is...\" We're not going to see any of that positive news, so at least for me, this is the last time I'm going to answer anything false.\"x.com", "quote": "At the end of the day, everyone needs to wait until Giannis says something because all this is just he say, she say and I guarantee when we start winning and we go 8-0, 9-0, you won't see nothing about the Bucks.", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/1998853010454360330?s=20", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo", "Kevin Porter"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jon Krawczynski:Important clarification on Rudy Gobert's flagrant foul points (he is 1 away from a suspension, 2 away from a two-game suspension):The points DO reset for the playoffs. So once they get there, it will go back to 0, per the NBA.x.com", "quote": "Important clarification on Rudy Gobert's flagrant foul points (he is 1 away from a suspension, 2 away from a two-game suspension):", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1998862500239126997", "tags": ["Minnesota Timberwolves", "Rudy Gobert", "Suspensions"]}, {"date": "", "archive_date": "2025-12-10", "text": "Batum and Atkinson’s relationship has extended beyond just the NBA. Both grew close during their time together out west, and they reconnected last summer at the 2024 Paris Olympics on the same sidelines with Équipe de France de basketball.“We ended up on the national team because we never stopped talking about it, and he ended up with us, and that was great,” Batum said. “French guys, they all play,” Atkinson said. “They play for their national team, and that's not every country. A lot of the other countries, guys sit out. The French guys play, and he was our captain with Team France.”Responsible Gaming", "quote": "“We ended up on the national team because we never stopped talking about it, and he ended up with us, and that was great,” Batum said", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/batum-credits-longevity-to-adaptability-praises-chris-paul", "tags": ["Cleveland Cavaliers", "Los Angeles Clippers", "Nicolas Batum", "Kenny Atkinson"]}, {"date": "", "archive_date": "2025-12-10", "text": "“He's one of my favorites of all time,” Lue added.“He's right up there with Delly (Matthew Dellavedova). Just guys all for the team, whatever you need, no problem.Great in the locker room, great with the younger guys. It's never about him. It's always about the team and whatever we need. He's unbelievable.”Responsible Gaming", "quote": "“He's right up there with Delly (Matthew Dellavedova). Just guys all for the team, whatever you need, no problem.", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/batum-credits-longevity-to-adaptability-praises-chris-paul", "tags": ["Los Angeles Clippers", "Tyronn Lue", "Nicolas Batum", "Matthew Dellavedova"]}, {"date": "", "archive_date": "2025-12-10", "text": "Khobi Price:Rui Hachimura thinks he bought a car with the $500K Lakers players received after winning the inaugural NBA Cup two years ago. Said he was originally going to bet all of the prize pool money on black on roulette, but had second thoughts. \"I got scared. I’m not going to lie.”x.com", "quote": "Rui Hachimura thinks he bought a car with the $500K Lakers players received after winning the inaugural NBA Cup two years ago", "outlet": "x.com", "source_url": "https://x.com/khobi_price/status/1998844162888827355", "tags": ["Los Angeles Lakers", "Rui Hachimura", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "Cooper Flagg, who displays more confidence by playing than bragging about himself, simply described his highlight as “just another one of those plays.” Others viewed that viral moment during a recent Mavs win over the Clippers much differently.“That dunk that he had over Ivica Zubac was probably one of the few best dunks that he’s had all year. So you see his potential in being an NBA superstar,” Mavericks guard Klay Thompson said. “Cooper’s upside is limitless. He has every tool to be great.”athlonsports.com", "quote": "“That dunk that he had over Ivica Zubac was probably one of the few best dunks that he’s had all year. So you see his potential in being an NBA superstar,” Mavericks guard Klay Thompson said. “Cooper’s upside is limitless. He has every tool to be great.”", "outlet": "athlonsports.com", "source_url": "https://athlonsports.com/nba/dallas-mavericks/cooper-flagg-already-developing-legitimate-superstar", "tags": ["Dallas Mavericks", "Klay Thompson", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-10", "text": "Flagg produced highlight reels with his high-flying dunks. Yet, he also showed strong fundamentals. Flagg defended both guards and forwards well because of his quickness and strength. Yet, he also thrived because of how he studied personnel. Just over a quarter of the way into his rookie season, the 18-year-old Flagg has displayed those traits consistently with Dallas.“He doesn’t skip a beat,” Mavericks coach Jason Kidd said of Flagg. “He’s only 18 years old. But it seems like he’s been in this league before. He plays the game the right way.”athlonsports.com", "quote": "“He doesn’t skip a beat,” Mavericks coach Jason Kidd said of Flagg. “He’s only 18 years old. But it seems like he’s been in this league before. He plays the game the right way.”", "outlet": "athlonsports.com", "source_url": "https://athlonsports.com/nba/dallas-mavericks/cooper-flagg-already-developing-legitimate-superstar", "tags": ["Dallas Mavericks", "Jason Kidd", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-10", "text": "“He’s done a really good job with staying positive, having a really good outlook on things and taking things game by game,” Flagg’s trainer, Matt MacKenzie, told Athlon Sports.“I’ve been very happy with that. We’ve really just tried to be in his corner and help support him with all of the different things that he’s had to navigate in regard to being a pro.”athlonsports.com", "quote": "“I’ve been very happy with that. We’ve really just tried to be in his corner and help support him with all of the different things that he’s had to navigate in regard to being a pro.”", "outlet": "athlonsports.com", "source_url": "https://athlonsports.com/nba/dallas-mavericks/cooper-flagg-already-developing-legitimate-superstar", "tags": ["Dallas Mavericks", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-10", "text": "Dave McMenamin:LAL will host SAS on their standard court in the NBA Cup quarterfinals, sources told ESPN. Players had issues w/ the slippery surface of the alternate bright yellow Cup court during the group stage. A league source told ESPN the decision was made “out of an abundance of caution”x.com", "quote": "LAL will host SAS on their standard court in the NBA Cup quarterfinals, sources told ESPN. Players had issues w/ the slippery surface of the alternate bright yellow Cup court during the group stage. A league source told ESPN the decision was made “out of an abundance of caution”", "outlet": "x.com", "source_url": "https://x.com/mcten/status/1998857722893316307?s=20", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "Ira Winderman:Pelle Larsson MRI today showed a left ankle sprain, with the team expectation of being out a week or so, but not the worst-case prognosis that had been feared. Heat wit five games over the next two weeks. Response to treatment will determine length of absence.x.com", "quote": "Pelle Larsson MRI today showed a left ankle sprain, with the team expectation of being out a week or so, but not the worst-case prognosis that had been feared. Heat wit five games over the next two weeks. Response to treatment will determine length of absence", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/1998857462020202881?s=20", "tags": ["Miami Heat", "Injuries", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-10", "text": "KC Johnson:Billy Donovan had impassioned defense of Nikola Vucevic today: \"I do think he's invested and committed.\"Said Vucevic unsolicited asked to meet with Donovan after recent loss \"to talk about how he can help the group or how he sees areas of improvement for our team.\"x.com", "quote": "Billy Donovan had impassioned defense of Nikola Vucevic today: \"I do think he's invested and committed.\"", "outlet": "x.com", "source_url": "https://x.com/KCJHoop/status/1998838663447273937?s=20", "tags": ["Chicago Bulls", "Nikola Vucevic", "Billy Donovan"]}, {"date": "", "archive_date": "2025-12-10", "text": "Joel Lorenzi: Billy Donovan went long today:“People wanna sit there and say, ‘Well, you lost to New Orleans. They got a bad a record.’ Indiana, bad record. I don’t think we’re any different from those teams. We’re not just gifted to walk in there (and) if we show up, we’ll win games. … I do not view it that way at all when I watch tape.”x.com", "quote": "“People wanna sit there and say, ‘Well, you lost to New Orleans. They got a bad a record.’ Indiana, bad record. I don’t think we’re any different from those teams. We’re not just gifted to walk in there (and) if we show up, we’ll win games. … I do not view it that way at all when I watch tape.”", "outlet": "x.com", "source_url": "https://x.com/JoelXLorenzi/status/1998835147454742805?s=20", "tags": ["Chicago Bulls", "Indiana Pacers", "New Orleans Pelicans", "Billy Donovan"]}, {"date": "", "archive_date": "2025-12-10", "text": "Joel Lorenzi: Donovan on Bulls’ inability to uphold their playstyle through recent skid:“I’m not looking at film saying, ‘Oh, Kevin Huerter’s out, Zach Collins is out. Boy, if HE was here, this would be different.’ I don’t believe that. Some of it’s, like, inbounding the basketball. What do these guys being out have to do with that? What is five guys running back in transition, talking and communicating, have to do with anybody being out?”x.com", "quote": "“I’m not looking at film saying, ‘Oh, Kevin Huerter’s out, Zach Collins is out. Boy, if HE was here, this would be different.’ I don’t believe that. Some of it’s, like, inbounding the basketball. What do these guys being out have to do with that? What is five guys running back in transition, talking and communicating, have to do with anybody being out?”", "outlet": "x.com", "source_url": "https://x.com/JoelXLorenzi/status/1998836936295805219?s=20", "tags": ["Chicago Bulls", "Billy Donovan", "Zach Collins", "Kevin Huerter"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jon Krawczynski:Rudy Gobert on the Flagrant-2: \"Very surprised because I don’t think there was any intent of getting anybody hurt. There was an intent to foul, but I don’t feel like it was meant to really hit him in the rib to hurt him. It was more to take away his momentum and contest the shot.\"x.com", "quote": "Rudy Gobert on the Flagrant-2: \"Very surprised because I don’t think there was any intent of getting anybody hurt. There was an intent to foul, but I don’t feel like it was meant to really hit him in the rib to hurt him. It was more to take away his momentum and contest the shot.\"", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1998837217855225898?s=20", "tags": ["Minnesota Timberwolves", "Referees", "Officiating", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jon Krawczynski: Rudy 1 pt away from suspension:\"I’ve never, not once in my life, intended to get anybody injured with the way I play. I’m going to keep being who I am, do what I’m supposed to do for my team and do it with integrity, which is what I’ve always done throughout my whole career.\"x.com", "quote": "\"I’ve never, not once in my life, intended to get anybody injured with the way I play. I’m going to keep being who I am, do what I’m supposed to do for my team and do it with integrity, which is what I’ve always done throughout my whole career.\"", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1998838102878490649?s=20", "tags": ["Minnesota Timberwolves", "Referees", "Officiating", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-10", "text": "For card collectors, a lot is at stake with Panini’s lawsuit against Fanatics. The case could determine which entities will shape the future of the sports card industry. Panini is asking a U.S. District Court to divest all league licenses, as well as Topps (the Topps portion has been dismissed in court), from Fanatics to “restore competition” within the industry. If a verdict goes in Panini’s favor, this could place all of Fanatics’ sports licenses back up for sale.Asked for comment, Panini referred The Athletic to Stuart Singer, the company’s legal counsel in the Fanatics litigation. Singer confirmed Panini was potentially open to a sale, saying: “Panini, like other companies, considers its strategic options. There is no agreement in place for sale at the company. No negotiations presently for the sale of the company.”New York Times", "quote": "Asked for comment, Panini referred The Athletic to Stuart Singer, the company’s legal counsel in the Fanatics litigation. Singer confirmed Panini was potentially open to a sale, saying: “Panini, like other companies, considers its strategic options. There is no agreement in place for sale at the company. No negotiations presently for the sale of the company.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6862085/2025/12/09/sports-trading-cards-panini-fanatics/", "tags": ["Law", "Trading Cards"]}, {"date": "", "archive_date": "2025-12-10", "text": "Statements made by Panini inside a private sales pitch meeting, as well as within a 90-page confidential document given to potential buyers earlier this year and seen by The Athletic, raise questions about Panini’s court claims that the company would be seriously harmed without NFL, NBA and other top league licenses — the key to allowing team names and logos to appear on sports cards.In its ongoing lawsuit against Fanatics, Panini claims that “any firm that fails to win the rights to produce and sell trading cards for players of at least one of the Leagues (MLB, NFL, NBA) is eliminated as a competitor” in those markets.New York Times", "quote": "In its ongoing lawsuit against Fanatics, Panini claims that “any firm that fails to win the rights to produce and sell trading cards for players of at least one of the Leagues (MLB, NFL, NBA) is eliminated as a competitor” in those markets", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6862085/2025/12/09/sports-trading-cards-panini-fanatics/", "tags": ["Law", "Trading Cards"]}, {"date": "", "archive_date": "2025-12-10", "text": "In my Copycat Candidates ranking, I had the Bucks near the top of the league in potential to go with a double-big lineup as Giannis Antetokounmpo and Myles Turner netted out as the second best big pairing, only behind Denver’s Nikola Jokić and Jonas Valančiūnas. While Jokić and Valančiūnas rarely play together (as I’ll get to in the Western Conference lineup breakdown next week),Doc Rivers has leaned into double-big play. Outside of a stretch of six games midway through the season-to-date, almost all of Giannis and Turner’s minutes have been played together. That strategy is working - the Bucks outscore their opponents by 9.4 points per 100 possessions with their two bigs on the court. The problem is, that’s mostly Giannis. The Bucks are still +4.9 when Giannis plays without Turner, but they are significantly negative whenever Giannis sits, regardless of what Turner is doing. So far, when Giannis misses games the Bucks are 1-6.Charting Hoops", "quote": "In my Copycat Candidates ranking, I had the Bucks near the top of the league in potential to go with a double-big lineup as Giannis Antetokounmpo and Myles Turner netted out as the second best big pairing, only behind Denver’s Nikola Jokić and Jonas Valančiūnas. While Jokić and Valančiūnas rarely play together (as I’ll get to in the Western Conference lineup breakdown next week),", "outlet": "Charting Hoops", "source_url": "https://chartinghoops.substack.com/p/nba-lineup-patterns-the-east", "tags": ["Denver Nuggets", "Milwaukee Bucks", "Doc Rivers", "Giannis Antetokounmpo", "Myles Turner"]}, {"date": "", "archive_date": "2025-12-10", "text": "The Detroit Pistons, on the other hand, are almost too deep (they may be in the market to make a consolidation trade for Giannis to fix that “problem”). There is a lot of orange and yellow all the way down the Pistons’ heatmap, to Paul Reed, who, as Max Moacanin recently pointed out, is sneakily one of the most efficient players in the entire league.That allows the Pistons to employ a soothingly symmetrical rotation pattern for their starters. Notice how J.B. Bickerstaff staggers his first and final rotations, subbing out Thompson first, then Harris, Robinson, Duren, and finally Cade Cunningham. The pattern repeats itself in reverse in the fourth quarter, as Cade checks back in first among the starters, followed in order by Robinson, Harris, Duren, and Thompson.Charting Hoops", "quote": "That allows the Pistons to employ a soothingly symmetrical rotation pattern for their starters. Notice how J.B. Bickerstaff staggers his first and final rotations, subbing out Thompson first, then Harris, Robinson, Duren, and finally Cade Cunningham. The pattern repeats itself in reverse in the fourth quarter, as Cade checks back in first among the starters, followed in order by Robinson, Harris, Duren, and Thompson", "outlet": "Charting Hoops", "source_url": "https://chartinghoops.substack.com/p/nba-lineup-patterns-the-east", "tags": ["Detroit Pistons", "Miami Heat", "Milwaukee Bucks", "Giannis Antetokounmpo", "Paul Reed", "Cade Cunningham"]}, {"date": "", "archive_date": "2025-12-10", "text": "Sebastian Telfair:I just had this up and down period over the last couple of years with going through my situations where I kind of blamed basketball. It took me five, six years to get back to even touching a basketball. It's definitely was some time where I ain't even want to be around a basketball, watch basketball, or definitely shoot a basketball.I was just basically blaming basketball and everything. Like, if I wasn't a basketball player, like I wouldn't be going through this, which is immature, but there's definitely some truth to it. But that's where I'm at today still. I thought I'd be get out of that space, but going back into federal court through my probation right now is like putting me right back in the same space a little bit.YouTube", "quote": "I just had this up and down period over the last couple of years with going through my situations where I kind of blamed basketball. It took me five, six years to get back to even touching a basketball. It's definitely was some time where I ain't even want to be around a basketball, watch basketball, or definitely shoot a basketball.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=KAqocCNkRyE", "tags": ["Sebastian Telfair"]}, {"date": "", "archive_date": "2025-12-10", "text": "Tim MacMahon:I will also just say as a quick aside, as you're going to the trade machine over the next what is it, a couple of months here, don't bother putting Dylan Harper and Stephon Castle in any trades.And if that means you can't come up with things to get uh some huge blockbuster done for the Spurs, I would say, yeah, that's right. Those guys are going to be in San Antonio, I believe, for a long, long time. I think they've got this generation's version of Duncan, Parker and Ginobili.YouTube", "quote": "I will also just say as a quick aside, as you're going to the trade machine over the next what is it, a couple of months here, don't bother putting Dylan Harper and Stephon Castle in any trades.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WYI0uZvmWEs&t=2382s", "tags": ["San Antonio Spurs", "Trade", "Stephon Castle", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-10", "text": "Tim MacMahon:My biggest criticism, frankly, of the Suns since the end of last season, they should have pounced on the deal from the New Orleans Pelicans. The Pelicans were calling every team about Derik Queen trying to move up. For the Suns to be able to get another star, that's the kind of trade that they probably have to make. But again, all their goals entering the season that the Suns are well on their way to accomplishing.YouTube", "quote": "My biggest criticism, frankly, of the Suns since the end of last season, they should have pounced on the deal from the New Orleans Pelicans. The Pelicans were calling every team about Derik Queen trying to move up. For the Suns to be able to get another star, that's the kind of trade that they probably have to make. But again, all their goals entering the season that the Suns are well on their way to accomplishing", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WYI0uZvmWEs&t=2176s", "tags": ["New Orleans Pelicans", "Phoenix Suns", "Trade"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brian Windhorst:I mentioned Mikal Bridges. A lot of people talk about the trade. I get it. Not everybody loved that extension that he signed over the summer, even though I think the Knicks were pretty happy to get him at that number. He's having an excellent season.He's shooting his highest I think in four or five years, shooting over 40% from three, 41% from three going into tonight, averaging more than a block a game and two steals a game. His plus minus has just routinely been really good.YouTube", "quote": "I mentioned Mikal Bridges. A lot of people talk about the trade. I get it. Not everybody loved that extension that he signed over the summer, even though I think the Knicks were pretty happy to get him at that number. He's having an excellent season.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WYI0uZvmWEs&t=482s", "tags": ["New York Knicks", "Mikal Bridges"]}, {"date": "", "archive_date": "2025-12-10", "text": "Danny Green:If I'm Giannis Antetokounmpo, I'm looking where I can extend my career and will play the longest and also win. He should really be taking San Antonio into consideration. If he's alongside Wemby and company, they have a lot of pieces and picks to be able to do it. I know Miami is one of the teams that's looking to get him.It's a good city where kind of fair on the State taxes, so you're going to save more of your money there. And it's a major market. I know Toronto is another good city for him that would fit. And some people play with the idea which I would hate to see this, but they could do it. I mean, OKC could do it. They have everybody's picks. They have a lot of pieces. It would make them an unbelievable super team, but nobody wants to see the Durant-Warriors thing all over again. I would think for him like to make his own or have his own path and not just jump on a championship team. He should be considering like San Antonio, Miami, Toronto, like those three teams could be and also Detroit, him and Cade Cunningham could be a nice little mix if they can keep Jalen Duren.YouTube", "quote": "If I'm Giannis Antetokounmpo, I'm looking where I can extend my career and will play the longest and also win. He should really be taking San Antonio into consideration. If he's alongside Wemby and company, they have a lot of pieces and picks to be able to do it. I know Miami is one of the teams that's looking to get him.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=r0vpUsfozJA", "tags": ["Detroit Pistons", "Golden State Warriors", "Miami Heat", "Milwaukee Bucks", "San Antonio Spurs", "Toronto Raptors", "Trade", "Danny Green", "Giannis Antetokounmpo", "Cade Cunningham", "Jalen Duren"]}, {"date": "", "archive_date": "2025-12-10", "text": "Moritz Wagner:I'm very privileged, of course. Yes, well, we have a lot of money. We lack nothing. And when I preach this on this topic, I understand that 80% of the people listening probably think, \"Well, it's easy for him to say that.\"That's what I would think if I were to listen to myself right now. That's why I always shy away from this topic a little . But here I am being completely honest, this falls under the category of how people fool themselves. The thing about money and this constant need for more and more, there are also huge cultural differences. Well, that's even more prevalent in America. I was in Brazil once and a friend of mine tried to work in Rio de Janeiro, and he told me back then that nobody in South America wants to work at all. For them, a successful day is when they do their push-ups on the beach and then afterwards, have a beer and a steak on the beach and sleep well at 4 a.m., and then the same routine starts again at 11 a.m. So, of course there's also a cultural difference, but this constant \"more and more ,\" this money issue, I think what you shouldn't forget is that I want to live my life, no matter how much money I ever make, money is a means to an end for me.YouTube", "quote": "I'm very privileged, of course. Yes, well, we have a lot of money. We lack nothing. And when I preach this on this topic, I understand that 80% of the people listening probably think, \"Well, it's easy for him to say that.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=O4d-61eKhaA", "tags": ["Orlando Magic", "Moritz Wagner"]}, {"date": "", "archive_date": "2025-12-10", "text": "Shams Charania:Dallas Mavericks center Dereck Lively II will undergo season-ending right foot procedure to address lingering discomfort,sources tell me and Tim MacMahon. Lively, who played 7 games this season, is expected to make a full recovery.x.com", "quote": "Dallas Mavericks center Dereck Lively II will undergo season-ending right foot procedure to address lingering discomfort,", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/1998799884321960239?s=20", "tags": ["Dallas Mavericks", "Injuries", "Dereck Lively"]}, {"date": "", "archive_date": "2025-12-10", "text": "Tim MacMahon:Dereck Lively II is out for the season. He got second and third opinions to attempt to avoid surgery, but he needs another operation to repair his right foot.x.com", "quote": "Dereck Lively II is out for the season. He got second and third opinions to attempt to avoid surgery, but he needs another operation to repair his right foot", "outlet": "x.com", "source_url": "https://x.com/BannedMacMahon/status/1998800542227984630?s=20", "tags": ["Dallas Mavericks", "Injuries", "Dereck Lively"]}, {"date": "", "archive_date": "2025-12-10", "text": "THE OPEN INVITATION quickly turned into an expectation during Chris Paul's only season on the Oklahoma City Thunder roster. On off nights when the Thunder were home, the team's players were all welcome at Paul's place, where the future Hall of Famer lived alone while his family stayed in Los Angeles that 2019-20 season. His chef would prepare a healthy and hearty dinner -- vegan for Paul and other options for his guests -- and the players would eat and watch that night's NBA action. Those nights became routine for a few of the Thunder's youngest players, including promising second-year guard Shai Gilgeous-Alexander and raw, undrafted rookie Luguentz Dort, the only two players remaining on Oklahoma City's roster from that season. They'd settle into the couches, viewing one game on the big screen and another on Paul's iPad, and soak up the wisdom of one of this generation's smartest basketball minds.\"We'd just be chilling,\" Gilgeous-Alexander told ESPN recently. \"But how we used to watch the games, he was never, like, just watching them. He was always watching 'em to learn.\"ESPN", "quote": "\"We'd just be chilling,\" Gilgeous-Alexander told ESPN recently. \"But how we used to watch the games, he was never, like, just watching them. He was always watching 'em to learn.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "Paul also watched the games to teach. He would constantly engage his regular guests -- a group that also included then-rookie forward Darius Bazley -- in basketball banter. They'd talk about the tendencies of players they were watching. Paul would frequently focus on specific actions teams would run and discuss defensive tactics the Thunder might use against those schemes.\"It was nothing crazy, to tell you the truth,\" Paul told ESPN. \"It was more so just camaraderie.\"ESPN", "quote": "\"It was nothing crazy, to tell you the truth,\" Paul told ESPN. \"It was more so just camaraderie.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Darius Bazley", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "But it was embraced and appreciated in Oklahoma City, where Paul helped plant some seeds that are blossoming into a potential dynasty several years later. Lessons learned from Paul have played small roles in Gilgeous-Alexander ascending into an MVP and Dort developing into one of the league's premier 3-and-D role players. Habits instilled by following Paul's lead became part of the franchise's fabric during the Thunder's journey from a rebuilding project to a champion.\"Chris really was the first person to show me what it meant to be a professional,\" Gilgeous-Alexander said. \"He was always doing extra. It was more so off the court than on the court. It was the things you don't think about as a kid. As a kid, you're taught to just work super hard, but you're not really taught nutrition and taking care of your body, getting massages, getting treatment, those type of things he was always on top of. \"He just always had a get-better mentality in every way, in every way of life.\"ESPN", "quote": "\"Chris really was the first person to show me what it meant to be a professional,\" Gilgeous-Alexander said. \"He was always doing extra. It was more so off the court than on the court. It was the things you don't think about as a kid. As a kid, you're taught to just work super hard, but you're not really taught nutrition and taking care of your body, getting massages, getting treatment, those type of things he was always on top of", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years. Paul made sure that Dort had access to Second Spectrum, a subscription service used by NBA teams, and tutored him on how to filter clips by using specific searches by play categories or statistics. And Paul often watched film with Dort, pointing out nuances he should notice and advising him on how to take notes.\"Being CP3's rook, honestly, it was amazing, especially in the position that I was in on a two-way,\" Dort told ESPN. \"Obviously, Chris is Chris, and me coming out of college, I see Chris as a big superstar. So at first we didn't have that many conversations, but as I got more with the team, we got closer and I could see what type of guy Chris really was. And he was a great dude, honestly. Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years.Paul made sure that Dort had access to Second Spectrum, a subscription service used by NBA teams, and tutored him on how to filter clips by using specific searches by play categories or statistics. And Paul often watched film with Dort, pointing out nuances he should notice and advising him on how to take notes. \"He taught me a lot, a real leader, real vocal on the court. \"ESPN", "quote": "\"Being CP3's rook, honestly, it was amazing, especially in the position that I was in on a two-way,\" Dort told ESPN. \"Obviously, Chris is Chris, and me coming out of college, I see Chris as a big superstar. So at first we didn't have that many conversations, but as I got more with the team, we got closer and I could see what type of guy Chris really was. And he was a great dude, honestly. Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "Anthony Chiang:The Heat has posted the league's 29th-ranked (second-worst) offensive rating during this four-game skid.x.com", "quote": "The Heat has posted the league's 29th-ranked (second-worst) offensive rating during this four-game skid", "outlet": "x.com", "source_url": "https://x.com/Anthony_Chiang/status/1998789700702855551", "tags": ["Miami Heat", "Statistics"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brian Jungreis, Malik Beasley’s agent, tells Front Office Sports that there have been talks with the European club, but the two sides are far from securing a deal.“These are exaggerated reports. We had conversations and some framework, but nowhere close to anything closing or happening for the moment,” Jungreis tells FOS.Front Office Sports", "quote": "Brian Jungreis, Malik Beasley’s agent, tells Front Office Sports that there have been talks with the European club, but the two sides are far from securing a deal.", "outlet": "Front Office Sports", "source_url": "https://frontofficesports.com/malik-beasleys-agent-calls-euroleague-report-exaggerated/", "tags": ["Free Agency", "Euroleague", "Serbia", "Malik Beasley"]}, {"date": "", "archive_date": "2025-12-10", "text": "He also shot down the idea that Beasley would sign an overseas contract without an option to return to the NBA.“The report of no NBA out is 100% inaccurate. We’d never not have that in the case he were to play anywhere else than the NBA,” Jungreis said. In a video posted on social media last month, Beasley admitted that he could play overseas, but has continued to wait for an NBA opportunity.Front Office Sports", "quote": "“The report of no NBA out is 100% inaccurate. We’d never not have that in the case he were to play anywhere else than the NBA,” Jungreis said", "outlet": "Front Office Sports", "source_url": "https://frontofficesports.com/malik-beasleys-agent-calls-euroleague-report-exaggerated/", "tags": ["Free Agency", "Euroleague", "Serbia", "Malik Beasley"]}, {"date": "", "archive_date": "2025-12-10", "text": "Eurohoops:??️ Malik Beasley said he’s not going to Serbia despite the rumours that he's nearing a deal with Partizan.Instagram", "quote": "??️ Malik Beasley said he’s not going to Serbia despite the rumours that he's nearing a deal with Partizan.", "outlet": "Instagram", "source_url": "https://www.instagram.com/p/DSCOhM5iCFD/?img_index=2", "tags": ["Free Agency", "Euroleague", "Serbia", "Malik Beasley"]}, {"date": "", "archive_date": "2025-12-10", "text": "Derik Queen hears what people are saying about him and the trade that still surprises the NBA. \"I've been [hearing] it all my life,\" Queen said. \"Like everybody hated me [before the season started]. I played a little bit at the beginning, and the whole media was hating me.And then once I got to that Charlotte game [and had 12 points, eight rebounds and seven assists on Nov. 4], the whole media started liking me. \"[I'm used to] pretty much people not liking me at one moment, then liking me later on in life.\"ESPN", "quote": "And then once I got to that Charlotte game [and had 12 points, eight rebounds and seven assists on Nov. 4], the whole media started liking me. \"[I'm used to] pretty much people not liking me at one moment, then liking me later on in life.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47190959/new-orleans-pelicans-derik-queen-jeremiah-fears-zion-williamson-willie-green", "tags": ["New Orleans Pelicans", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-10", "text": "\"We looked at the lottery this year and said, 'Wow, it'd be great if we could get both of those guys, and it may cost us,'\" Dumars said. \"But if you truly believe they can be foundational pieces for your success long term, then we'll do what we have to do. It simply came down to we have this guard that we really, really love and this young big that we really, really love. Let's go for it. \"I know we paid a big price for it, but it's not like we're unhappy with what we got. We like what we have as foundational pieces for the long term here.\"Through the first 25 games, Fears and Queen have combined to score the fourth-most points by any rookie duo in the past 15 seasons, according to Elias Sports Bureau. \"We're only Year 1 into this,\" Fears told ESPN. \"We got a lot more to go. But we going to continue to show everybody we have something special in New Orleans.\"ESPN", "quote": "Through the first 25 games, Fears and Queen have combined to score the fourth-most points by any rookie duo in the past 15 seasons, according to Elias Sports Bureau. \"We're only Year 1 into this,\" Fears told ESPN. \"We got a lot more to go. But we going to continue to show everybody we have something special in New Orleans.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47190959/new-orleans-pelicans-derik-queen-jeremiah-fears-zion-williamson-willie-green", "tags": ["New Orleans Pelicans", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-10", "text": "\"We had a conversation about this in our coaches meeting this morning,\" Raptors head coach Darko Rajaković said before the Raptors and Knicks faced off in New York late last month. \"Jalen Brunson is the type of player I can put in the same conversations as Luka Dončić and Nikola Jokić. They’re guys who just play at their own pace. You can’t speed them up. Their awareness is amazing. At every point in time, they know where the hand of the defensive player is, what is the footwork, how they can get by somebody, how they can get to their sweet spots on the floor. … He’s elite.\"Just like you said, he’s not the fastest, not the strongest, but his skill level and shooting ability is amazing. It makes him one of the biggest offensive weapons in the league.\"New York Times", "quote": "\"Just like you said, he’s not the fastest, not the strongest, but his skill level and shooting ability is amazing. It makes him one of the biggest offensive weapons in the league.\"", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6877787/2025/12/10/knicks-raptors-jalen-brunson-nba-cup-quarterfinals/", "tags": ["New York Knicks", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-10", "text": "“The versatility, Shai Gilgeous-Alexander — the versatility of these guys is what allows us to be really, really, broad in what we do,” Daigneault said. “And we try to take advantage of that. We try not to be very rigid. So, we’re learning all those things, remaining unpredictable.” The Thunder have a long way to go towards maintaining this impressive start defensively, but there are reasons to believe Oklahoma City’s defensive success can become even more historic.The Thunder could become the first post-ABA merger team (since 1976-77) to be 10 points per 100 possessions better defensively than the league average.Per Basketball Reference, the NBA leaguewide offensive efficiency rating is 115.8 points per 100 possessions, 0.5 points higher than the record-high set in the 2023-24 season.New York Times", "quote": "The Thunder could become the first post-ABA merger team (since 1976-77) to be 10 points per 100 possessions better defensively than the league average.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6873581/2025/12/10/thunder-defense-nba-shai-gilgeous-alexander/", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-10", "text": "Of course, the Thunder are No. 1. How could they not be, after rolling through the league with 68 regular-season wins and a historic victory margin to win their first championship and still having a cupboard full of draft assets and one of the youngest rosters in the league going forward? Have I mentioned that it’s possible they could win the championship and draft lottery in 2026?“The best-ever job of acquiring future assets while dominating in the present,” said one voter. “Usually, those two are a little exclusive when you’re talking about championship-level teams. Sam Presti is just the preeminent GM in the league.”The Thunder also have one of the largest staffs in the league and have filled their front office with clever people from different backgrounds. — John HollingerNew York Times", "quote": "“The best-ever job of acquiring future assets while dominating in the present,” said one voter. “Usually, those two are a little exclusive when you’re talking about championship-level teams. Sam Presti is just the preeminent GM in the league.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Oklahoma City Thunder", "Sam Presti"]}, {"date": "", "archive_date": "2025-12-10", "text": "“Besides Sam being really good at his job, he has people like (vice presidents of basketball operations) Jesse Gould and Wynn Sullivan that are excellent at what they do as well,” said another voter.“Those guys handle the strategy portion of things and set the path for the future. They do a great job of being forward-thinking and not just trying to copy people.” — John HollingerNew York Times", "quote": "“Besides Sam being really good at his job, he has people like (vice presidents of basketball operations) Jesse Gould and Wynn Sullivan that are excellent at what they do as well,” said another voter.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Oklahoma City Thunder", "Sam Presti"]}, {"date": "", "archive_date": "2025-12-10", "text": "“They have always done a good job with building their team,” said one voter who gave Boston high marks. “They made a difficult decision this offseason, but because of the rules, it was one they had to make. The timing was right with the Tatum injury. I would expect them to be able to turn it around pretty quickly. This year is just a reset for them. I would not expect it to be a long-term thing.” Boston still has to make a tough call on Anfernee Simons, who came from Portland in the Holiday trade. Moving the 26-year-old’s expiring deal could get the Celtics under the first apron by the summer, and turn off the repeater clock. But with all their moves in the offseason, the Celtics are no longer in second-apron hell.“Brad Steven’s integrity and competence carry a heavy load for them,” another voter said of Boston’s front office. — David AldridgeNew York Times", "quote": "“Brad Steven’s integrity and competence carry a heavy load for them,” another voter said of Boston’s front office. — David Aldridge", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Boston Celtics", "Brad Stevens"]}, {"date": "", "archive_date": "2025-12-10", "text": "These latest moves have been additive, with the Rockets having built this post-James Harden era core by way of the draft (Alperen Şengün at No. 16 in 2021, Jabari Smith Jr. third in 2022, Tari Eason 17th in 2022, Amen Thompson fourth in 2023, Reed Sheppard third in 2024). “They have drafted well, built a deep team in a tough Western Conference while managing tax aprons,” said one executive who voted the Rockets second. “(They) hired a good coach and built an overall team identity, then added KD for cheap. “From where they were only a few years ago, they have done a good job turning it around.”Said another, who also voted the Rockets second: “High-end talent, a willingness to be bold, (and) good asset management.” — Sam AmickNew York Times", "quote": "Said another, who also voted the Rockets second: “High-end talent, a willingness to be bold, (and) good asset management.” — Sam Amick", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Houston Rockets", "Jabari Smith", "Amen Thompson", "Tari Eason", "Reed Sheppard"]}, {"date": "", "archive_date": "2025-12-10", "text": "Of course, just because, say, Lakers GM and president of basketball operations Rob Pelinka has been in L.A. since 2019, that doesn’t mean the team is completely the same, especially after a sale.\"No disrespect to the current folks,” the person who voted for the Lakers said, “But what (incoming governor) Mark Walter does with the Lakers front office and the folks with the Dodgers involved is really intriguing. ... That's a sleeping giant.\" — Fred KatzNew York Times", "quote": "\"No disrespect to the current folks,” the person who voted for the Lakers said, “But what (incoming governor) Mark Walter does with the Lakers front office and the folks with the Dodgers involved is really intriguing. ... That's a sleeping giant.\" — Fred Katz", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Los Angeles Lakers", "Rob Pelinka", "Mark Walter"]}, {"date": "", "archive_date": "2025-12-10", "text": "Sam Amick: “And man, Ja — like he was in a good place. Considering how much time we spent talking and writing about the stuff that happened early on in the season when it seemed like he was ready to get out of Memphis and he was frustrated with the coaching staff — you know, what I saw that night was a very different picture where he was obviously hurt, but he's on the bench coaching guys up. Um, literally even engaging with Tuomas Iisalo about stuff, you know, on—on the playboard, um, things like that. So talking to people around the team, you know, Zach Kleiman, their GM, continues to not show much interest, if any, in moving Ja and to tell people that they're trying to push this thing through.Again, you know, it seems like Ja and even his—his camp and his family are—are trying to make it work.”YouTube", "quote": "Again, you know, it seems like Ja and even his—his camp and his family are—are trying to make it work.”", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=SePaYJ4cBxw", "tags": ["Memphis Grizzlies", "Trade", "Ja Morant", "Zach Kleiman", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-10", "text": "Rich Paul:“I think the Milwaukee Bucks have done everything Giannis has asked them to do and deserve the right for Giannis to handle things in a way where they’re not put in a situation where people know he wants out—and so now we get 70 cents on the dollar. There’s a way to be partnerial in exiting. There really is.”Max Kellerman: “And do you think they will form a partnership in order to exit?” Rich Paul: “Well, that takes a number of things. Listen—most athletes have been getting what all their life? Cheered. They never want to be booed. Never. The boo of it all. Going into a front office—they’re so reluctant to go in there and say these things. But it’s business. So, hey—go in. You’ve won a championship. ‘Hey guys, I appreciate everything. I still feel special about the Bucks. You guys have done everything—from, you know, both his brothers on the team. I’m pretty sure they allow him to decide whatever: moves for guys, this and that, stay overnight, and whatever—whatever he wants to do. Which he’s earned the right.’”YouTube", "quote": "“I think the Milwaukee Bucks have done everything Giannis has asked them to do and deserve the right for Giannis to handle things in a way where they’re not put in a situation where people know he wants out—and so now we get 70 cents on the dollar. There’s a way to be partnerial in exiting. There really is.”", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=sokxu0dYIEM&t=2920s", "tags": ["Milwaukee Bucks", "Trade", "Rich Paul", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-10", "text": "However, Amick finds this approach baffling, especially because of how intense the competition in the Western Conference has become. Additionally, with Ballmer still being patient with stars like Leonard, he leaves the team stranded even when the Clippers are losing and are unable to build any chemistry. Amick proclaims this approach to be blatantly “awful.”“Steve Ballmer, man, has got this inexplicable, in my opinion, borderline insane addiction to this group. I don’t understand it because when you talk about Kawhi, the level of scrutiny and distraction which has come from that partnership with Kawhi has been so problematic, but Steve has never wavered,” Amick said on the “Run It Back” show. “They keep rocking with this group, knowing all of their contracts are coming up in a couple of years, and they’ve been looking at the summer of 2027 for quite some time, and it seems like they’re sticking down this road as bad as this is. It’s awful… I don’t see them blowing it up; I see them continue to do stuff around the edges and pull this thing out,” he added.Basketball Network", "quote": "“Steve Ballmer, man, has got this inexplicable, in my opinion, borderline insane addiction to this group. I don’t understand it because when you talk about Kawhi, the level of scrutiny and distraction which has come from that partnership with Kawhi has been so problematic, but Steve has never wavered,” Amick said on the “Run It Back” show", "outlet": "Basketball Network", "source_url": "https://www.basketballnetwork.net/latest-news/steve-ballmer-has-got-this-borderline-insane-addiction-to-this-group", "tags": ["Los Angeles Clippers", "Steve Ballmer", "Kawhi Leonard"]}, {"date": "", "archive_date": "2025-12-10", "text": "[NOTB Podcast]Kenny Beecham reached out to Tyrese Haliburton to ask if star players/free agents care when a franchise “do their players wrong” in response to how the Clippers sent Chris Paul home. Haliburton: “A lot of players just want to get paid.”reddit", "quote": "Kenny Beecham reached out to Tyrese Haliburton to ask if star players/free agents care when a franchise “do their players wrong” in response to how the Clippers sent Chris Paul home. Haliburton: “A lot of players just want to get paid.”", "outlet": "reddit", "source_url": "https://www.reddit.com/r/nba/comments/1picxmp/notb_podcast_kenny_beecham_reached_out_to_tyrese/", "tags": ["Indiana Pacers", "Los Angeles Clippers", "Free Agency", "Chris Paul", "Tyrese Haliburton"]}]