[{"date": "", "archive_date": "2025-12-12", "text": "Matt Guzman: Speaking with ESPN, Victor Wembanyama was asked who the NBA’s best player is:“Jokić is the best offensive player … I don’t think he’s the best player. (It’s) between Giannis (Antetokounmpo) and Shai (Gilgeous-Alexander). “When I come back to the court, it will be me.” #PorVidax.com", "quote": "“Jokić is the best offensive player … I don’t think he’s the best player. (It’s) between Giannis (Antetokounmpo) and Shai (Gilgeous-Alexander)", "outlet": "x.com", "source_url": "https://x.com/mattgzman/status/1999635597913391687", "tags": ["Denver Nuggets", "Milwaukee Bucks", "Oklahoma City Thunder", "San Antonio Spurs", "Giannis Antetokounmpo", "Nikola Jokic", "Shai Gilgeous-Alexander", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-12", "text": "Matt Guzman: #Spurs star Victor Wembanyama on his lengthy recovery process: \"There was no reason to take inconsiderate risk ... I (had) to trust the process a lot.Because it wasn't always painful. It was almost never painful or even uncomfortable.\"#PorVidax.com", "quote": "Because it wasn't always painful. It was almost never painful or even uncomfortable.\"", "outlet": "x.com", "source_url": "https://x.com/mattgzman/status/1999642800401363227", "tags": ["San Antonio Spurs", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-12", "text": "MrBuckBuck: ShaiGilgeous-Alexander on if breaking the 73-win record would mean anything to him: \"Absolutely. Winning matters.\"Via: https://reddit.com/r/nba/comments/1pl8egh/sga_on_if_breaking_the_73win_record_would_mean/…x.com", "quote": "Gilgeous-Alexander on if breaking the 73-win record would mean anything to him: \"Absolutely. Winning matters.\"", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/1999646882373804539", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-12", "text": "What is Ryan Nembhard's situation with going from a two-way to a standard deal with Dallas? Grant Afseth: My understanding is correct. I don't think they can do it until either. I don't remember the exact date. It might be January 6th. I know some people have that as a date.Some people believe it's January 4th, but basically early January is when that salary cap logistics would allow them to convert Ryan Nembhard's contract to a standard deal from a two-way.Youtube", "quote": "Some people believe it's January 4th, but basically early January is when that salary cap logistics would allow them to convert Ryan Nembhard's contract to a standard deal from a two-way", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4", "tags": ["Dallas Mavericks", "Salary Cap", "Ryan Nembhard"]}, {"date": "", "archive_date": "2025-12-12", "text": "Jon Krawczynski:Chris Finch said he didn’t see Edwards’ injury as anything to be concerned about for the long term.I asked him who would start and he declined to say. He did make a nice offer though: “Would you like me to tell you my social security number too, Jon?” As a matter of fact …x.com", "quote": "Chris Finch said he didn’t see Edwards’ injury as anything to be concerned about for the long term.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999655083609370725", "tags": ["Minnesota Timberwolves", "Injuries", "Chris Finch", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-12", "text": "Anthony Slater:Draymond Green will be in Portland on Sunday, per Kerr, back from personal absence.He said foot issue won’t keep him out, but it’ll be up to Rick Celebrini whether to activate Green after 10-day absence or hold him for another game.x.com", "quote": "Draymond Green will be in Portland on Sunday, per Kerr, back from personal absence.", "outlet": "x.com", "source_url": "https://x.com/anthonyVslater/status/1999650615144882179", "tags": ["Golden State Warriors", "Portland Trail Blazers", "Injuries", "Draymond Green", "Rick Celebrini"]}, {"date": "", "archive_date": "2025-12-12", "text": "From your perspective, when you look at Riccardi, Finley, Kidd, is there a preference there with how Dumont would value their opinions? Grant Afseth: I don't know if Jason Kidd's opinions value like clear cut more than everybody else. But I do know from a basketball standpoint, his opinions are valued quite a bit by the ownership group. And I know, Mark Cuban is providing input as well. I don't want to make that sound like Mark Cuban's the GM by any means, or Jason Kidd the GM or whatever. But I just know that while they're getting through this, it's really, really important that the head coach has alignment on what they're doing on the basketball court. So by default, you're going to have to rely on like not only is he respected, but you are by necessity going to have to get through, the season with his input value very heavily.So I think that's, probably, like, I don't want to say like he's clear cut, like more important voice wise than the interim GM, but his basketball input is very heavily valued.Youtube", "quote": "So I think that's, probably, like, I don't want to say like he's clear cut, like more important voice wise than the interim GM, but his basketball input is very heavily valued", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4", "tags": ["Dallas Mavericks", "Jason Kidd", "Mark Cuban", "Michael Finley", "Matt Riccardi"]}, {"date": "", "archive_date": "2025-12-12", "text": "I know you mentioned Patrick Dumont has final say, but is there a clear hierarchy of who runs the team right now? Grant Afseth:But from my understanding I think there's kind of a collection of voices, right now, I think Jason Kidd is somebody that I would definitely look at as someone who has influence on these decisions.Like Patrick Dumont leans on him, like, I think there's, like, almost like, I guess you could say I don't this is a great comparison, but it's almost like a basketball cabinet, if you will, or Council of Multiple Voices.Youtube", "quote": "But from my understanding I think there's kind of a collection of voices, right now, I think Jason Kidd is somebody that I would definitely look at as someone who has influence on these decisions.", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4", "tags": ["Dallas Mavericks", "Jason Kidd", "Mark Cuban", "Matt Riccardi", "Patrick Dumont"]}, {"date": "", "archive_date": "2025-12-12", "text": "The Mavericks’ potential trade candidates have remained consistent — including a willingness to entertain offers for Anthony Davis, Klay Thompson, Daniel Gafford, and D’Angelo Russell — but the team is not aggressively shopping those players, sources told DallasHoopsJournal.com.The internal view is that any deal must clearly improve Dallas’ long-term outlook, whether through added flexibility, future assets, or a cleaner roster fit.Dallas Hoops Journal", "quote": "The internal view is that any deal must clearly improve Dallas’ long-term outlook, whether through added flexibility, future assets, or a cleaner roster fit", "outlet": "Dallas Hoops Journal", "source_url": "https://dallashoopsjournal.com/p/nba-rumors-notebook-early-developments-to-monitor-about-the-dallas-mavericks-and-across-the-league/", "tags": ["Dallas Mavericks", "Trade", "Klay Thompson", "Anthony Davis", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-12", "text": "In contract discussions with the Jazz, Kessler sought upwards of $120 million in total compensation for a long-term contract extension,sources told DallasHoopsJournal.com, but Utah was unwilling to commit to that price range. “There was a clear gap in talks between Kessler and Utah,” one source said.Dallas Hoops Journal", "quote": "In contract discussions with the Jazz, Kessler sought upwards of $120 million in total compensation for a long-term contract extension,", "outlet": "Dallas Hoops Journal", "source_url": "https://dallashoopsjournal.com/p/nba-rumors-notebook-early-developments-to-monitor-about-the-dallas-mavericks-and-across-the-league/", "tags": ["Utah Jazz", "Extensions", "Walker Kessler"]}, {"date": "", "archive_date": "2025-12-12", "text": "Mike Curtis:Jason Kidd began his pregame press conference with a statement on his former teammate Jason Collins, who is battling Stage 4 brain cancer:\"Just want to give a shoutout to Jason Collins. A teammate of mine. A friend of mine. I actually coached him in Brooklyn. Our prayers go out to him & his family. He's going to fight & beat this, just knowing the person he is. Our prayers go out to Big J.\"x.com", "quote": "Jason Kidd began his pregame press conference with a statement on his former teammate Jason Collins, who is battling Stage 4 brain cancer:", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/1999634699241590886", "tags": ["Dallas Mavericks", "Jason Kidd", "Jason Collins"]}, {"date": "", "archive_date": "2025-12-12", "text": "Dan Woike:Lakers say guard Austin Reaves has been diagnosed with a mild left calf strain. Reaveswill be re-evaluated in approximately one week.x.com", "quote": "Lakers say guard Austin Reaves has been diagnosed with a mild left calf strain. Reaves", "outlet": "x.com", "source_url": "https://x.com/DanWoikeSports/status/1999629204921680293", "tags": ["Los Angeles Lakers", "Injuries", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grant Afseth: TheDallas Mavericks have downgraded D’Angelo Russell and Daniel Gafford to out against the Brooklyn Nets.x.com", "quote": "Dallas Mavericks have downgraded D’Angelo Russell and Daniel Gafford to out against the Brooklyn Nets", "outlet": "x.com", "source_url": "https://x.com/GrantAfseth/status/1999627214527300086", "tags": ["Dallas Mavericks", "Brooklyn Nets", "Injuries", "D'Angelo Russell", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grizzlies PR: Status Update:Ja Morant is available tonight against the Utah Jazz.x.com", "quote": "Ja Morant is available tonight against the Utah Jazz", "outlet": "x.com", "source_url": "https://x.com/GrizzliesPR/status/1999624435632873667", "tags": ["Memphis Grizzlies", "Utah Jazz", "Injuries", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-12", "text": "What is your understanding of Kyrie Irving coming back this season? Grant Afseth: Yeah, I think he's been working very hard to have a comeback this season. I think he very much wants to. Obviously the way the team has played out has kind of created uncertainty for what people think could happen. But I do know he's been someone that's worked very hard to make that comeback. He takes a lot of pride in being able to show I'm an elite player coming off this injury. Even like being able to attack it, to come back sooner than someone might think, like, kind of defy the odds, if you will. But it's a complicated general situation because, from that standpoint, because he doesn't want a timeline out there where if it's not met, then you're talking about a setback and then that, like add some distraction area elements to it. I think it's more of like a he's going to attack it, try to come back as soon as possible. But not have that external pressure to where, you know, we're, we're discussing timetables, things of that nature.I've personally like, from my understanding of the situation, have long held like the, the thought that there's optimism of a pre All-Star break return.But that's not ever been like super like that's happening, there's a set guarantee like anything of that nature.Youtube", "quote": "I've personally like, from my understanding of the situation, have long held like the, the thought that there's optimism of a pre All-Star break return.", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Dallas Mavericks", "Kyrie Irving"]}, {"date": "", "archive_date": "2025-12-12", "text": "Does Kyrie Irving have input on the moves they will make? Like did he know of the Luka trade? Grant Afseth: I'm not fully sure on. I don't think he's been included on every move they made by any means. I think when they're like going into offseasons, like some players like, hey, you know, what are some players that you think could help this team like that type of feedback? Not necessarily like a, Hey, we're about to make this move. Do you like it? Or should we call it like that type of thing or.I think it's more like just the general idea of who are some guys that you think could help us. Let's talk about it. And, we can see how that shakes out and help us mold our offseason plan, if you will.Youtube", "quote": "I think it's more like just the general idea of who are some guys that you think could help us. Let's talk about it. And, we can see how that shakes out and help us mold our offseason plan, if you will", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Dallas Mavericks", "Trade", "Kyrie Irving"]}, {"date": "", "archive_date": "2025-12-12", "text": "But obviously with all the noise we know about A.D, do you think a divorce or you know, obviously a trade is inevitable or is that something that could be avoided? Grant Afseth: I think honestly it's fluid depending on what offers come in.My understanding of the sentiment right now, I don't think it's like a we absolutely have to get rid of Anthony Davis, by any means necessary before the deadline hits. I think it's definitely going to be a matter of. Is there a trade offer that comes through that we deem acceptable?And if that is a good trade for us to make to build around Cooper Flagg, then, you know, perhaps pull the trigger, but I think, that's going to be a matter of external factors.Youtube", "quote": "My understanding of the sentiment right now, I don't think it's like a we absolutely have to get rid of Anthony Davis, by any means necessary before the deadline hits. I think it's definitely going to be a matter of. Is there a trade offer that comes through that we deem acceptable?", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Dallas Mavericks", "Trade", "Anthony Davis", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grant Afseth: Shams Charania from ESPN reported a couple of potential Eastern Conference suitors like the Atlanta Hawks, Detroit Pistons, Toronto Raptors. But those teams so far, doesn't seem like there's meaningful traction by any means of a great offer that the Dallas Mavericks cannot refuse.I've been asking around, and there's more skepticism than optimism about Detroit and Atlanta as viable trade destinations. Because of various reasons, like Detroit has it rolling right now. Like, there's, probably a reluctance to break that team up and complicate things chemistry wise with how the season has gone for them. And then Atlanta, they also have to solve Trae Young's future, with their team long-term. So do you go into the offseason where you have to give contract clarity to Trae Young and Anthony Davis? That's where it gets complicated. And they could get a potential top three, even number one overall pick this year where you're adding that next to Jalen Johnson.Youtube", "quote": "I've been asking around, and there's more skepticism than optimism about Detroit and Atlanta as viable trade destinations. Because of various reasons, like Detroit has it rolling right now. Like, there's, probably a reluctance to break that team up and complicate things chemistry wise with how the season has gone for them", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Atlanta Hawks", "Dallas Mavericks", "Detroit Pistons", "Toronto Raptors", "Trade", "Anthony Davis", "Trae Young", "Jalen Johnson"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grant Afseth: TheDallas Mavericks announced that Danté Exum underwent successful right knee surgery.x.com", "quote": "Dallas Mavericks announced that Danté Exum underwent successful right knee surgery", "outlet": "x.com", "source_url": "https://x.com/GrantAfseth/status/1999619243311267889", "tags": ["Dallas Mavericks", "Injuries", "Dante Exum"]}, {"date": "", "archive_date": "2025-12-12", "text": "New York Basketball:\"I thought it was a good play…I threw it too hard…chasing down ball, throw it off him…Myhomeboy said the Reds gonna be giving me a call––if y'all watching, invite me to spring training––yeah but it was no foul play intended\" –– Desmond Bane on throwing ball at OG Anunobyx.com", "quote": "\"I thought it was a good play…I threw it too hard…chasing down ball, throw it off him…My", "outlet": "x.com", "source_url": "https://x.com/NBA_NewYork/status/1999603488662102163", "tags": ["New York Knicks", "Orlando Magic", "OG Anunoby", "Desmond Bane"]}, {"date": "", "archive_date": "2025-12-12", "text": "Wizards PR: TheWashington Wizards have recalled G AJ Johnson from the@CapitalCityGoGo .x.com", "quote": "Washington Wizards have recalled G AJ Johnson from the", "outlet": "x.com", "source_url": "https://x.com/WizPRStats/status/1999584243089920148", "tags": ["Washington Wizards", "G League", "AJ Johnson"]}, {"date": "", "archive_date": "2025-12-12", "text": "Omari Sankofa II: JB on finally having a healthy roster:“It’s great for us and that’s what we’ve been working toward, being able to have everyone available and then being able to make decisions … lineups, rotations … that you couldn’t make before.”x.com", "quote": "“It’s great for us and that’s what we’ve been working toward, being able to have everyone available and then being able to make decisions … lineups, rotations … that you couldn’t make before.”", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/1999604765408268704", "tags": ["Detroit Pistons", "JB Bickerstaff"]}, {"date": "", "archive_date": "2025-12-12", "text": "“It would mean a lot for him to be back,” Castle said.“We haven’t played a game yet with our full team healthy. So, just getting the first look at that on the biggest stage, it would be the perfect time for his return.”Andscape", "quote": "“We haven’t played a game yet with our full team healthy. So, just getting the first look at that on the biggest stage, it would be the perfect time for his return.”", "outlet": "Andscape", "source_url": "https://andscape.com/features/spurs-stephon-castle-buys-stake-in-connecticut-soccer-teams/", "tags": ["San Antonio Spurs", "Victor Wembanyama", "Stephon Castle"]}, {"date": "", "archive_date": "2025-12-12", "text": "With a nearly 40-inch vertical leap, San Antonio Spurs guard Stephon Castle says he would be a goalie if he played the game of soccer. What isn’t a game is that the 21-year-old is a part-owner of two expansion soccer franchises.The former University of Connecticut star is part of the expanded ownership in the Connecticut Sports Group (CSG), which owns two expansion pro soccer clubs in CT United FC and a future Connecticut women’s pro soccer club.Andscape", "quote": "The former University of Connecticut star is part of the expanded ownership in the Connecticut Sports Group (CSG), which owns two expansion pro soccer clubs in CT United FC and a future Connecticut women’s pro soccer club", "outlet": "Andscape", "source_url": "https://andscape.com/features/spurs-stephon-castle-buys-stake-in-connecticut-soccer-teams/", "tags": ["San Antonio Spurs", "Business", "Stephon Castle"]}, {"date": "", "archive_date": "2025-12-12", "text": "Jon Krawczynski:Ant downgraded to out tonight.Rare for him to miss a game against Steph (or any game for that matter)x.com", "quote": "Ant downgraded to out tonight.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999596998673018955", "tags": ["Golden State Warriors", "Minnesota Timberwolves", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-12", "text": "K.C. Johnson: Per Donovan, Coby White is inIsaac Okoro, Tre Jones and Jalen Smith also in. Okoro and Smith are on 20-Minute restriction and Jones 24.x.com", "quote": "Isaac Okoro, Tre Jones and Jalen Smith also in", "outlet": "x.com", "source_url": "https://x.com/KCJHoop/status/1999608644510335085", "tags": ["Chicago Bulls", "Injuries", "Tre Jones", "Jalen Smith", "Coby White", "Isaac Okoro"]}, {"date": "", "archive_date": "2025-12-12", "text": "Austin Krell:Tyrese Maxey is OUT tonight due to an illness.x.com", "quote": "Tyrese Maxey is OUT tonight due to an illness", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/1999604621170635032", "tags": ["Philadelphia 76ers", "Injuries", "Tyrese Maxey"]}, {"date": "", "archive_date": "2025-12-12", "text": "Michael Scotto: TheSan Antonio Spurs are signing Kyle Mangas to a two-way contract,league sources told @hoopshype. Mangas has averaged 18.5 points on 50% shooting from the field and 41% from 3-point range, 5.0 assists, 2.9 rebounds, and 1.5 steals for the Austin Spurs in the G League.x.com", "quote": "San Antonio Spurs are signing Kyle Mangas to a two-way contract,", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/1999586602348077168", "tags": ["San Antonio Spurs", "Free Agency", "G League", "Kyle Mangas"]}, {"date": "", "archive_date": "2025-12-12", "text": "Michael Scotto: TheSan Antonio Spurs will waive two-way forward Riley Minix to make room for the signing of Kyle Mangas to a two-way deal,league sources said. Minix has averaged 15.5 points on 46% from the field and 39% from 3-point range, 6.4 boards and 3.3 assists in the G League this seasonx.com", "quote": "San Antonio Spurs will waive two-way forward Riley Minix to make room for the signing of Kyle Mangas to a two-way deal,", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/1999588590133670026", "tags": ["San Antonio Spurs", "G League", "Kyle Mangas", "Riley Minix"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: Redick also mentioned how \"We're the worst transition team and the worst in the first 8-10 seconds\",\"We're not a team that generates a lot of live ball turnovers\", and \"We're not a fast team\"x.com", "quote": "\"We're not a team that generates a lot of live ball turnovers\", and \"We're not a fast team\"", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999590027110883528", "tags": ["Los Angeles Lakers", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: The Los Angeles Lakers have the best pick-and-roll offense in the league.But in asking JJ Redick about how some teams defend the Lakers PnR, Redick acknowledged what I've mentioned before: the Lakers aren't a ball/body movement team, and that can shut out the non-ball-handlersx.com", "quote": "But in asking JJ Redick about how some teams defend the Lakers PnR, Redick acknowledged what I've mentioned before: the Lakers aren't a ball/body movement team, and that can shut out the non-ball-handlers", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999588363482071045", "tags": ["Los Angeles Lakers", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: in different parts of today's media, JJ Redick kept it real\"I don't think there's anybody in that meeting room that thinks we're a good defensive team right now, but I also don't think there's anybody in that meeting room that thinks we can't be a good defensive team\"x.com", "quote": "\"I don't think there's anybody in that meeting room that thinks we're a good defensive team right now, but I also don't think there's anybody in that meeting room that thinks we can't be a good defensive team\"", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999590025982529689", "tags": ["Los Angeles Lakers", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: Asked Gabe Vincent about his shooting mechanics, months after JJ Redick praised his work in that areaVincent rattled off a battery of factors that a shooter has to consider.Said B.E.E.F. (balance/eyes/elbow/follow) are on his list -- but he's not revealing the list yetx.com", "quote": "Vincent rattled off a battery of factors that a shooter has to consider.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999591663447212169", "tags": ["Los Angeles Lakers", "JJ Redick", "Gabe Vincent"]}, {"date": "", "archive_date": "2025-12-12", "text": "Duane Rankin: Suns coach Jordan Ott on Devin Booker (right groin strain):“He did practice with us. It’s always a good sign.Now we’ll see how he responds from this. It’s probably the most he’s done. See exactly where he’s at, but everything seems to be progressing.” Has missed last three games with groin injury. On Oso Ighodaro from Suns last game Wednesday at OKC: \"I think it was just knee-to-knee at that time. That was in the 3rd, knee-to-knee. Game got out of control, but we like him with that last unit as another ball handler at times and to give him reps. We often forget that Oso, it's just his second season.\" #Sunsx.com", "quote": "“He did practice with us. It’s always a good sign.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/1999583876314959906", "tags": ["Phoenix Suns", "Injuries", "Devin Booker", "Jordan Ott", "Oso Ighodaro"]}, {"date": "", "archive_date": "2025-12-12", "text": "Shams Charania:San Antonio Spurs' Victor Wembanyama is likely to return for Saturday's NBA Cup semifinals against the Oklahoma City Thunder in Las Vegas,sources tell ESPN. Final clearance will come after today's practice for Wembanyama, who's been sidelined since Nov. 14 due to a calf strain.x.com", "quote": "San Antonio Spurs' Victor Wembanyama is likely to return for Saturday's NBA Cup semifinals against the Oklahoma City Thunder in Las Vegas,", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/1999569968313036854?s=20", "tags": ["San Antonio Spurs", "Injuries", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-12", "text": "How do you evaluate the season so far? Vincent:“It’s been a good start, I’d say. We’ve had some bumps in the road and lessons to be learned from. We’ve had some good tests. But obviously, we have a lot more work to do. But I think we’re headed in the right direction.”Essentially Sports", "quote": "“It’s been a good start, I’d say. We’ve had some bumps in the road and lessons to be learned from. We’ve had some good tests. But obviously, we have a lot more work to do. But I think we’re headed in the right direction.”", "outlet": "Essentially Sports", "source_url": "https://www.essentiallysports.com/nba-active-basketball-news-exclusive-la-lakers-gabe-vincent-dishes-on-lebron-james-luka-doncic-s-sacrifices-role-on-the-team-and-more-exclusive/", "tags": ["Los Angeles Lakers", "Gabe Vincent"]}, {"date": "", "archive_date": "2025-12-12", "text": "What are the lessons learned? Gabe Vincent:“It’s continuing to trust and continuing to build. It’s hard to build a championship team and championship habits overnight. It doesn’t happen that way. There are going to be growing pains. There are going to be bumps and bruises along the way, whether it’s dropping games we shouldn’t drop or battling against certain types of defenses and offenses and so forth.”Essentially Sports", "quote": "“It’s continuing to trust and continuing to build. It’s hard to build a championship team and championship habits overnight. It doesn’t happen that way. There are going to be growing pains. There are going to be bumps and bruises along the way, whether it’s dropping games we shouldn’t drop or battling against certain types of defenses and offenses and so forth.”", "outlet": "Essentially Sports", "source_url": "https://www.essentiallysports.com/nba-active-basketball-news-exclusive-la-lakers-gabe-vincent-dishes-on-lebron-james-luka-doncic-s-sacrifices-role-on-the-team-and-more-exclusive/", "tags": ["Los Angeles Lakers", "Gabe Vincent"]}, {"date": "", "archive_date": "2025-12-12", "text": "What have the sacrifices looked like for Luka, LeBron, and Austin? Gabe Vincent:“All three of those guys can put up ridiculous numbers offensively. It’s to the point where teams are double-teaming them at half-court off tipoff. They’re capable. They’re more than capable of commanding a double team and scoring themselves. But it takes a lot of sacrifice from them to get off of it and trust that the ball will get back to them and so forth.”Essentially Sports", "quote": "“All three of those guys can put up ridiculous numbers offensively. It’s to the point where teams are double-teaming them at half-court off tipoff. They’re capable. They’re more than capable of commanding a double team and scoring themselves. But it takes a lot of sacrifice from them to get off of it and trust that the ball will get back to them and so forth.”", "outlet": "Essentially Sports", "source_url": "https://www.essentiallysports.com/nba-active-basketball-news-exclusive-la-lakers-gabe-vincent-dishes-on-lebron-james-luka-doncic-s-sacrifices-role-on-the-team-and-more-exclusive/", "tags": ["Los Angeles Lakers", "LeBron James", "Luka Doncic", "Gabe Vincent", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-12", "text": "For quite some time now, the Warriors have been open about their desire to acquire the Pelicans’ Trey Murphy III.But if they’re going to use Kuminga to do that, then it would be helpful to know how, if at all, the Pelicans value the Warriors’ 23-year-old forward. For the time being, the feedback is mixed on that front. ’Tis the season for smokescreens, after all. Yet this part is indisputable when it comes to the Warriors’ side of the equation: These past six weeks have not been kind when it comes to Kuminga’s value. After the first six games of the season when Kuminga was receiving rave reviews, he has returned to the rollercoaster existence that embodied the vast majority of his first four seasons.New York Times", "quote": "For quite some time now, the Warriors have been open about their desire to acquire the Pelicans’ Trey Murphy III.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Golden State Warriors", "New Orleans Pelicans", "Trade", "Jonathan Kuminga", "Trey Murphy"]}, {"date": "", "archive_date": "2025-12-12", "text": "No story about trade targets is complete without discussing Golden State’s Jonathan Kuminga. Never mind that he’s not eligible to be moved until Jan. 15. There are Kuminga-related dynamics worth analyzing in the here and now — some familiar, and some not so much.The Kings are widely expected to revisit their offseason interest in Kuminga, and it remains to be seen if that’s the case for teams like Phoenix and Chicago that have been intrigued by him before. But the New Orleans Pelicans, in many ways, are front and center in this discussion.New York Times", "quote": "The Kings are widely expected to revisit their offseason interest in Kuminga, and it remains to be seen if that’s the case for teams like Phoenix and Chicago that have been intrigued by him before. But the New Orleans Pelicans, in many ways, are front and center in this discussion", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Chicago Bulls", "Golden State Warriors", "New Orleans Pelicans", "Phoenix Suns", "Sacramento Kings", "Trade", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grizzlies PR: The@memgrizz have assigned Brandon Clarke to the @MemphisHustle. Clarke will be recalled to the Grizzlies following the Hustle's practice today.x.com", "quote": "@memgrizz have assigned Brandon Clarke to the @MemphisHustle", "outlet": "x.com", "source_url": "https://x.com/GrizzliesPR/status/1999532451714957663", "tags": ["Memphis Grizzlies", "G League", "Injuries", "Brandon Clarke"]}, {"date": "", "archive_date": "2025-12-12", "text": "Damichael Cole:Ja Morant has been upgraded to probable for today’s game against the Jazz.x.com", "quote": "Ja Morant has been upgraded to probable for today’s game against the Jazz", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1999526112414552158?s=20", "tags": ["Memphis Grizzlies", "Injuries", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-12", "text": "The Miami Heat, for example, are often handicapped by league insiders as a place that Antetokounmpo might be willing to call his new basketball home.Pat Riley and company could offer the Bucks a yacht full of draft assets, all their best young players (All-Star Tyler Herro, promising young big man Kel’el Ware, small forward Jaime Jaquez Jr.) and salary filler (Terry Rozier, if the NBA allows it) to make the numbers work.New York Times", "quote": "The Miami Heat, for example, are often handicapped by league insiders as a place that Antetokounmpo might be willing to call his new basketball home.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Miami Heat", "Milwaukee Bucks", "Trade", "Pat Riley", "Giannis Antetokounmpo", "Terry Rozier", "Tyler Herro", "Jaime Jaquez"]}, {"date": "", "archive_date": "2025-12-12", "text": "A Wolves source confirmed that there is legitimate interest in White, but the 25-year-old’s looming free agency appears to be a significant hindrance to a possible trade.He’s making $12.8 million in the final year of his deal and is widely expected to seek a major raise this summer. But the fear of that unknown, it seems, means this is the kind of “rental” situation that drops the price point precipitously and creates a negotiating gap between the two sides.New York Times", "quote": "A Wolves source confirmed that there is legitimate interest in White, but the 25-year-old’s looming free agency appears to be a significant hindrance to a possible trade.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Chicago Bulls", "Minnesota Timberwolves", "Free Agency", "Trade", "Coby White"]}, {"date": "", "archive_date": "2025-12-12", "text": "Davis’ contract status is certainly providing a pressure point. Davis — who is represented by Klutch Sports CEO Rich Paul — is eligible for an extension this summer (his current deal runs through next season, with a player option for $62.7 million in 2027-28). That’s a major consideration for both the Mavs and the expected suitors, which — as ESPN first reported — are expected to include Detroit, Atlanta and Toronto.Yet as several league sources indicated, the actual level of interest from the aforementioned teams remains to be seen. Especially given Davis’ sordid health history.New York Times", "quote": "Yet as several league sources indicated, the actual level of interest from the aforementioned teams remains to be seen. Especially given Davis’ sordid health history", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Atlanta Hawks", "Dallas Mavericks", "Detroit Pistons", "Toronto Raptors", "Trade", "Anthony Davis", "Rich Paul"]}, {"date": "", "archive_date": "2025-12-12", "text": "As one league source shared, there are even some indications that the Mavericks are still considering upgrading this current core rather than parting with their veterans.Time will tell if there’s anything feasible on that front, or if this becomes the fire sale that so many have predicted.New York Times", "quote": "As one league source shared, there are even some indications that the Mavericks are still considering upgrading this current core rather than parting with their veterans.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Dallas Mavericks"]}, {"date": "", "archive_date": "2025-12-12", "text": "Yet as is the case with so many other teams, the realities of the market might provide a sobering dose of reality once we get closer to dealing time. The Kings’ Zach LaVine, for starters, could certainly help several contending teams.To that point, league sources confirmed that Milwaukee has done recent due diligence on the 30-year-old guard (and has shown interest in the past). But his exorbitant salary — $47.4 million this season and a player option for $48.9 million next season — makes it nearly impossible to move him without attaching some sort of sweetener (draft assets) in return. And therein lies the challenge for first-year Kings general manager Scott Perry.New York Times", "quote": "To that point, league sources confirmed that Milwaukee has done recent due diligence on the 30-year-old guard (and has shown interest in the past)", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Milwaukee Bucks", "Sacramento Kings", "Trade", "Scott Perry", "Zach LaVine"]}, {"date": "", "archive_date": "2025-12-12", "text": "For Sabonis’ part, league sources say the 29-year-old big man has heeded that call for patience.His contract runs through the 2027-28 season, with a combined $94 million owed in the next two seasons, meaning his market is inevitably limited by the sheer magnitude of the money owed. Teams like Washington, the Phoenix Suns and Chicago have shown significant interest in the past and are still believed to be on his short list of possible suitors, but Sabonis is prepared to remain in a Kings jersey for the foreseeable future.New York Times", "quote": "For Sabonis’ part, league sources say the 29-year-old big man has heeded that call for patience.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Chicago Bulls", "Phoenix Suns", "Sacramento Kings", "Washington Wizards", "Trade", "Domantas Sabonis"]}, {"date": "", "archive_date": "2025-12-12", "text": "Adam Aaronson:Tyrese Maxey (illness) has been downgraded from probable to QUESTIONABLE for tonight’s game vs. Indiana. Maxey, who leads the NBA in minutes per game, has not missed a game this season. Joel Embiid (left knee injury recovery) remains PROBABLE.x.com", "quote": "Tyrese Maxey (illness) has been downgraded from probable to QUESTIONABLE for tonight’s game vs. Indiana. Maxey, who leads the NBA in minutes per game, has not missed a game this season", "outlet": "x.com", "source_url": "https://x.com/SixersAdam/status/1999494312145686563?s=20", "tags": ["Philadelphia 76ers", "Injuries", "Joel Embiid", "Tyrese Maxey"]}, {"date": "", "archive_date": "2025-12-12", "text": "Tim Bontemps:“For a guy like Anthony Davis,\" a West executive said, \"it's hard to justify them getting a 35 percent max when they aren't playing a ton of minutes and games.\"That's why sources I've spoken to have expressed skepticism in a robust market for Davis this trade season, particularly as teams around the league are shifting to younger, faster and deeper rosters.ESPN", "quote": "“For a guy like Anthony Davis,\" a West executive said, \"it's hard to justify them getting a 35 percent max when they aren't playing a ton of minutes and games.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47281439/nba-trade-deadline-intel-new-era-superstar-value-means-giannis-anthony-davis", "tags": ["Dallas Mavericks", "Trade", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-12", "text": "But any Giannis talks are still played by the old rules, according to executives and coaches.\"I don't think you'd see 29 teams make an offer like if, say, Victor [Wembanyama] was available, but there would be plenty of interest and probably two to three teams would be willing to go all-in right now,\" an East executive said. \"Every player has risk, and he'd have some risk, but this is one you don't have to work too hard to talk yourself into.\"\"I'm sure the front office would have pros and cons and all that,\" an assistant coach said. \"But if you're asking me, I'd want him on my team in less than a second. He plays hard every night and clearly wants to win and can be unstoppable. This is the kind of player you need to win it all.\"ESPN", "quote": "\"I don't think you'd see 29 teams make an offer like if, say, Victor [Wembanyama] was available, but there would be plenty of interest and probably two to three teams would be willing to go all-in right now,\" an East executive said. \"Every player has risk, and he'd have some risk, but this is one you don't have to work too hard to talk yourself into.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47281439/nba-trade-deadline-intel-new-era-superstar-value-means-giannis-anthony-davis", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-12", "text": "Evan Sidery:The Warriors, who will be in the market for a center upgrade during trade season, are expected to show interest in Nic Claxton.The Nets are once again open to moving Claxton, who is under contract through 2027-28. A swap of Jonathan Kuminga for Claxton would be on the table.x.com", "quote": "The Warriors, who will be in the market for a center upgrade during trade season, are expected to show interest in Nic Claxton.", "outlet": "x.com", "source_url": "https://x.com/esidery/status/1998474849136836786", "tags": ["Golden State Warriors", "Brooklyn Nets", "Trade", "Nicolas Claxton", "Nic Claxton", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-12", "text": "\"They have to be very careful with what they do with AD,\" an East executive said. \"They could set themselves back years with the wrong deal.\"Speaking of Daniel Gafford, he has been mentioned as a possible trade candidate this season and into the future, especially if the Mavericks have to cut payroll.He's a quality big man, and the three-year, $54 million contract he starts next season is viewed as reasonable. But with center Dereck Lively II playing just 43 games over the past two seasons -- he will miss the rest of 2025-26 with a foot injury -- it should no longer be assumed that Gafford is expendable in Dallas.ESPN", "quote": "Speaking of Daniel Gafford, he has been mentioned as a possible trade candidate this season and into the future, especially if the Mavericks have to cut payroll.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47281439/nba-trade-deadline-intel-new-era-superstar-value-means-giannis-anthony-davis", "tags": ["Dallas Mavericks", "Trade", "Daniel Gafford", "Dereck Lively"]}, {"date": "", "archive_date": "2025-12-12", "text": "Brian Windhorst: For many years, when teams chased star players via free agency or trade, the more years they had on their contract, the better. Now, as teams consider roster-building and strategy, values seem to be different.\"There are two major shifts happening,\" a Western Conference general manager said. \"We have everyone being very mindful of the aprons and carefully slotting their players to fit.Then you have the nature of the game, where you need deep rosters to play this volume of games at the speed the league is playing.\"ESPN", "quote": "\"There are two major shifts happening,\" a Western Conference general manager said. \"We have everyone being very mindful of the aprons and carefully slotting their players to fit.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47281439/nba-trade-deadline-intel-new-era-superstar-value-means-giannis-anthony-davis", "tags": ["Free Agency", "Trade"]}, {"date": "", "archive_date": "2025-12-12", "text": "\"There are rules around [the second apron] that we needed to be very careful of with our injury history. The wrong person gets injured, and very quickly you're into a scenario that I never want to have to contemplate, and that's trading No. 15.\"Kroenke's point, while it might have put a scare into Nuggets fans, was clear. The second apron and its fangs, not just luxury taxes penalties but also team-building penalties, can kneecap a franchise and quickly change how it evaluates player value. \"Now more than ever, you cannot overpay for past performance, either in salary or draft picks,\" a West executive said. \"The cost of a mistake is too high.\"ESPN", "quote": "\"There are rules around [the second apron] that we needed to be very careful of with our injury history. The wrong person gets injured, and very quickly you're into a scenario that I never want to have to contemplate, and that's trading No. 15.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47281439/nba-trade-deadline-intel-new-era-superstar-value-means-giannis-anthony-davis", "tags": ["Denver Nuggets", "Trade"]}, {"date": "", "archive_date": "2025-12-12", "text": "Justin Russo: Reached out to the LA Clippers to ask about the report that head coach Tyronn Lue wasn't made available to the media after tonight's game. Clippers said that Lue was made available postgame but no one was in the interview room. There was also no traveling road media tonight.Kelly Iko: Couldn’t be further from the truth. I went there immediately after the final buzzer. At least four people were in that interview room, including a member of Rockets PR designated to transcribe Lue’s postgame presser.We were told he wouldn’t be speaking and left.x.com", "quote": "Kelly Iko: Couldn’t be further from the truth. I went there immediately after the final buzzer. At least four people were in that interview room, including a member of Rockets PR designated to transcribe Lue’s postgame presser.", "outlet": "x.com", "source_url": "https://x.com/kellyiko/status/1999374284288897519?s=46&t=XYvAhCUJXI37ME8EkCJ5rQ", "tags": ["Los Angeles Clippers", "Tyronn Lue"]}, {"date": "", "archive_date": "2025-12-12", "text": "ClutchPoints:Rich Paul: \"I'm on the show right now, but I had to take your call, cause you, Shams.\" Max Kellerman: “So who gives who information when Shams calls you?” RP: “Don’t worry about all that.”? (via Game Over Pod)Twitter", "quote": "Rich Paul: \"I'm on the show right now, but I had to take your call, cause you, Shams.\" Max Kellerman: “So who gives who information when Shams calls you?” RP: “Don’t worry about all that.”", "outlet": "Twitter", "source_url": "http://twitter.com/clutchpoints/status/1999249331187253405", "tags": ["Rich Paul", "Shams Charania"]}, {"date": "", "archive_date": "2025-12-12", "text": "Besides his on-court abilities, Jake LaRavia also seems to fit in with the rest of the guys as each player has spoken highly about the camaraderie in the locker room. The Lakers have made it a point to host bonding events throughout the regular season, and they recently held a pickleball tournament that got pretty competitive.Ultimately, LaRavia won the tournament with assistant coach Beau Levesque and the team recently released the highlights:Lakers Nation", "quote": "Ultimately, LaRavia won the tournament with assistant coach Beau Levesque and the team recently released the highlights:", "outlet": "Lakers Nation", "source_url": "https://lakersnation.com/lakers-video-jake-laravia-wins-team-pickleball-tournament/", "tags": ["Los Angeles Lakers", "Jake LaRavia"]}, {"date": "", "archive_date": "2025-12-12", "text": "Ian Begley: And I think teams around the league are just keeping an eye down there to see who's New Orleans going to make available. What will they want for those players?A New York product, Jose Alvarado, if they make him available, the Knicks, I'm sure, will be one of those teams that are interested. The Knicks will be among many teams that are interested in Jose Alvarado if he is made available.And the interesting thing with Jose is his salary, I believe he is at 4.5 million. So like salary matching is less difficult at that number. You talk about backup point guard for the Knicks, you talk about a player in Alvarado who defends and brings a passion on the end of the floor. I'm sure a lot of teams will be calling if New Orleans made him available.YouTube", "quote": "A New York product, Jose Alvarado, if they make him available, the Knicks, I'm sure, will be one of those teams that are interested. The Knicks will be among many teams that are interested in Jose Alvarado if he is made available.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=7tXh4JvmEzk&t=2214s", "tags": ["New Orleans Pelicans", "New York Knicks", "Trade", "Jose Alvarado"]}, {"date": "", "archive_date": "2025-12-12", "text": "Charlotte is among the teams that had interest in Chris Paul this past offseason when the future Hall of Fame point guard (and North Carolina native) was adamant that he was willing to play no farther away from his Los Angeles-based family than Phoenix. Now?A source with knowledge of the Hornets' thinking said this week that they are not expected to pursue the 40-year-old, but Paul is said to be open-minded about destinations nowto go somewhere he can assemble a final chapter with a far happier ending than his second stint as a Clipper featured.marcstein.substack.com", "quote": "A source with knowledge of the Hornets' thinking said this week that they are not expected to pursue the 40-year-old, but Paul is said to be open-minded about destinations now", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/lots-of-the-nbas-latest-trade-talk", "tags": ["Charlotte Hornets", "Los Angeles Clippers", "Trade", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-12", "text": "“Yeah, I love it here,” Michael Porter Jr said when asked by The Post if he sees himself in Brooklyn long term. “I love the staff, I love the energy of practice.Everyone gets along and has great vibes and great energy around the facility. So whatever team wants and appreciates what I bring to the table, then that’s where I want to be. And I feel like they do here.New York Post", "quote": "“Yeah, I love it here,” Michael Porter Jr said when asked by The Post if he sees himself in Brooklyn long term. “I love the staff, I love the energy of practice.", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/11/sports/michael-porter-jr-hopes-to-convince-nets-hes-worth-keeping/", "tags": ["Brooklyn Nets", "Trade", "Michael Porter", "Michael Porter Jr"]}, {"date": "", "archive_date": "2025-12-12", "text": "But ask Mike Brown, in his first season as Jalen Brunson’s head coach, about whether his point guard already has done enough to be considered one of the franchise greats and there isn’t any hesitation. “He’s been here long enough,” Brown said Thursday after the Knicks practiced in Tarrytown ahead of their NBA Cup semifinal in Vegas on Saturday. “He’s helped them win a lot of games. Obviously, he did start in Dallas, but he was a little younger. It wasn’t his team. He wasn’t really the guy.“He came here, it’s his team, he’s the guy here, he’s an MVP candidate, like I said, and so what he’s doing is definitely franchise-altering, and again, that has to be taken note [of].Not just in the MVP race but also within the community of New York.”New York Post", "quote": "“He came here, it’s his team, he’s the guy here, he’s an MVP candidate, like I said, and so what he’s doing is definitely franchise-altering, and again, that has to be taken note [of].", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/11/sports/mike-brown-keeps-pushing-for-franchise-altering-jalen-brunsons-mvp-case/", "tags": ["New York Knicks", "Mike Brown", "MVP Race", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-12", "text": "Now Nolan Traore — the forgotten Frenchman — has been recalled from the G-League. The teenaged point guard earned his call-up with his recent play down in Long Island, and will travel with the Nets for Friday’s game in Dallas.“He deserves [it]. He’s played well. … We’re very happy with where he’s at,” coach Jordi Fernández said. “[He’s improved] on both ends. He’s done very good things.He’s fast, very good athlete. His body will keep developing and he’ll keep getting stronger. But his intentions have been great, his ball pressure’s been good, his activity, understanding schemes. So, one step at a time. We’re seeing progression.”New York Post", "quote": "“He deserves [it]. He’s played well. … We’re very happy with where he’s at,” coach Jordi Fernández said. “[He’s improved] on both ends. He’s done very good things.", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/11/sports/rookie-nolan-traore-promoted-to-nets-big-club/", "tags": ["Brooklyn Nets", "G League", "Nolan Traore"]}, {"date": "", "archive_date": "2025-12-12", "text": "Pelicans Film Room:“We have such an active crowd whether its full or its not full... They want to cheer. They want to be loud... We have fans that love to watch hoop.Obviously we have to give them something to cheer for... We gave them something tonight\" -- Jordan Poole on the crowd engagementTwitter", "quote": "“We have such an active crowd whether its full or its not full... They want to cheer. They want to be loud... We have fans that love to watch hoop.", "outlet": "Twitter", "source_url": "http://twitter.com/PelsFilmRoom/status/1999331514006536491", "tags": ["New Orleans Pelicans", "Fans", "Jordan Poole"]}, {"date": "", "archive_date": "2025-12-12", "text": "Justin Russo:Reached out to the LA Clippers to ask about the report that head coach Tyronn Lue wasn't made available to the media after tonight's game. Clippers said that Lue was made available postgame but no one was in the interview room.There was also no traveling road media tonight. For what it's worth, there's been zero traveling media for the last several LA Clippers road games, and as such Lue hasn't had to do postgame media if there wasn't anyone in the room, which there hasn't been. Believe the last one was at Atlanta (Dec. 3).x.com", "quote": "Reached out to the LA Clippers to ask about the report that head coach Tyronn Lue wasn't made available to the media after tonight's game. Clippers said that Lue was made available postgame but no one was in the interview room.", "outlet": "x.com", "source_url": "https://x.com/FlyByKnite/status/1999344664512807126", "tags": ["Los Angeles Clippers", "Tyronn Lue"]}, {"date": "", "archive_date": "2025-12-11", "text": "Pelicans Film Room: \"I hated it. I didnt like it at all but I couldnt do anything about it.I was playing injured the first seven games also...You cant do anything about an injury but you can do whatever you can to try to get back\" -- Jordan Poole on sitting out of gamesx.com", "quote": "I was playing injured the first seven games also...", "outlet": "x.com", "source_url": "https://x.com/PelsFilmRoom/status/1999327560191344787", "tags": ["New Orleans Pelicans", "Jordan Poole"]}, {"date": "", "archive_date": "2025-12-11", "text": "Jim Eichenhofer:Good win. #Pelicans continue to pile up points, this time running away from Blazers in fourth quarter. It's a 143-120 final.Three Pels score 20+ pts, including both Poole and McGowens off benchx.com", "quote": "Three Pels score 20+ pts, including both Poole and McGowens off bench", "outlet": "x.com", "source_url": "https://x.com/Jim_Eichenhofer/status/1999319947462541479", "tags": ["New Orleans Pelicans", "Portland Trail Blazers", "Jordan Poole", "Bryce McGowens"]}, {"date": "", "archive_date": "2025-12-11", "text": "Pelicans Film Room: \"I dont think anyone saw him playing these minutes...He has got a knack to get down hill that I love...Give our front office credit. They found this kid, they believed in him. He has made the most of his opportunity\" -- James Borrego on Bryce McGowensx.com", "quote": "He has got a knack to get down hill that I love...", "outlet": "x.com", "source_url": "https://x.com/PelsFilmRoom/status/1999325379463623086", "tags": ["New Orleans Pelicans", "James Borrego", "Bryce McGowens"]}, {"date": "", "archive_date": "2025-12-11", "text": "Joey Linn:Clippers lose 115-113 in Houston. Ivica Zubac had 33 PTS. Kawhi Leonard had 24/9/4/5 in 41 minutes, but was called for a costly offensive foul late. LA is 6-19.x.com", "quote": "Clippers lose 115-113 in Houston", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/1999323002601873463", "tags": ["Houston Rockets", "Los Angeles Clippers", "Kawhi Leonard", "Ivica Zubac"]}, {"date": "", "archive_date": "2025-12-11", "text": "Eric Nehm:FINAL: Bucks 116, Celtics 101- Kuzma 31pts/6reb - Portis 27pts/10reb - Porter 18pts/10reb/13ast - Trent 13pts/2reb - Rollins 10pts/2reb/7ast - Anthony 9pts/3reb/5ast The Bucks are now 11-15 on the season. They play next in Brooklyn on Sunday.x.com", "quote": "FINAL: Bucks 116, Celtics 101", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/1999319214205862200", "tags": ["Boston Celtics", "Milwaukee Bucks", "Bobby Portis", "Cole Anthony", "Kyle Kuzma", "Gary Trent Jr", "Kevin Porter", "Ryan Rollins"]}, {"date": "", "archive_date": "2025-12-11", "text": "The Bulls, meanwhile, continue to field trade interest in guard Coby White.marcstein.substack.com", "quote": "The Bulls, meanwhile, continue to field trade interest in guard Coby White", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/lots-of-the-nbas-latest-trade-talk", "tags": ["Chicago Bulls", "Trade", "Coby White"]}, {"date": "", "archive_date": "2025-12-11", "text": "Specifically, Curry described the weight young players have in trying to get better individually while also balancing the responsibility of fitting into a system, particularly one as established as Golden State’s.“Really, the hardest part is, whether it’s going well or whether it’s not, (is) not losing your spirit,” Curry said.“That’s been JK’s challenge as a young player. Things change so quickly, and there’s all these declarations about who he is as a player, and does he fit, and all that type of stuff.”New York Times", "quote": "“Really, the hardest part is, whether it’s going well or whether it’s not, (is) not losing your spirit,” Curry said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6883527/2025/12/11/jonathan-kuminga-steph-curry-warriors-rotation/", "tags": ["Golden State Warriors", "Stephen Curry", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-11", "text": "Spencer went viral in a Dec. 4 loss to the Philadelphia 76ers after hitting a clutch 3-pointer and screaming “I’m that mother f*****” to the crowd. From a distance, Curry wasn’t surprised at all when he saw that sequence.“I remember the first day I was playing pickup with him, he was talking trash to me,” Curry said.“Like three years ago, right before training camp. So it’s nothing new, it’s just great for the world to see it.”New York Times", "quote": "“I remember the first day I was playing pickup with him, he was talking trash to me,” Curry said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6883527/2025/12/11/jonathan-kuminga-steph-curry-warriors-rotation/", "tags": ["Golden State Warriors", "Stephen Curry", "Pat Spencer"]}, {"date": "", "archive_date": "2025-12-11", "text": "\"It’s amazing to watch,\" Curry said Thursday after practice. \"We've seen it over the summers, in practice, when he's been out there in short spurts.He just has a presence about him that he just knows the game. He plays with 120 percent of confidence every time he's out there.And as a kind of playmaker role, it was cool to see him kind of adapt to what we needed pretty much overnight. And I think it'll only help us as we keep moving forward.\"NBC Sports Bay Area", "quote": "He just has a presence about him that he just knows the game. He plays with 120 percent of confidence every time he's out there.", "outlet": "NBC Sports Bay Area", "source_url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/steph-curry-pat-spencer-3/1898635/?partner=yahoo", "tags": ["Golden State Warriors", "Stephen Curry", "Pat Spencer"]}, {"date": "", "archive_date": "2025-12-11", "text": "Even with an NBA title, an NBA Finals Most Valuable Player award, an NBA MVP award and a $285-million contract all in hand since May, 27-year-old Shai Gilgeous-Alexander is, by all accounts, still the same humble star. “That’s just how I was raised,” Gilgeous-Alexander told Andscape after a 124-112 win at Golden State on Dec. 2.“I’ve just never had that temperament about me. Never. I just don’t ever think I’m better than anybody because I put the ball in the basket.I don’t think it gives me a pass to be arrogant or think that I’m above certain things just because I’m half decent at basketball.”Andscape", "quote": "“I’ve just never had that temperament about me. Never. I just don’t ever think I’m better than anybody because I put the ball in the basket.", "outlet": "Andscape", "source_url": "https://andscape.com/features/he-didnt-change-one-bit-shai-gilgeous-alexander-remains-oklahoma-citys-humble-superstar/", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-11", "text": "Katy Winge:Aaron Gordon is still out with a hamstring strain but is getting some work in pregame in Sacramentox.com", "quote": "Aaron Gordon is still out with a hamstring strain but is getting some work in pregame in Sacramento", "outlet": "x.com", "source_url": "https://x.com/katywinge/status/1999302409034826226", "tags": ["Denver Nuggets", "Injuries", "Aaron Gordon"]}, {"date": "", "archive_date": "2025-12-11", "text": "Andrew Crane:Miles McBride (left ankle sprain) will be re-evaluated in one week, according to the Knicks.x.com", "quote": "Miles McBride (left ankle sprain) will be re-evaluated in one week, according to the Knicks", "outlet": "x.com", "source_url": "https://x.com/CraneAndrew/status/1999172793208832271", "tags": ["New York Knicks", "Injuries", "Miles McBride"]}, {"date": "", "archive_date": "2025-12-11", "text": "The Warriors are increasingly expected to trade Kuminga between Jan. 15 — who is not trade-eligible this season until that date — and the Feb. 5 trade deadline. AndChicago has certainly registered trade interest in Kuminga in the past, bringing up the 23-year-old in negotiations with Golden State on trades that never came to fruition in which the Warriors were engaged in talks of varying degrees of seriousness featuring Alex Caruso, Zach LaVine and Nikola Vučević.marcstein.substack.com", "quote": "Chicago has certainly registered trade interest in Kuminga in the past, bringing up the 23-year-old in negotiations with Golden State on trades that never came to fruition in which the Warriors were engaged in talks of varying degrees of seriousness featuring Alex Caruso, Zach LaVine and Nikola Vučević", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/lots-of-the-nbas-latest-trade-talk", "tags": ["Chicago Bulls", "Golden State Warriors", "Trade", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-11", "text": "Yet it's likewise believed that the price point to convince New Orleans to part with either Murphy or Jones — swingmen who both possess favorable contracts on top of their highly desired skill sets — is extremely high and intended to discourage inquiries.marcstein.substack.com", "quote": "Yet it's likewise believed that the price point to convince New Orleans to part with either Murphy or Jones — swingmen who both possess favorable contracts on top of their highly desired skill sets — is extremely high and intended to discourage inquiries", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/lots-of-the-nbas-latest-trade-talk", "tags": ["New Orleans Pelicans", "Trade", "Herb Jones", "Trey Murphy"]}, {"date": "", "archive_date": "2025-12-11", "text": "Sources say that Dumont has been far more involved in team matters since Harrison's Nov. 11 dismissal.And after listening to one voice for so long, Dumont has welcomed the ability to canvas opinions on the team's next steps.marcstein.substack.com", "quote": "And after listening to one voice for so long, Dumont has welcomed the ability to canvas opinions on the team's next steps", "outlet": "marcstein.substack.com", "source_url": "https://marcstein.substack.com/p/lots-of-the-nbas-latest-trade-talk", "tags": ["Dallas Mavericks", "Patrick Dumont"]}, {"date": "", "archive_date": "2025-12-11", "text": "Michael Scotto:New Orleans Pelicans guard Jordan Poole (left quad strain) is expected to make his return to the lineup today versus the Portland Trail Blazers for the first time since November 4th.x.com", "quote": "New Orleans Pelicans guard Jordan Poole (left quad strain) is expected to make his return to the lineup today versus the Portland Trail Blazers for the first time since November 4th", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/1999268128854049063", "tags": ["New Orleans Pelicans", "Portland Trail Blazers", "Injuries", "Jordan Poole"]}, {"date": "", "archive_date": "2025-12-11", "text": "Timberwolves PR:Minnesota @Timberwolves Status Report in advance of tomorrow night’s game at Golden State Warriors:QUESTIONABLE Edwards - Right Foot Soreness OUT Beringer - G League Assignment Conley - Right Achilles Tendinopathy Freeman - Two-Way Zikarsky - Two-Wayx.com", "quote": "Minnesota @Timberwolves Status Report in advance of tomorrow night’s game at Golden State Warriors:", "outlet": "x.com", "source_url": "https://x.com/Twolves_PR/status/1999268052484129064", "tags": ["Golden State Warriors", "Minnesota Timberwolves", "G League", "Mike Conley", "Anthony Edwards", "Enrique Freeman", "Joan Beringer", "Rocco Zikarsky"]}, {"date": "", "archive_date": "2025-12-11", "text": "Eric Nehm: Per Bucks PR,AJ Green is out tonight vs. Boston.x.com", "quote": "AJ Green is out tonight vs. Boston", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/1999270304816988652", "tags": ["Boston Celtics", "Milwaukee Bucks", "Injuries", "AJ Green"]}, {"date": "", "archive_date": "2025-12-11", "text": "Trail Blazers PR: INJURY UPDATE:Robert Williams III and Yang Hansen are OUT tonight @ NOP.x.com", "quote": "Robert Williams III and Yang Hansen are OUT tonight @ NOP", "outlet": "x.com", "source_url": "https://x.com/TrailBlazersPR/status/1999264715575558505", "tags": ["Portland Trail Blazers", "Injuries", "Robert Williams", "Robert Williams III", "Yang Hansen"]}, {"date": "", "archive_date": "2025-12-11", "text": "Anthony Slater:Draymond Green (personal) and Al Horford (sciatica) are out tomorrow night vs Timberwolves.Steph Curry is officially cleared for his return. Not even listed on injury report.x.com", "quote": "Draymond Green (personal) and Al Horford (sciatica) are out tomorrow night vs Timberwolves.", "outlet": "x.com", "source_url": "https://x.com/anthonyVslater/status/1999245994148741486", "tags": ["Golden State Warriors", "Minnesota Timberwolves", "Al Horford", "Injuries", "Stephen Curry", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-11", "text": "Mike Curtis:#Mavs center Daniel Gafford is listed as doubtful for tomorrow's game against the #Nets. Cooper Flagg (right thumb splint) is available.x.com", "quote": "#Mavs center Daniel Gafford is listed as doubtful for tomorrow's game against the #Nets", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/1999261213587570904", "tags": ["Dallas Mavericks", "Brooklyn Nets", "Injuries", "Daniel Gafford", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-11", "text": "Omari Sankofa II: Tomorrow’s injury report vs the Hawks:Isaac Jones is out with a left knee sprain.Bobi Klintman, Chaz Lanier, Tolu Smith and Wendell Moore Jr. are with the Cruise. That’s all.x.com", "quote": "Isaac Jones is out with a left knee sprain.", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/1999257143204291066", "tags": ["Atlanta Hawks", "Detroit Pistons", "G League", "Injuries", "Wendell Moore", "Tolu Smith", "Bobi Klintman", "Isaac Jones", "Chaz Lanier"]}, {"date": "", "archive_date": "2025-12-11", "text": "Varun Shankar: Wizards injury report:No Sarr, Bilal still. But it looks like Tre Johnson is going to return for Washington.x.com", "quote": "No Sarr, Bilal still. But it looks like Tre Johnson is going to return for Washington", "outlet": "x.com", "source_url": "https://x.com/ByVarunShankar/status/1999246742152159572", "tags": ["Washington Wizards", "Injuries", "Bilal Coulibaly", "Alex Sarr", "Tre Johnson"]}, {"date": "", "archive_date": "2025-12-11", "text": "Austin Krell:Tomorrow's game vs the Indiana Pacers:Joel Embiid - PROBABLE (L knee) Tyrese Maxey - PROABLE (illness)x.com", "quote": "Tomorrow's game vs the Indiana Pacers:", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/1999245486222639178", "tags": ["Indiana Pacers", "Philadelphia 76ers", "Injuries", "Joel Embiid", "Tyrese Maxey"]}, {"date": "", "archive_date": "2025-12-11", "text": "A source with knowledge of the Pistons’ thinking told the Free Press they haven't had discussions with the Mavericks regarding a trade for Davis.And based on private discussions and public comments from the front office and coaching staff, it seems unlikely the Pistons are or will be among the teams looking to acquire him.Detroit Free Press", "quote": "And based on private discussions and public comments from the front office and coaching staff, it seems unlikely the Pistons are or will be among the teams looking to acquire him", "outlet": "Detroit Free Press", "source_url": "https://www.freep.com/story/sports/nba/pistons/2025/12/11/anthony-davis-trade-rumors-pistons-mavericks/87707064007/", "tags": ["Dallas Mavericks", "Detroit Pistons", "Trade", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-11", "text": "“The turnovers belong to Steph and Dray,” Butler said.“They get to make as many turnovers as humanly possible. And for everybody else, we just cannot turn the ball over. It’s just the way that it is.And I believe that, that is fair. Because the world isn’t fair. So they get to turn the ball over. And I’m fine with that.”New York Times", "quote": "“They get to make as many turnovers as humanly possible. And for everybody else, we just cannot turn the ball over. It’s just the way that it is.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881099/2025/12/11/golden-state-warriors-turnover-problems-stephen-curry-jimmy-butler/", "tags": ["Golden State Warriors", "Stephen Curry", "Jimmy Butler", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-11", "text": "The Warriors have the second-most turnovers in the NBA, behind only Portland. They’re the only teams already over 400. Golden State’s 16 per game is tied for the 26th-worst total in the league. The Warriors’ turnovers have led to 469 points for the opponent. Only the Wizards (474) have surrendered more points.“I have zero doubt,” Kerr said, “that the No. 1 thing that is keeping us from consistently winning is our turnovers. Zero doubt. The numbers show it. The tape shows it.”New York Times", "quote": "“I have zero doubt,” Kerr said, “that the No. 1 thing that is keeping us from consistently winning is our turnovers. Zero doubt. The numbers show it. The tape shows it.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881099/2025/12/11/golden-state-warriors-turnover-problems-stephen-curry-jimmy-butler/", "tags": ["Golden State Warriors", "Steve Kerr"]}, {"date": "", "archive_date": "2025-12-11", "text": "Mark Haynes: Sources tell the @SacObserver that rookie Nique Clifford ( @NiqueOtn )will start for the Sacramento Kings tonight against the Nuggets.x.com", "quote": "will start for the Sacramento Kings tonight against the Nuggets", "outlet": "x.com", "source_url": "https://x.com/markhaynesnba/status/1999205208635965912", "tags": ["Denver Nuggets", "Sacramento Kings", "Nique Clifford"]}, {"date": "", "archive_date": "2025-12-11", "text": "Rod Boone: NEWS:Josh Green is not on the #Hornets injury report for tomorrow's game against Chicago. LaMelo and Tre Mann are OUT.x.com", "quote": "Josh Green is not on the #Hornets injury report for tomorrow's game against Chicago", "outlet": "x.com", "source_url": "https://x.com/rodboone/status/1999238759058203051", "tags": ["Charlotte Hornets", "Chicago Bulls", "Injuries", "Josh Green", "Tre Mann"]}, {"date": "", "archive_date": "2025-12-11", "text": "Arizona Sports:Devin Booker will be back either Sunday against the Lakers or next Thursday against the Warriors,@Gambo987 reports. Jalen Green is tracking toward a return just after Christmas.x.com", "quote": "Devin Booker will be back either Sunday against the Lakers or next Thursday against the Warriors,", "outlet": "x.com", "source_url": "https://x.com/AZSports/status/1999230097518395538", "tags": ["Golden State Warriors", "Los Angeles Lakers", "Phoenix Suns", "Injuries", "Devin Booker", "Jalen Green"]}, {"date": "", "archive_date": "2025-12-11", "text": "Shams Charania:Memphis Grizzlies center Zach Edey will be re-evaluated in four weeks with a stress reaction in his left ankle.\"This is a management plan to optimize Zach's long-term health in consultation with the Grizzlies and medical experts,\" Mark Bartelstein of @PrioritySports tells ESPN.x.com", "quote": "Memphis Grizzlies center Zach Edey will be re-evaluated in four weeks with a stress reaction in his left ankle.", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/1999222544126058876", "tags": ["Memphis Grizzlies", "Mark Bartelstein", "Injuries", "Zach Edey"]}, {"date": "", "archive_date": "2025-12-11", "text": "Damichael Cole:Zach Edey recently told me that he was dealing with some soreness after games in his ankle, but it didn’t sound like major thing.Not sure if this is related, but this is a major gut-punch after Memphis started going on a run with Edey back.x.com", "quote": "Zach Edey recently told me that he was dealing with some soreness after games in his ankle, but it didn’t sound like major thing.", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1999223391358976249", "tags": ["Memphis Grizzlies", "Injuries", "Zach Edey"]}, {"date": "", "archive_date": "2025-12-11", "text": "Morant, who has been dealing with a right calf strain suffered from a game on Nov. 15 against the Cleveland Cavaliers, was a full participant in a Grizzlies practice on Dec. 11. \"He was able to go through the whole practice today, which is very encouraging,\" Grizzlies coach Tuomas Iisalo said. \"Now we'll see how his body responds to it, then we can make the decision.\"Memphis Commercial Appeal", "quote": "Morant, who has been dealing with a right calf strain suffered from a game on Nov. 15 against the Cleveland Cavaliers, was a full participant in a Grizzlies practice on Dec. 11", "outlet": "Memphis Commercial Appeal", "source_url": "https://www.commercialappeal.com/story/sports/nba/grizzlies/2025/12/11/ja-morant-injury-update-memphis-grizzlies-return-jazz/87720451007/", "tags": ["Cleveland Cavaliers", "Memphis Grizzlies", "Injuries", "Ja Morant", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-11", "text": "NBA Communications:The Athletic’s suggestion that an increase in games missed by star players is related to the early-season schedule is inaccurate and misleading.https://nytimes.com/athletic/6854109/2025/12/02/nba-cup-schedule-egor-demin-nets/ Here are the facts:x.com", "quote": "The Athletic’s suggestion that an increase in games missed by star players is related to the early-season schedule is inaccurate and misleading.", "outlet": "x.com", "source_url": "https://x.com/NBAPR/status/1999132138097045538", "tags": ["Media", "Injuries"]}, {"date": "", "archive_date": "2025-12-11", "text": "NBA on ESPN:Former NBA player, Jason Collins, was diagnosed with Stage 4 Glioblastoma this summer. Jason and his husband, Brunson, traveled to Singapore to try an experimental treatment that will give him more time. @ramonashelburne was able to sit down with him as he talks about his journey ❤️x.com", "quote": "Former NBA player, Jason Collins, was diagnosed with Stage 4 Glioblastoma this summer. Jason and his husband, Brunson, traveled to Singapore to try an experimental treatment that will give him more time", "outlet": "x.com", "source_url": "https://x.com/ESPNNBA/status/1999222272939196683", "tags": ["Jason Collins", "Health"]}]