[{"date": "", "archive_date": "2025-12-10", "text": "“We are only 5 1/2 games away from the third seed, so I don’t think it’s time to panic personally; I think it’s time to be aware,” Turner said.“I think being aware and panicking are two very different things. Just aware that we’re not where we want to be, but we’re also not far away. “With the group we have right now, I think that we’re very capable of making an extra push. But we can talk about it all we want to; it’s a matter of going out there and getting it done.”New York Times", "quote": "“We are only 5 1/2 games away from the third seed, so I don’t think it’s time to panic personally; I think it’s time to be aware,” Turner said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6876971/2025/12/10/bucks-offensive-players-kevin-porter-myles-turner-giannis/", "tags": ["Milwaukee Bucks", "Myles Turner"]}, {"date": "", "archive_date": "2025-12-10", "text": "Eric Nehm: Following today's practice, Kevin Porter Jr. was asked about the latest batch of reporting about Giannis Antetokounmpo and the Bucks on Tuesday. Porter: \"This is the last thing I'm going to say on false information.At the end of the day, everyone needs to wait until Giannis says something because all this is just he say, she say and I guarantee when we start winning and we go 8-0, 9-0, you won't see nothing about the Bucks.You won't see, 'Oh, the Bucks are 8-0, 9-0, they're flourishing and Giannis is...\" We're not going to see any of that positive news, so at least for me, this is the last time I'm going to answer anything false.\"x.com", "quote": "At the end of the day, everyone needs to wait until Giannis says something because all this is just he say, she say and I guarantee when we start winning and we go 8-0, 9-0, you won't see nothing about the Bucks.", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/1998853010454360330?s=20", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo", "Kevin Porter"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jon Krawczynski:Important clarification on Rudy Gobert's flagrant foul points (he is 1 away from a suspension, 2 away from a two-game suspension):The points DO reset for the playoffs. So once they get there, it will go back to 0, per the NBA.x.com", "quote": "Important clarification on Rudy Gobert's flagrant foul points (he is 1 away from a suspension, 2 away from a two-game suspension):", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1998862500239126997", "tags": ["Minnesota Timberwolves", "Rudy Gobert", "Suspensions"]}, {"date": "", "archive_date": "2025-12-10", "text": "Batum and Atkinson’s relationship has extended beyond just the NBA. Both grew close during their time together out west, and they reconnected last summer at the 2024 Paris Olympics on the same sidelines with Équipe de France de basketball.“We ended up on the national team because we never stopped talking about it, and he ended up with us, and that was great,” Batum said. “French guys, they all play,” Atkinson said. “They play for their national team, and that's not every country. A lot of the other countries, guys sit out. The French guys play, and he was our captain with Team France.”Responsible Gaming", "quote": "“We ended up on the national team because we never stopped talking about it, and he ended up with us, and that was great,” Batum said", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/batum-credits-longevity-to-adaptability-praises-chris-paul", "tags": ["Cleveland Cavaliers", "Los Angeles Clippers", "Nicolas Batum", "Kenny Atkinson"]}, {"date": "", "archive_date": "2025-12-10", "text": "“He's one of my favorites of all time,” Lue added.“He's right up there with Delly (Matthew Dellavedova). Just guys all for the team, whatever you need, no problem.Great in the locker room, great with the younger guys. It's never about him. It's always about the team and whatever we need. He's unbelievable.”Responsible Gaming", "quote": "“He's right up there with Delly (Matthew Dellavedova). Just guys all for the team, whatever you need, no problem.", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/batum-credits-longevity-to-adaptability-praises-chris-paul", "tags": ["Los Angeles Clippers", "Tyronn Lue", "Nicolas Batum", "Matthew Dellavedova"]}, {"date": "", "archive_date": "2025-12-10", "text": "Khobi Price:Rui Hachimura thinks he bought a car with the $500K Lakers players received after winning the inaugural NBA Cup two years ago. Said he was originally going to bet all of the prize pool money on black on roulette, but had second thoughts. \"I got scared. I’m not going to lie.”x.com", "quote": "Rui Hachimura thinks he bought a car with the $500K Lakers players received after winning the inaugural NBA Cup two years ago", "outlet": "x.com", "source_url": "https://x.com/khobi_price/status/1998844162888827355", "tags": ["Los Angeles Lakers", "Rui Hachimura", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "Cooper Flagg, who displays more confidence by playing than bragging about himself, simply described his highlight as “just another one of those plays.” Others viewed that viral moment during a recent Mavs win over the Clippers much differently.“That dunk that he had over Ivica Zubac was probably one of the few best dunks that he’s had all year. So you see his potential in being an NBA superstar,” Mavericks guard Klay Thompson said. “Cooper’s upside is limitless. He has every tool to be great.”athlonsports.com", "quote": "“That dunk that he had over Ivica Zubac was probably one of the few best dunks that he’s had all year. So you see his potential in being an NBA superstar,” Mavericks guard Klay Thompson said. “Cooper’s upside is limitless. He has every tool to be great.”", "outlet": "athlonsports.com", "source_url": "https://athlonsports.com/nba/dallas-mavericks/cooper-flagg-already-developing-legitimate-superstar", "tags": ["Dallas Mavericks", "Klay Thompson", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-10", "text": "Flagg produced highlight reels with his high-flying dunks. Yet, he also showed strong fundamentals. Flagg defended both guards and forwards well because of his quickness and strength. Yet, he also thrived because of how he studied personnel. Just over a quarter of the way into his rookie season, the 18-year-old Flagg has displayed those traits consistently with Dallas.“He doesn’t skip a beat,” Mavericks coach Jason Kidd said of Flagg. “He’s only 18 years old. But it seems like he’s been in this league before. He plays the game the right way.”athlonsports.com", "quote": "“He doesn’t skip a beat,” Mavericks coach Jason Kidd said of Flagg. “He’s only 18 years old. But it seems like he’s been in this league before. He plays the game the right way.”", "outlet": "athlonsports.com", "source_url": "https://athlonsports.com/nba/dallas-mavericks/cooper-flagg-already-developing-legitimate-superstar", "tags": ["Dallas Mavericks", "Jason Kidd", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-10", "text": "“He’s done a really good job with staying positive, having a really good outlook on things and taking things game by game,” Flagg’s trainer, Matt MacKenzie, told Athlon Sports.“I’ve been very happy with that. We’ve really just tried to be in his corner and help support him with all of the different things that he’s had to navigate in regard to being a pro.”athlonsports.com", "quote": "“I’ve been very happy with that. We’ve really just tried to be in his corner and help support him with all of the different things that he’s had to navigate in regard to being a pro.”", "outlet": "athlonsports.com", "source_url": "https://athlonsports.com/nba/dallas-mavericks/cooper-flagg-already-developing-legitimate-superstar", "tags": ["Dallas Mavericks", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-10", "text": "Dave McMenamin:LAL will host SAS on their standard court in the NBA Cup quarterfinals, sources told ESPN. Players had issues w/ the slippery surface of the alternate bright yellow Cup court during the group stage. A league source told ESPN the decision was made “out of an abundance of caution”x.com", "quote": "LAL will host SAS on their standard court in the NBA Cup quarterfinals, sources told ESPN. Players had issues w/ the slippery surface of the alternate bright yellow Cup court during the group stage. A league source told ESPN the decision was made “out of an abundance of caution”", "outlet": "x.com", "source_url": "https://x.com/mcten/status/1998857722893316307?s=20", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-10", "text": "Ira Winderman:Pelle Larsson MRI today showed a left ankle sprain, with the team expectation of being out a week or so, but not the worst-case prognosis that had been feared. Heat wit five games over the next two weeks. Response to treatment will determine length of absence.x.com", "quote": "Pelle Larsson MRI today showed a left ankle sprain, with the team expectation of being out a week or so, but not the worst-case prognosis that had been feared. Heat wit five games over the next two weeks. Response to treatment will determine length of absence", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/1998857462020202881?s=20", "tags": ["Miami Heat", "Injuries", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-10", "text": "KC Johnson:Billy Donovan had impassioned defense of Nikola Vucevic today: \"I do think he's invested and committed.\"Said Vucevic unsolicited asked to meet with Donovan after recent loss \"to talk about how he can help the group or how he sees areas of improvement for our team.\"x.com", "quote": "Billy Donovan had impassioned defense of Nikola Vucevic today: \"I do think he's invested and committed.\"", "outlet": "x.com", "source_url": "https://x.com/KCJHoop/status/1998838663447273937?s=20", "tags": ["Chicago Bulls", "Nikola Vucevic", "Billy Donovan"]}, {"date": "", "archive_date": "2025-12-10", "text": "Joel Lorenzi: Billy Donovan went long today:“People wanna sit there and say, ‘Well, you lost to New Orleans. They got a bad a record.’ Indiana, bad record. I don’t think we’re any different from those teams. We’re not just gifted to walk in there (and) if we show up, we’ll win games. … I do not view it that way at all when I watch tape.”x.com", "quote": "“People wanna sit there and say, ‘Well, you lost to New Orleans. They got a bad a record.’ Indiana, bad record. I don’t think we’re any different from those teams. We’re not just gifted to walk in there (and) if we show up, we’ll win games. … I do not view it that way at all when I watch tape.”", "outlet": "x.com", "source_url": "https://x.com/JoelXLorenzi/status/1998835147454742805?s=20", "tags": ["Chicago Bulls", "Indiana Pacers", "New Orleans Pelicans", "Billy Donovan"]}, {"date": "", "archive_date": "2025-12-10", "text": "Joel Lorenzi: Donovan on Bulls’ inability to uphold their playstyle through recent skid:“I’m not looking at film saying, ‘Oh, Kevin Huerter’s out, Zach Collins is out. Boy, if HE was here, this would be different.’ I don’t believe that. Some of it’s, like, inbounding the basketball. What do these guys being out have to do with that? What is five guys running back in transition, talking and communicating, have to do with anybody being out?”x.com", "quote": "“I’m not looking at film saying, ‘Oh, Kevin Huerter’s out, Zach Collins is out. Boy, if HE was here, this would be different.’ I don’t believe that. Some of it’s, like, inbounding the basketball. What do these guys being out have to do with that? What is five guys running back in transition, talking and communicating, have to do with anybody being out?”", "outlet": "x.com", "source_url": "https://x.com/JoelXLorenzi/status/1998836936295805219?s=20", "tags": ["Chicago Bulls", "Billy Donovan", "Zach Collins", "Kevin Huerter"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jon Krawczynski:Rudy Gobert on the Flagrant-2: \"Very surprised because I don’t think there was any intent of getting anybody hurt. There was an intent to foul, but I don’t feel like it was meant to really hit him in the rib to hurt him. It was more to take away his momentum and contest the shot.\"x.com", "quote": "Rudy Gobert on the Flagrant-2: \"Very surprised because I don’t think there was any intent of getting anybody hurt. There was an intent to foul, but I don’t feel like it was meant to really hit him in the rib to hurt him. It was more to take away his momentum and contest the shot.\"", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1998837217855225898?s=20", "tags": ["Minnesota Timberwolves", "Referees", "Officiating", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-10", "text": "Jon Krawczynski: Rudy 1 pt away from suspension:\"I’ve never, not once in my life, intended to get anybody injured with the way I play. I’m going to keep being who I am, do what I’m supposed to do for my team and do it with integrity, which is what I’ve always done throughout my whole career.\"x.com", "quote": "\"I’ve never, not once in my life, intended to get anybody injured with the way I play. I’m going to keep being who I am, do what I’m supposed to do for my team and do it with integrity, which is what I’ve always done throughout my whole career.\"", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1998838102878490649?s=20", "tags": ["Minnesota Timberwolves", "Referees", "Officiating", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-10", "text": "For card collectors, a lot is at stake with Panini’s lawsuit against Fanatics. The case could determine which entities will shape the future of the sports card industry. Panini is asking a U.S. District Court to divest all league licenses, as well as Topps (the Topps portion has been dismissed in court), from Fanatics to “restore competition” within the industry. If a verdict goes in Panini’s favor, this could place all of Fanatics’ sports licenses back up for sale.Asked for comment, Panini referred The Athletic to Stuart Singer, the company’s legal counsel in the Fanatics litigation. Singer confirmed Panini was potentially open to a sale, saying: “Panini, like other companies, considers its strategic options. There is no agreement in place for sale at the company. No negotiations presently for the sale of the company.”New York Times", "quote": "Asked for comment, Panini referred The Athletic to Stuart Singer, the company’s legal counsel in the Fanatics litigation. Singer confirmed Panini was potentially open to a sale, saying: “Panini, like other companies, considers its strategic options. There is no agreement in place for sale at the company. No negotiations presently for the sale of the company.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6862085/2025/12/09/sports-trading-cards-panini-fanatics/", "tags": ["Law", "Trading Cards"]}, {"date": "", "archive_date": "2025-12-10", "text": "Statements made by Panini inside a private sales pitch meeting, as well as within a 90-page confidential document given to potential buyers earlier this year and seen by The Athletic, raise questions about Panini’s court claims that the company would be seriously harmed without NFL, NBA and other top league licenses — the key to allowing team names and logos to appear on sports cards.In its ongoing lawsuit against Fanatics, Panini claims that “any firm that fails to win the rights to produce and sell trading cards for players of at least one of the Leagues (MLB, NFL, NBA) is eliminated as a competitor” in those markets.New York Times", "quote": "In its ongoing lawsuit against Fanatics, Panini claims that “any firm that fails to win the rights to produce and sell trading cards for players of at least one of the Leagues (MLB, NFL, NBA) is eliminated as a competitor” in those markets", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6862085/2025/12/09/sports-trading-cards-panini-fanatics/", "tags": ["Law", "Trading Cards"]}, {"date": "", "archive_date": "2025-12-10", "text": "In my Copycat Candidates ranking, I had the Bucks near the top of the league in potential to go with a double-big lineup as Giannis Antetokounmpo and Myles Turner netted out as the second best big pairing, only behind Denver’s Nikola Jokić and Jonas Valančiūnas. While Jokić and Valančiūnas rarely play together (as I’ll get to in the Western Conference lineup breakdown next week),Doc Rivers has leaned into double-big play. Outside of a stretch of six games midway through the season-to-date, almost all of Giannis and Turner’s minutes have been played together. That strategy is working - the Bucks outscore their opponents by 9.4 points per 100 possessions with their two bigs on the court. The problem is, that’s mostly Giannis. The Bucks are still +4.9 when Giannis plays without Turner, but they are significantly negative whenever Giannis sits, regardless of what Turner is doing. So far, when Giannis misses games the Bucks are 1-6.Charting Hoops", "quote": "In my Copycat Candidates ranking, I had the Bucks near the top of the league in potential to go with a double-big lineup as Giannis Antetokounmpo and Myles Turner netted out as the second best big pairing, only behind Denver’s Nikola Jokić and Jonas Valančiūnas. While Jokić and Valančiūnas rarely play together (as I’ll get to in the Western Conference lineup breakdown next week),", "outlet": "Charting Hoops", "source_url": "https://chartinghoops.substack.com/p/nba-lineup-patterns-the-east", "tags": ["Denver Nuggets", "Milwaukee Bucks", "Doc Rivers", "Giannis Antetokounmpo", "Myles Turner"]}, {"date": "", "archive_date": "2025-12-10", "text": "The Detroit Pistons, on the other hand, are almost too deep (they may be in the market to make a consolidation trade for Giannis to fix that “problem”). There is a lot of orange and yellow all the way down the Pistons’ heatmap, to Paul Reed, who, as Max Moacanin recently pointed out, is sneakily one of the most efficient players in the entire league.That allows the Pistons to employ a soothingly symmetrical rotation pattern for their starters. Notice how J.B. Bickerstaff staggers his first and final rotations, subbing out Thompson first, then Harris, Robinson, Duren, and finally Cade Cunningham. The pattern repeats itself in reverse in the fourth quarter, as Cade checks back in first among the starters, followed in order by Robinson, Harris, Duren, and Thompson.Charting Hoops", "quote": "That allows the Pistons to employ a soothingly symmetrical rotation pattern for their starters. Notice how J.B. Bickerstaff staggers his first and final rotations, subbing out Thompson first, then Harris, Robinson, Duren, and finally Cade Cunningham. The pattern repeats itself in reverse in the fourth quarter, as Cade checks back in first among the starters, followed in order by Robinson, Harris, Duren, and Thompson", "outlet": "Charting Hoops", "source_url": "https://chartinghoops.substack.com/p/nba-lineup-patterns-the-east", "tags": ["Detroit Pistons", "Miami Heat", "Milwaukee Bucks", "Giannis Antetokounmpo", "Paul Reed", "Cade Cunningham"]}, {"date": "", "archive_date": "2025-12-10", "text": "Sebastian Telfair:I just had this up and down period over the last couple of years with going through my situations where I kind of blamed basketball. It took me five, six years to get back to even touching a basketball. It's definitely was some time where I ain't even want to be around a basketball, watch basketball, or definitely shoot a basketball.I was just basically blaming basketball and everything. Like, if I wasn't a basketball player, like I wouldn't be going through this, which is immature, but there's definitely some truth to it. But that's where I'm at today still. I thought I'd be get out of that space, but going back into federal court through my probation right now is like putting me right back in the same space a little bit.YouTube", "quote": "I just had this up and down period over the last couple of years with going through my situations where I kind of blamed basketball. It took me five, six years to get back to even touching a basketball. It's definitely was some time where I ain't even want to be around a basketball, watch basketball, or definitely shoot a basketball.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=KAqocCNkRyE", "tags": ["Sebastian Telfair"]}, {"date": "", "archive_date": "2025-12-10", "text": "Tim MacMahon:I will also just say as a quick aside, as you're going to the trade machine over the next what is it, a couple of months here, don't bother putting Dylan Harper and Stephon Castle in any trades.And if that means you can't come up with things to get uh some huge blockbuster done for the Spurs, I would say, yeah, that's right. Those guys are going to be in San Antonio, I believe, for a long, long time. I think they've got this generation's version of Duncan, Parker and Ginobili.YouTube", "quote": "I will also just say as a quick aside, as you're going to the trade machine over the next what is it, a couple of months here, don't bother putting Dylan Harper and Stephon Castle in any trades.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WYI0uZvmWEs&t=2382s", "tags": ["San Antonio Spurs", "Trade", "Stephon Castle", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-10", "text": "Tim MacMahon:My biggest criticism, frankly, of the Suns since the end of last season, they should have pounced on the deal from the New Orleans Pelicans. The Pelicans were calling every team about Derik Queen trying to move up. For the Suns to be able to get another star, that's the kind of trade that they probably have to make. But again, all their goals entering the season that the Suns are well on their way to accomplishing.YouTube", "quote": "My biggest criticism, frankly, of the Suns since the end of last season, they should have pounced on the deal from the New Orleans Pelicans. The Pelicans were calling every team about Derik Queen trying to move up. For the Suns to be able to get another star, that's the kind of trade that they probably have to make. But again, all their goals entering the season that the Suns are well on their way to accomplishing", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WYI0uZvmWEs&t=2176s", "tags": ["New Orleans Pelicans", "Phoenix Suns", "Trade"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brian Windhorst:I mentioned Mikal Bridges. A lot of people talk about the trade. I get it. Not everybody loved that extension that he signed over the summer, even though I think the Knicks were pretty happy to get him at that number. He's having an excellent season.He's shooting his highest I think in four or five years, shooting over 40% from three, 41% from three going into tonight, averaging more than a block a game and two steals a game. His plus minus has just routinely been really good.YouTube", "quote": "I mentioned Mikal Bridges. A lot of people talk about the trade. I get it. Not everybody loved that extension that he signed over the summer, even though I think the Knicks were pretty happy to get him at that number. He's having an excellent season.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=WYI0uZvmWEs&t=482s", "tags": ["New York Knicks", "Mikal Bridges"]}, {"date": "", "archive_date": "2025-12-10", "text": "Danny Green:If I'm Giannis Antetokounmpo, I'm looking where I can extend my career and will play the longest and also win. He should really be taking San Antonio into consideration. If he's alongside Wemby and company, they have a lot of pieces and picks to be able to do it. I know Miami is one of the teams that's looking to get him.It's a good city where kind of fair on the State taxes, so you're going to save more of your money there. And it's a major market. I know Toronto is another good city for him that would fit. And some people play with the idea which I would hate to see this, but they could do it. I mean, OKC could do it. They have everybody's picks. They have a lot of pieces. It would make them an unbelievable super team, but nobody wants to see the Durant-Warriors thing all over again. I would think for him like to make his own or have his own path and not just jump on a championship team. He should be considering like San Antonio, Miami, Toronto, like those three teams could be and also Detroit, him and Cade Cunningham could be a nice little mix if they can keep Jalen Duren.YouTube", "quote": "If I'm Giannis Antetokounmpo, I'm looking where I can extend my career and will play the longest and also win. He should really be taking San Antonio into consideration. If he's alongside Wemby and company, they have a lot of pieces and picks to be able to do it. I know Miami is one of the teams that's looking to get him.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=r0vpUsfozJA", "tags": ["Detroit Pistons", "Golden State Warriors", "Miami Heat", "Milwaukee Bucks", "San Antonio Spurs", "Toronto Raptors", "Trade", "Danny Green", "Giannis Antetokounmpo", "Cade Cunningham", "Jalen Duren"]}, {"date": "", "archive_date": "2025-12-10", "text": "Moritz Wagner:I'm very privileged, of course. Yes, well, we have a lot of money. We lack nothing. And when I preach this on this topic, I understand that 80% of the people listening probably think, \"Well, it's easy for him to say that.\"That's what I would think if I were to listen to myself right now. That's why I always shy away from this topic a little . But here I am being completely honest, this falls under the category of how people fool themselves. The thing about money and this constant need for more and more, there are also huge cultural differences. Well, that's even more prevalent in America. I was in Brazil once and a friend of mine tried to work in Rio de Janeiro, and he told me back then that nobody in South America wants to work at all. For them, a successful day is when they do their push-ups on the beach and then afterwards, have a beer and a steak on the beach and sleep well at 4 a.m., and then the same routine starts again at 11 a.m. So, of course there's also a cultural difference, but this constant \"more and more ,\" this money issue, I think what you shouldn't forget is that I want to live my life, no matter how much money I ever make, money is a means to an end for me.YouTube", "quote": "I'm very privileged, of course. Yes, well, we have a lot of money. We lack nothing. And when I preach this on this topic, I understand that 80% of the people listening probably think, \"Well, it's easy for him to say that.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=O4d-61eKhaA", "tags": ["Orlando Magic", "Moritz Wagner"]}, {"date": "", "archive_date": "2025-12-10", "text": "Shams Charania:Dallas Mavericks center Dereck Lively II will undergo season-ending right foot procedure to address lingering discomfort,sources tell me and Tim MacMahon. Lively, who played 7 games this season, is expected to make a full recovery.x.com", "quote": "Dallas Mavericks center Dereck Lively II will undergo season-ending right foot procedure to address lingering discomfort,", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/1998799884321960239?s=20", "tags": ["Dallas Mavericks", "Injuries", "Dereck Lively"]}, {"date": "", "archive_date": "2025-12-10", "text": "Tim MacMahon:Dereck Lively II is out for the season. He got second and third opinions to attempt to avoid surgery, but he needs another operation to repair his right foot.x.com", "quote": "Dereck Lively II is out for the season. He got second and third opinions to attempt to avoid surgery, but he needs another operation to repair his right foot", "outlet": "x.com", "source_url": "https://x.com/BannedMacMahon/status/1998800542227984630?s=20", "tags": ["Dallas Mavericks", "Injuries", "Dereck Lively"]}, {"date": "", "archive_date": "2025-12-10", "text": "THE OPEN INVITATION quickly turned into an expectation during Chris Paul's only season on the Oklahoma City Thunder roster. On off nights when the Thunder were home, the team's players were all welcome at Paul's place, where the future Hall of Famer lived alone while his family stayed in Los Angeles that 2019-20 season. His chef would prepare a healthy and hearty dinner -- vegan for Paul and other options for his guests -- and the players would eat and watch that night's NBA action. Those nights became routine for a few of the Thunder's youngest players, including promising second-year guard Shai Gilgeous-Alexander and raw, undrafted rookie Luguentz Dort, the only two players remaining on Oklahoma City's roster from that season. They'd settle into the couches, viewing one game on the big screen and another on Paul's iPad, and soak up the wisdom of one of this generation's smartest basketball minds.\"We'd just be chilling,\" Gilgeous-Alexander told ESPN recently. \"But how we used to watch the games, he was never, like, just watching them. He was always watching 'em to learn.\"ESPN", "quote": "\"We'd just be chilling,\" Gilgeous-Alexander told ESPN recently. \"But how we used to watch the games, he was never, like, just watching them. He was always watching 'em to learn.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "Paul also watched the games to teach. He would constantly engage his regular guests -- a group that also included then-rookie forward Darius Bazley -- in basketball banter. They'd talk about the tendencies of players they were watching. Paul would frequently focus on specific actions teams would run and discuss defensive tactics the Thunder might use against those schemes.\"It was nothing crazy, to tell you the truth,\" Paul told ESPN. \"It was more so just camaraderie.\"ESPN", "quote": "\"It was nothing crazy, to tell you the truth,\" Paul told ESPN. \"It was more so just camaraderie.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Darius Bazley", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "But it was embraced and appreciated in Oklahoma City, where Paul helped plant some seeds that are blossoming into a potential dynasty several years later. Lessons learned from Paul have played small roles in Gilgeous-Alexander ascending into an MVP and Dort developing into one of the league's premier 3-and-D role players. Habits instilled by following Paul's lead became part of the franchise's fabric during the Thunder's journey from a rebuilding project to a champion.\"Chris really was the first person to show me what it meant to be a professional,\" Gilgeous-Alexander said. \"He was always doing extra. It was more so off the court than on the court. It was the things you don't think about as a kid. As a kid, you're taught to just work super hard, but you're not really taught nutrition and taking care of your body, getting massages, getting treatment, those type of things he was always on top of. \"He just always had a get-better mentality in every way, in every way of life.\"ESPN", "quote": "\"Chris really was the first person to show me what it meant to be a professional,\" Gilgeous-Alexander said. \"He was always doing extra. It was more so off the court than on the court. It was the things you don't think about as a kid. As a kid, you're taught to just work super hard, but you're not really taught nutrition and taking care of your body, getting massages, getting treatment, those type of things he was always on top of", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years. Paul made sure that Dort had access to Second Spectrum, a subscription service used by NBA teams, and tutored him on how to filter clips by using specific searches by play categories or statistics. And Paul often watched film with Dort, pointing out nuances he should notice and advising him on how to take notes.\"Being CP3's rook, honestly, it was amazing, especially in the position that I was in on a two-way,\" Dort told ESPN. \"Obviously, Chris is Chris, and me coming out of college, I see Chris as a big superstar. So at first we didn't have that many conversations, but as I got more with the team, we got closer and I could see what type of guy Chris really was. And he was a great dude, honestly. Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years.Paul made sure that Dort had access to Second Spectrum, a subscription service used by NBA teams, and tutored him on how to filter clips by using specific searches by play categories or statistics. And Paul often watched film with Dort, pointing out nuances he should notice and advising him on how to take notes. \"He taught me a lot, a real leader, real vocal on the court. \"ESPN", "quote": "\"Being CP3's rook, honestly, it was amazing, especially in the position that I was in on a two-way,\" Dort told ESPN. \"Obviously, Chris is Chris, and me coming out of college, I see Chris as a big superstar. So at first we didn't have that many conversations, but as I got more with the team, we got closer and I could see what type of guy Chris really was. And he was a great dude, honestly. Paul wanted Dort to have the tools he needed to properly study the game, so he bought the iPad for him, as the 12-time All-Star has done for a lot of rookie teammates over the years.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47258039/how-chris-paul-helped-shape-oklahoma-city-thunder-budding-dynasty", "tags": ["Oklahoma City Thunder", "Chris Paul", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-10", "text": "Anthony Chiang:The Heat has posted the league's 29th-ranked (second-worst) offensive rating during this four-game skid.x.com", "quote": "The Heat has posted the league's 29th-ranked (second-worst) offensive rating during this four-game skid", "outlet": "x.com", "source_url": "https://x.com/Anthony_Chiang/status/1998789700702855551", "tags": ["Miami Heat", "Statistics"]}, {"date": "", "archive_date": "2025-12-10", "text": "Brian Jungreis, Malik Beasley’s agent, tells Front Office Sports that there have been talks with the European club, but the two sides are far from securing a deal.“These are exaggerated reports. We had conversations and some framework, but nowhere close to anything closing or happening for the moment,” Jungreis tells FOS.Front Office Sports", "quote": "Brian Jungreis, Malik Beasley’s agent, tells Front Office Sports that there have been talks with the European club, but the two sides are far from securing a deal.", "outlet": "Front Office Sports", "source_url": "https://frontofficesports.com/malik-beasleys-agent-calls-euroleague-report-exaggerated/", "tags": ["Free Agency", "Euroleague", "Serbia", "Malik Beasley"]}, {"date": "", "archive_date": "2025-12-10", "text": "He also shot down the idea that Beasley would sign an overseas contract without an option to return to the NBA.“The report of no NBA out is 100% inaccurate. We’d never not have that in the case he were to play anywhere else than the NBA,” Jungreis said. In a video posted on social media last month, Beasley admitted that he could play overseas, but has continued to wait for an NBA opportunity.Front Office Sports", "quote": "“The report of no NBA out is 100% inaccurate. We’d never not have that in the case he were to play anywhere else than the NBA,” Jungreis said", "outlet": "Front Office Sports", "source_url": "https://frontofficesports.com/malik-beasleys-agent-calls-euroleague-report-exaggerated/", "tags": ["Free Agency", "Euroleague", "Serbia", "Malik Beasley"]}, {"date": "", "archive_date": "2025-12-10", "text": "Eurohoops:??️ Malik Beasley said he’s not going to Serbia despite the rumours that he's nearing a deal with Partizan.Instagram", "quote": "??️ Malik Beasley said he’s not going to Serbia despite the rumours that he's nearing a deal with Partizan.", "outlet": "Instagram", "source_url": "https://www.instagram.com/p/DSCOhM5iCFD/?img_index=2", "tags": ["Free Agency", "Euroleague", "Serbia", "Malik Beasley"]}, {"date": "", "archive_date": "2025-12-10", "text": "Derik Queen hears what people are saying about him and the trade that still surprises the NBA. \"I've been [hearing] it all my life,\" Queen said. \"Like everybody hated me [before the season started]. I played a little bit at the beginning, and the whole media was hating me.And then once I got to that Charlotte game [and had 12 points, eight rebounds and seven assists on Nov. 4], the whole media started liking me. \"[I'm used to] pretty much people not liking me at one moment, then liking me later on in life.\"ESPN", "quote": "And then once I got to that Charlotte game [and had 12 points, eight rebounds and seven assists on Nov. 4], the whole media started liking me. \"[I'm used to] pretty much people not liking me at one moment, then liking me later on in life.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47190959/new-orleans-pelicans-derik-queen-jeremiah-fears-zion-williamson-willie-green", "tags": ["New Orleans Pelicans", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-10", "text": "\"We looked at the lottery this year and said, 'Wow, it'd be great if we could get both of those guys, and it may cost us,'\" Dumars said. \"But if you truly believe they can be foundational pieces for your success long term, then we'll do what we have to do. It simply came down to we have this guard that we really, really love and this young big that we really, really love. Let's go for it. \"I know we paid a big price for it, but it's not like we're unhappy with what we got. We like what we have as foundational pieces for the long term here.\"Through the first 25 games, Fears and Queen have combined to score the fourth-most points by any rookie duo in the past 15 seasons, according to Elias Sports Bureau. \"We're only Year 1 into this,\" Fears told ESPN. \"We got a lot more to go. But we going to continue to show everybody we have something special in New Orleans.\"ESPN", "quote": "Through the first 25 games, Fears and Queen have combined to score the fourth-most points by any rookie duo in the past 15 seasons, according to Elias Sports Bureau. \"We're only Year 1 into this,\" Fears told ESPN. \"We got a lot more to go. But we going to continue to show everybody we have something special in New Orleans.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47190959/new-orleans-pelicans-derik-queen-jeremiah-fears-zion-williamson-willie-green", "tags": ["New Orleans Pelicans", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-10", "text": "\"We had a conversation about this in our coaches meeting this morning,\" Raptors head coach Darko Rajaković said before the Raptors and Knicks faced off in New York late last month. \"Jalen Brunson is the type of player I can put in the same conversations as Luka Dončić and Nikola Jokić. They’re guys who just play at their own pace. You can’t speed them up. Their awareness is amazing. At every point in time, they know where the hand of the defensive player is, what is the footwork, how they can get by somebody, how they can get to their sweet spots on the floor. … He’s elite.\"Just like you said, he’s not the fastest, not the strongest, but his skill level and shooting ability is amazing. It makes him one of the biggest offensive weapons in the league.\"New York Times", "quote": "\"Just like you said, he’s not the fastest, not the strongest, but his skill level and shooting ability is amazing. It makes him one of the biggest offensive weapons in the league.\"", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6877787/2025/12/10/knicks-raptors-jalen-brunson-nba-cup-quarterfinals/", "tags": ["New York Knicks", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-10", "text": "“The versatility, Shai Gilgeous-Alexander — the versatility of these guys is what allows us to be really, really, broad in what we do,” Daigneault said. “And we try to take advantage of that. We try not to be very rigid. So, we’re learning all those things, remaining unpredictable.” The Thunder have a long way to go towards maintaining this impressive start defensively, but there are reasons to believe Oklahoma City’s defensive success can become even more historic.The Thunder could become the first post-ABA merger team (since 1976-77) to be 10 points per 100 possessions better defensively than the league average.Per Basketball Reference, the NBA leaguewide offensive efficiency rating is 115.8 points per 100 possessions, 0.5 points higher than the record-high set in the 2023-24 season.New York Times", "quote": "The Thunder could become the first post-ABA merger team (since 1976-77) to be 10 points per 100 possessions better defensively than the league average.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6873581/2025/12/10/thunder-defense-nba-shai-gilgeous-alexander/", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-10", "text": "Of course, the Thunder are No. 1. How could they not be, after rolling through the league with 68 regular-season wins and a historic victory margin to win their first championship and still having a cupboard full of draft assets and one of the youngest rosters in the league going forward? Have I mentioned that it’s possible they could win the championship and draft lottery in 2026?“The best-ever job of acquiring future assets while dominating in the present,” said one voter. “Usually, those two are a little exclusive when you’re talking about championship-level teams. Sam Presti is just the preeminent GM in the league.”The Thunder also have one of the largest staffs in the league and have filled their front office with clever people from different backgrounds. — John HollingerNew York Times", "quote": "“The best-ever job of acquiring future assets while dominating in the present,” said one voter. “Usually, those two are a little exclusive when you’re talking about championship-level teams. Sam Presti is just the preeminent GM in the league.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Oklahoma City Thunder", "Sam Presti"]}, {"date": "", "archive_date": "2025-12-10", "text": "“Besides Sam being really good at his job, he has people like (vice presidents of basketball operations) Jesse Gould and Wynn Sullivan that are excellent at what they do as well,” said another voter.“Those guys handle the strategy portion of things and set the path for the future. They do a great job of being forward-thinking and not just trying to copy people.” — John HollingerNew York Times", "quote": "“Besides Sam being really good at his job, he has people like (vice presidents of basketball operations) Jesse Gould and Wynn Sullivan that are excellent at what they do as well,” said another voter.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Oklahoma City Thunder", "Sam Presti"]}, {"date": "", "archive_date": "2025-12-10", "text": "“They have always done a good job with building their team,” said one voter who gave Boston high marks. “They made a difficult decision this offseason, but because of the rules, it was one they had to make. The timing was right with the Tatum injury. I would expect them to be able to turn it around pretty quickly. This year is just a reset for them. I would not expect it to be a long-term thing.” Boston still has to make a tough call on Anfernee Simons, who came from Portland in the Holiday trade. Moving the 26-year-old’s expiring deal could get the Celtics under the first apron by the summer, and turn off the repeater clock. But with all their moves in the offseason, the Celtics are no longer in second-apron hell.“Brad Steven’s integrity and competence carry a heavy load for them,” another voter said of Boston’s front office. — David AldridgeNew York Times", "quote": "“Brad Steven’s integrity and competence carry a heavy load for them,” another voter said of Boston’s front office. — David Aldridge", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Boston Celtics", "Brad Stevens"]}, {"date": "", "archive_date": "2025-12-10", "text": "These latest moves have been additive, with the Rockets having built this post-James Harden era core by way of the draft (Alperen Şengün at No. 16 in 2021, Jabari Smith Jr. third in 2022, Tari Eason 17th in 2022, Amen Thompson fourth in 2023, Reed Sheppard third in 2024). “They have drafted well, built a deep team in a tough Western Conference while managing tax aprons,” said one executive who voted the Rockets second. “(They) hired a good coach and built an overall team identity, then added KD for cheap. “From where they were only a few years ago, they have done a good job turning it around.”Said another, who also voted the Rockets second: “High-end talent, a willingness to be bold, (and) good asset management.” — Sam AmickNew York Times", "quote": "Said another, who also voted the Rockets second: “High-end talent, a willingness to be bold, (and) good asset management.” — Sam Amick", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Houston Rockets", "Jabari Smith", "Amen Thompson", "Tari Eason", "Reed Sheppard"]}, {"date": "", "archive_date": "2025-12-10", "text": "Of course, just because, say, Lakers GM and president of basketball operations Rob Pelinka has been in L.A. since 2019, that doesn’t mean the team is completely the same, especially after a sale.\"No disrespect to the current folks,” the person who voted for the Lakers said, “But what (incoming governor) Mark Walter does with the Lakers front office and the folks with the Dodgers involved is really intriguing. ... That's a sleeping giant.\" — Fred KatzNew York Times", "quote": "\"No disrespect to the current folks,” the person who voted for the Lakers said, “But what (incoming governor) Mark Walter does with the Lakers front office and the folks with the Dodgers involved is really intriguing. ... That's a sleeping giant.\" — Fred Katz", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6867639/2025/12/10/best-nba-front-offices-rankings/", "tags": ["Los Angeles Lakers", "Rob Pelinka", "Mark Walter"]}, {"date": "", "archive_date": "2025-12-10", "text": "Sam Amick: “And man, Ja — like he was in a good place. Considering how much time we spent talking and writing about the stuff that happened early on in the season when it seemed like he was ready to get out of Memphis and he was frustrated with the coaching staff — you know, what I saw that night was a very different picture where he was obviously hurt, but he's on the bench coaching guys up. Um, literally even engaging with Tuomas Iisalo about stuff, you know, on—on the playboard, um, things like that. So talking to people around the team, you know, Zach Kleiman, their GM, continues to not show much interest, if any, in moving Ja and to tell people that they're trying to push this thing through.Again, you know, it seems like Ja and even his—his camp and his family are—are trying to make it work.”YouTube", "quote": "Again, you know, it seems like Ja and even his—his camp and his family are—are trying to make it work.”", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=SePaYJ4cBxw", "tags": ["Memphis Grizzlies", "Trade", "Ja Morant", "Zach Kleiman", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-10", "text": "Rich Paul:“I think the Milwaukee Bucks have done everything Giannis has asked them to do and deserve the right for Giannis to handle things in a way where they’re not put in a situation where people know he wants out—and so now we get 70 cents on the dollar. There’s a way to be partnerial in exiting. There really is.”Max Kellerman: “And do you think they will form a partnership in order to exit?” Rich Paul: “Well, that takes a number of things. Listen—most athletes have been getting what all their life? Cheered. They never want to be booed. Never. The boo of it all. Going into a front office—they’re so reluctant to go in there and say these things. But it’s business. So, hey—go in. You’ve won a championship. ‘Hey guys, I appreciate everything. I still feel special about the Bucks. You guys have done everything—from, you know, both his brothers on the team. I’m pretty sure they allow him to decide whatever: moves for guys, this and that, stay overnight, and whatever—whatever he wants to do. Which he’s earned the right.’”YouTube", "quote": "“I think the Milwaukee Bucks have done everything Giannis has asked them to do and deserve the right for Giannis to handle things in a way where they’re not put in a situation where people know he wants out—and so now we get 70 cents on the dollar. There’s a way to be partnerial in exiting. There really is.”", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=sokxu0dYIEM&t=2920s", "tags": ["Milwaukee Bucks", "Trade", "Rich Paul", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-10", "text": "However, Amick finds this approach baffling, especially because of how intense the competition in the Western Conference has become. Additionally, with Ballmer still being patient with stars like Leonard, he leaves the team stranded even when the Clippers are losing and are unable to build any chemistry. Amick proclaims this approach to be blatantly “awful.”“Steve Ballmer, man, has got this inexplicable, in my opinion, borderline insane addiction to this group. I don’t understand it because when you talk about Kawhi, the level of scrutiny and distraction which has come from that partnership with Kawhi has been so problematic, but Steve has never wavered,” Amick said on the “Run It Back” show. “They keep rocking with this group, knowing all of their contracts are coming up in a couple of years, and they’ve been looking at the summer of 2027 for quite some time, and it seems like they’re sticking down this road as bad as this is. It’s awful… I don’t see them blowing it up; I see them continue to do stuff around the edges and pull this thing out,” he added.Basketball Network", "quote": "“Steve Ballmer, man, has got this inexplicable, in my opinion, borderline insane addiction to this group. I don’t understand it because when you talk about Kawhi, the level of scrutiny and distraction which has come from that partnership with Kawhi has been so problematic, but Steve has never wavered,” Amick said on the “Run It Back” show", "outlet": "Basketball Network", "source_url": "https://www.basketballnetwork.net/latest-news/steve-ballmer-has-got-this-borderline-insane-addiction-to-this-group", "tags": ["Los Angeles Clippers", "Steve Ballmer", "Kawhi Leonard"]}, {"date": "", "archive_date": "2025-12-10", "text": "[NOTB Podcast]Kenny Beecham reached out to Tyrese Haliburton to ask if star players/free agents care when a franchise “do their players wrong” in response to how the Clippers sent Chris Paul home. Haliburton: “A lot of players just want to get paid.”reddit", "quote": "Kenny Beecham reached out to Tyrese Haliburton to ask if star players/free agents care when a franchise “do their players wrong” in response to how the Clippers sent Chris Paul home. Haliburton: “A lot of players just want to get paid.”", "outlet": "reddit", "source_url": "https://www.reddit.com/r/nba/comments/1picxmp/notb_podcast_kenny_beecham_reached_out_to_tyrese/", "tags": ["Indiana Pacers", "Los Angeles Clippers", "Free Agency", "Chris Paul", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-10", "text": "On 95.7 The Game's “Willard & Dibs,” Warriors coach Steve Kerr explained that Kuminga hasn't played well recently, leading to his benching. He said it's part of the team's “shift” amid their challenging stretch. Kerr also fired a blunt remark about the 23-year-old Kuminga.“He's obviously a guy with a lot of ambition, which I love. He wants to be a star. He's got the ability that gives him that hope and gives us that hope. There has to be a consistent level of play in order to achieve that,” said Kerr.Clutch Points", "quote": "“He's obviously a guy with a lot of ambition, which I love. He wants to be a star. He's got the ability that gives him that hope and gives us that hope. There has to be a consistent level of play in order to achieve that,” said Kerr", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/golden-state-warriors/warriors-news-steve-kerr-celebrates-jonathan-kuminga-ambition-catch", "tags": ["Golden State Warriors", "Steve Kerr", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-10", "text": "The caveat in the end was telling, as Kerr has repeatedly pointed out Kuminga's inconsistent play. While he has all the physical tools to be an impactful two-way player, Kuminga's mental toughness and basketball IQ have been put into question.“We're talking about the best basketball league in the world. So the consistency has to be there for us. If it's not there, then it makes it much more difficult for me to give him consistent minutes and give him starts,” added Kerr.Clutch Points", "quote": "“We're talking about the best basketball league in the world. So the consistency has to be there for us. If it's not there, then it makes it much more difficult for me to give him consistent minutes and give him starts,” added Kerr", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/golden-state-warriors/warriors-news-steve-kerr-celebrates-jonathan-kuminga-ambition-catch", "tags": ["Golden State Warriors", "Steve Kerr", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-10", "text": "MrBuckBuck:Jalen Brunson responds to Josh Hart's claim that he would be a terrible New York Mayor \"If I was mayor whoever stole Josh's watches in New York City I would make sure they walk free\"x.com", "quote": "Jalen Brunson responds to Josh Hart's claim that he would be a terrible New York Mayor \"If I was mayor whoever stole Josh's watches in New York City I would make sure they walk free\"", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/1998626389210312746", "tags": ["New York Knicks", "Frivolities", "Josh Hart", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-10", "text": "MrBuckBuck: Jalen Brunson on whether he prefers blackjack, poker, or roulette:“I don't gamble. It’s probably a good thing I don’t gamble right? Probably shouldn't say anything about gambling.\"x.com", "quote": "“I don't gamble. It’s probably a good thing I don’t gamble right? Probably shouldn't say anything about gambling.\"", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/1998622298857755110", "tags": ["New York Knicks", "Gambling", "Frivolities", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-10", "text": "Oh No He Didn't:Tyrese Haliburton: \"Hopefully the goal is by the end of the month that I can start playing one-on-one\"x.com", "quote": "Tyrese Haliburton: \"Hopefully the goal is by the end of the month that I can start playing one-on-one\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/1998612941403226518", "tags": ["Indiana Pacers", "Injuries", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-10", "text": "Again, given the context that Paul is a powerful agent, it’s crazy that he’s just out here firing off takes like he’s on Around the Horn. When discussing the Lakers this season, Kellerman says that Austin Reaves should be in a Manu Ginobili role on a championship team, which Paul agrees with.Kellerman: “Ideally, Austin Reaves…is Ginobili. In an ideal world…” Paul: “On a championship team?” Kellerman: “On a championship team, he’s the killer sixth man.” Paul: “Yeah.”Silverscreenandroll.com", "quote": "Kellerman: “Ideally, Austin Reaves…is Ginobili. In an ideal world…” Paul: “On a championship team?” Kellerman: “On a championship team, he’s the killer sixth man.” Paul: “Yeah.”", "outlet": "Silverscreenandroll.com", "source_url": "https://www.silverscreenandroll.com/lakers-news/102329/rich-paul-podcast-lebron-james-lakers-austin-reaves-jj-redick-front-office-max-kellerman", "tags": ["Los Angeles Lakers", "Manu Ginobili", "Rich Paul", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-10", "text": "Now, that brings up an interesting question, which Kellerman rightly also retorts with. The Lakers have a decades-long reputation as a superstar-friendly organization. Paul represents one of the biggest superstars the game has ever had. Is Paul arguing that should go away? Well, we don’t exactly get an answer because Paul then just kind of talked in circles about Pat Riley and the Heat and the Lakers without really committing to anything.“LeBron was always a pro. Regardless what Miami was, there was never a thing of body fat, being out of shape, none of that. None of those things. Being on time? Nothing. I don’t want to misconstrue that because sometimes that can be misconstrued. But, going back to mindset, Pat Riley’s mindset, Pat Riley had a championship mindset so the foundation, ‘It don’t matter how upset you may be, we’re doing this thing this way.’… I would say, if there’s room to grow for the Lakers, it would be in that department. ‘Yes, we are the Lakers and let’s establish this culture. We’ve got 17 championships. Let’s establish this culture of being a championship organization and having these pillars.’ That don’t stop you from having great service and rolling out the carpet here and there and doing certain things that’s preferential. That’s fine. Everyone’s going to do that, by the way.”Silverscreenandroll.com", "quote": "“LeBron was always a pro. Regardless what Miami was, there was never a thing of body fat, being out of shape, none of that. None of those things. Being on time? Nothing. I don’t want to misconstrue that because sometimes that can be misconstrued. But, going back to mindset, Pat Riley’s mindset, Pat Riley had a championship mindset so the foundation, ‘It don’t matter how upset you may be, we’re doing this thing this way.’", "outlet": "Silverscreenandroll.com", "source_url": "https://www.silverscreenandroll.com/lakers-news/102329/rich-paul-podcast-lebron-james-lakers-austin-reaves-jj-redick-front-office-max-kellerman", "tags": ["Los Angeles Lakers", "Miami Heat", "Pat Riley"]}, {"date": "", "archive_date": "2025-12-10", "text": "During the interview,Wilson was asked about having kids together ... and she responded, \"That is always a dream.\" \"This is my life partner. Honestly, what on earth was my world before you? That’s how much he’s impacted my life.\"When asked about tying the knot, Wilson is leaving all the marriage decisions to Adebayo ... who said that fans will see the ring on that finger when the time comes. \"Y’all will know, because people are nosy and they’ll look at her hands,\" Adebayo said, \"There you go.\"TMZ.com", "quote": "Wilson was asked about having kids together ... and she responded, \"That is always a dream.\" \"This is my life partner. Honestly, what on earth was my world before you? That’s how much he’s impacted my life.\"", "outlet": "TMZ.com", "source_url": "https://www.tmz.com/2025/12/09/aja-wilson-bam-adebayo-kids-marriage-wnba-nba/", "tags": ["Miami Heat", "WNBA", "Bam Adebayo", "A'ja Wilson"]}, {"date": "", "archive_date": "2025-12-10", "text": "Former NBA starMatt Barnes is pushing back on rumors that claimed he was scammed by an AI model. A rumor circulating around the internet got fresh air from another former NBAer, Gilbert Arenas, who addressed the gossip on his own podcast. Apparently, as the internet says, Barnes fell victim to a catfish who managed to walk off with $61,000 of his money. 'I've sat back and watched the internet lie about me the whole year,' Barnes said in a video posted to his Instagram account. 'The whole year -- lies from me being gay, to me talking abortion to me telling some girl not to do a reality show.' 'I get back from Dubai ... I see all of a sudden I'm suing an A.I. model, or I got played by an A.I. model.' 'You guys believe I got played by an A.I. model, and I'm suing 'em? Where the f*** did you guys get this from?!'Daily Mail", "quote": "Matt Barnes is pushing back on rumors that claimed he was scammed by an AI model", "outlet": "Daily Mail", "source_url": "https://www.dailymail.co.uk/sport/nba/article-15367951/matt-barnes-ai-model-scam.html", "tags": ["Gilbert Arenas", "Matt Barnes", "Frivolities"]}, {"date": "", "archive_date": "2025-12-10", "text": "Barnes also called out Arenas, saying he eventually reached out to the former Wizards star to ask why he never checked in with him in the first place. 'Itold him, 'After all we've been through, bro, like tap in with me to see if it's real.' He apologized,' Barnes said. He added in the video, 'Y'all can't believe everything you motherf***in' hear!!'Barnes opened up about a tough 2025 for him. In addition to the rumors, the 45-year-old revealed in April that his fiancée, Ananasa Sims, broke off their engagement. He was later publicly accused of infidelity by Sims.Daily Mail", "quote": "told him, 'After all we've been through, bro, like tap in with me to see if it's real.' He apologized,' Barnes said. He added in the video, 'Y'all can't believe everything you motherf***in' hear!!'", "outlet": "Daily Mail", "source_url": "https://www.dailymail.co.uk/sport/nba/article-15367951/matt-barnes-ai-model-scam.html", "tags": ["Gilbert Arenas", "Matt Barnes", "Frivolities"]}, {"date": "", "archive_date": "2025-12-09", "text": "Chris Haynes: Sources:Milwaukee Bucks star Giannis Antetokounmpo met with some teammates to address rumors of his future.Message was to focus on basketball and not allow outside noise to distract team. More on The Association on @NBATV .x.com", "quote": "Milwaukee Bucks star Giannis Antetokounmpo met with some teammates to address rumors of his future.", "outlet": "x.com", "source_url": "https://x.com/ChrisBHaynes/status/1998595338492588284", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-09", "text": "New York Basketball:Jalen Brunson as the Knicks beat Toronto and advance to Vegas for the Cup:35 points 13-19 FG 6-9 threex.com", "quote": "Jalen Brunson as the Knicks beat Toronto and advance to Vegas for the Cup:", "outlet": "x.com", "source_url": "https://x.com/NBA_NewYork/status/1998607387893060068", "tags": ["New York Knicks", "Toronto Raptors", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Josh Lewenberg: 10 days ago, the Raptors had won 13 of 14 games, were in 2nd place, and owned the best point differential in the Eastern Conference.Now, they’ve lost 6 of 7 games, have fallen to 5th (just a half game up on 9th), and own the East’s 7th-best point differential.x.com", "quote": "Now, they’ve lost 6 of 7 games, have fallen to 5th (just a half game up on 9th), and own the East’s 7th-best point differential", "outlet": "x.com", "source_url": "https://x.com/JLew1050/status/1998606877886918789", "tags": ["Toronto Raptors"]}, {"date": "", "archive_date": "2025-12-09", "text": "Anthony Chiang: Erik Spoelstra on the end of the Heat's NBA Cup run: \"We have a very competitive group.There was something to really play for right now. We had all wrapped our minds around it. We’re all still kind of shocked about it.”x.com", "quote": "There was something to really play for right now. We had all wrapped our minds around it. We’re all still kind of shocked about it.”", "outlet": "x.com", "source_url": "https://x.com/Anthony_Chiang/status/1998592467155964320", "tags": ["Miami Heat", "Erik Spoelstra", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Jason Beede:Desmond Bane joked about losing $35K from his NBA fine and making his money back via the NBA Cup prize money.He called advancing to the Cup semifinals a “great opportunity to play some meaningful basketball early in the season” for the #Magic:x.com", "quote": "Desmond Bane joked about losing $35K from his NBA fine and making his money back via the NBA Cup prize money.", "outlet": "x.com", "source_url": "https://x.com/therealBeede/status/1998577016115806581", "tags": ["Orlando Magic", "Desmond Bane", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "In an interview with 95.7 The Game’s “Steiny & Guru” show, Spencer revealed that he often does not recall what comes out of his mouth during his electric celebrations on the court.“It’s messed up. I black out when I have those moments,” Spencer told hosts Matt Steinmetz and Daryle “Guru” Johnson. “Everyone’s repeating it back to me, but it’s almost as if I don’t remember it.”NBC Sports Bay Area", "quote": "“It’s messed up. I black out when I have those moments,” Spencer told hosts Matt Steinmetz and Daryle “Guru” Johnson. “Everyone’s repeating it back to me, but it’s almost as if I don’t remember it.”", "outlet": "NBC Sports Bay Area", "source_url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/pat-spencer-trash-talk/1898109/?partner=yahoo", "tags": ["Golden State Warriors", "Pat Spencer"]}, {"date": "", "archive_date": "2025-12-09", "text": "Olympiacos is acquiring a player with 420 NBA games, with advanced talks underway with NBA guard Monte Morris. According to Eurohoops sources, there’s optimism from the Greek club about a final deal sooner than later for a contract until the end of the season.EuroHoops.net", "quote": "Olympiacos is acquiring a player with 420 NBA games, with advanced talks underway with NBA guard Monte Morris", "outlet": "EuroHoops.net", "source_url": "https://www.eurohoops.net/en/euroleague/1905113/olympiacos-near-a-deal-with-monte-morris/", "tags": ["Free Agency", "Euroleague", "Olympiacos", "Monte Morris"]}, {"date": "", "archive_date": "2025-12-09", "text": "A less-redacted court filing in a lawsuit against Mat Ishbia includes new financial details that two Phoenix Suns minority owners say could threaten Ishbia's majority ownership of the team. The filing, a copy of which was obtained by ESPN on Tuesday, is from a lawsuit filed Nov. 24 in Delaware State Court by attorneys representing Scott Seldin and Andy Kohlberg, two Suns minority owners. Ishbia's spokesman said the filing contains \"nothing new\" and that its claims are \"ridiculous.\"ESPN", "quote": "A less-redacted court filing in a lawsuit against Mat Ishbia includes new financial details that two Phoenix Suns minority owners say could threaten Ishbia's majority ownership of the team", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47260959/suns-minority-owners-target-ishbia-majority-stake-filing", "tags": ["Phoenix Suns", "Law", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-09", "text": "According to the filing, Ishbia said the capital call raise wasn't fully funded and set up another capital call raise on July 8, with another 10-day deadline. Again, Seldin and Kohlberg say, they paid their portion under protest. The two minority owners say they then sought internal financial records and filed a lawsuit in August against Ishbia to obtain them.Seldin and Kohlberg say they were shown a one-page document that claimed a \"debt-to-equity conversion\" was used to fund a portion of Ishbia's contribution to the raise. But ultimately, they say, they learned that Ishbia failed to fund both capital call raises by the deadlines he set.ESPN", "quote": "Seldin and Kohlberg say they were shown a one-page document that claimed a \"debt-to-equity conversion\" was used to fund a portion of Ishbia's contribution to the raise. But ultimately, they say, they learned that Ishbia failed to fund both capital call raises by the deadlines he set", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47260959/suns-minority-owners-target-ishbia-majority-stake-filing", "tags": ["Phoenix Suns", "Law", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-09", "text": "For Ishbia's majority ownership to be in jeopardy, the judge in the lawsuit would need to decide that Ishbia failed to fund the capital call by his own deadline and therefore, per the terms of the operating agreement, Ishbia must offer the minority owners the opportunity to fund his unfunded share at the $10 million per unit price set in his capital call notice.If that were to happen, Seldin and Kohlberg could take over the majority ownership of the Suns and Phoenix Mercury with a stake of approximately 60%.ESPN", "quote": "If that were to happen, Seldin and Kohlberg could take over the majority ownership of the Suns and Phoenix Mercury with a stake of approximately 60%", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47260959/suns-minority-owners-target-ishbia-majority-stake-filing", "tags": ["Phoenix Suns", "Law", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-09", "text": "Anthony Chiang:X-rays on Pelle Larsson’s sprained ankle returned negative.He will undergo an MRI tomorrow.x.com", "quote": "X-rays on Pelle Larsson’s sprained ankle returned negative.", "outlet": "x.com", "source_url": "https://x.com/Anthony_Chiang/status/1998577908302946412", "tags": ["Miami Heat", "Injuries", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-09", "text": "Nick DePaula:Knicks kicks in the NBA Cup tonight:• Jalen Brunson in his Kobe 6 PE • Jordan Clarkson in the SHAI 001 • Karl Towns in his GT Jump 2 PE • Ariel Hukporti in the Harden Vol 10x.com", "quote": "Knicks kicks in the NBA Cup tonight:", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/1998576611646648549", "tags": ["New York Knicks", "Sneakers", "Jordan Clarkson", "Karl-Anthony Towns", "Jalen Brunson", "Ariel Hukporti", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Jason Beede:FINAL: #Magic 117, Heat 108Behind Desmond Bane's 37 points, Orlando is heading to Las Vegas for the NBA Cup Semifinals.x.com", "quote": "FINAL: #Magic 117, Heat 108", "outlet": "x.com", "source_url": "https://x.com/therealBeede/status/1998567642102452319", "tags": ["Miami Heat", "Orlando Magic", "Desmond Bane", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "SiriusXM NBA Radio:\"The early noise about the Pistons has been that they don't want to go out and make some splashy trade\"@TheSteinLine tells @talkhoops that he's been hearing the Pistons might stand pat instead of going star hunting at the deadlinex.com", "quote": "\"The early noise about the Pistons has been that they don't want to go out and make some splashy trade\"", "outlet": "x.com", "source_url": "https://x.com/SiriusXMNBA/status/1998546956310733246", "tags": ["Detroit Pistons", "Trade"]}, {"date": "", "archive_date": "2025-12-09", "text": "Mark Cuban:Not truex.com", "quote": "Not true", "outlet": "x.com", "source_url": "https://x.com/mcuban/status/1998559022996505022", "tags": ["Dallas Mavericks", "Mark Cuban", "Dwight Powell"]}, {"date": "", "archive_date": "2025-12-09", "text": "Todd Whitehead:There is a perceived tradeoff between going for offensive rebounds and giving up transition looks to the opposing team.But, this season, the Rockets have one of the lowest transition rates after missed baskets despite (or maybe because of ) them having the highest OREB rates.x.com", "quote": "There is a perceived tradeoff between going for offensive rebounds and giving up transition looks to the opposing team.", "outlet": "x.com", "source_url": "https://x.com/CrumpledJumper/status/1998573993222357007", "tags": ["Houston Rockets"]}, {"date": "", "archive_date": "2025-12-09", "text": "Paul Garcia:Wemby is OUT Wednesday vs Lakers per Spurs. McLaughlin is questionablex.com", "quote": "Wemby is OUT Wednesday vs Lakers per Spurs", "outlet": "x.com", "source_url": "https://x.com/PaulGarciaNBA/status/1998559245093187996", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "Injuries", "Jordan McLaughlin", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-09", "text": "Paul Garcia:LeBron, Luka, and Reaves are all available for Wednesday’s quarterfinals game vs the Spurs. Only player on Lakers’ injury report is Maxi Kleber (lumbar muscle strain - questionable)x.com", "quote": "LeBron, Luka, and Reaves are all available for Wednesday’s quarterfinals game vs the Spurs", "outlet": "x.com", "source_url": "https://x.com/PaulGarciaNBA/status/1998574574254927948", "tags": ["Los Angeles Lakers", "San Antonio Spurs", "Injuries", "Maxi Kleber"]}, {"date": "", "archive_date": "2025-12-09", "text": "Iisalo tagged up when he led teams in Germany and France before coming to the NBA. He’s implemented many of those concepts in his new home. The Grizzlies send at least three crashers to the glass on 18.8 percent of their shots, the fourth-highest frequency in the league.“It’s very hard to get into the low 120s in offensive rating (points per 100 possessions) without the offensive rebounding,” Iisalo said.“That’s what it takes to be an elite offensive team nowadays.”New York Times", "quote": "“It’s very hard to get into the low 120s in offensive rating (points per 100 possessions) without the offensive rebounding,” Iisalo said.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["Memphis Grizzlies", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-09", "text": "For years, NBA teams made a choice: Either go for offensive boards or favor transition defense. By the 2010s, just about every organization had chosen the latter strategy. This is why Henare stood out. Not only did his teams maul the offensive glass, sending all five guys to the paint when the shot went up, but they also weren’t allowing easy buckets on the other end. So, leading into the Tokyo Olympics in 2021, Brown set up a video call with Henare. He wanted to learn about the strategy referred to as “tagging up,” in which everyone crashes the offensive boards, though not recklessly. There are fundamentals behind tagging up, as Henare explained to Brown. When players crash, they aren’t golden retrievers playing fetch.Instead, they approach defenders at specific areas of the floor, meeting from behind, pinning those defenders into wherever they’re planted and blocking their pathways to leak out in transition or to retrieve long rebounds, which have grown more common with the popularity of the 3-pointer. The opposite effect held true, too. The more crashers there were, the more defenders had to stay back to box them out.New York Times", "quote": "Instead, they approach defenders at specific areas of the floor, meeting from behind, pinning those defenders into wherever they’re planted and blocking their pathways to leak out in transition or to retrieve long rebounds, which have grown more common with the popularity of the 3-pointer", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["New York Knicks", "Mike Brown"]}, {"date": "", "archive_date": "2025-12-09", "text": "Maine went even more radical than the summer Celtics did, routinely crashing four guys for offensive rebounds, a strategy the squad’s head coach, Alex Barlow, was hesitant to implement at first. With encouragement from a member of the Celtics’ analytics department, Drew Cannon, as well as from his coaching analytics-focused assistant in the G League, Alex Merg, he changed his mind. “Our whole philosophy was, let’s send everybody and let’s see how it works,” Barlow said. “Let’s see if the trade-off is a net positive.” The outcome was decisive.Maine won rebounding battle after rebounding battle, creating extra shooting chances more nights than not, all while its transition defense remained in the top half of the league.The team wasn’t tagging up, the strategy where it pins those opponents from behind, but a stampede of crashers meant the enemy couldn’t scamper in the opposite direction. Doing so would increase the chances of another offensive rebound.New York Times", "quote": "Maine won rebounding battle after rebounding battle, creating extra shooting chances more nights than not, all while its transition defense remained in the top half of the league.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6859085/2025/12/09/nba-offensive-rebounding-new-zealand-coaching/", "tags": ["Boston Celtics", "G League"]}, {"date": "", "archive_date": "2025-12-09", "text": "In the first three seasons of tracking data in the mid-2010s, plays featuring a post-up at any point averaged just 89 points per 100 chances. Since 2022-23, however, that number is 103 points per 100 chances -- about four ticks higher than the average half-court play overall.This season, that gap is even wider: 103.9 points per 100 plays with a post-up versus 99.0 points per 100 half-court plays overall, a difference of 4.9 points.ESPN", "quote": "This season, that gap is even wider: 103.9 points per 100 plays with a post-up versus 99.0 points per 100 half-court plays overall, a difference of 4.9 points.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["Statistics", "Analytics"]}, {"date": "", "archive_date": "2025-12-09", "text": "And Jokic was so dominant in such a large share of post-ups that he alone raised the entire league's post-up efficiency by 1.1 points per 100 possessions. This relationship between falling post-up frequency and rising post-up efficiency reveals the trend's first broad lesson: Stars play by different rules, and rather than dictate a one-size-fits-all strategy, analytics work best when they account for individual player profiles.\"If you've got guys that are uniquely gifted,\" Detroit Pistons coach J.B. Bickerstaff said, \"you've got to try your best to put them in positions of strength, even if it may be a zag from what the rest of the league is doing.\"ESPN", "quote": "\"If you've got guys that are uniquely gifted,\" Detroit Pistons coach J.B. Bickerstaff said, \"you've got to try your best to put them in positions of strength, even if it may be a zag from what the rest of the league is doing.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["Denver Nuggets", "Detroit Pistons", "Nikola Jokic"]}, {"date": "", "archive_date": "2025-12-09", "text": "But as San Antonio Spurs coach Mitch Johnson noted, Wembanyama's post opportunities typically come higher up the floor near the elbow, giving him more space to operate and work off the teammates orbiting him on the perimeter. \"Us walking up the basketball and throwing it to him on the low block and everybody staring at him to make everything happen probably isn't something that we're [going to do],\" Johnson said. \"I think sometimes we blur the traditional sense of what we view as a post-up.\"Most teams follow that philosophy in 2025: According to tracking data, a much higher percentage of post-ups start on the move now, compared to a decade ago, while the number that start with a staid, traditional entry pass has plummeted.ESPN", "quote": "Most teams follow that philosophy in 2025: According to tracking data, a much higher percentage of post-ups start on the move now, compared to a decade ago, while the number that start with a staid, traditional entry pass has plummeted", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["San Antonio Spurs", "Statistics", "Analytics", "Mitch Johnson", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-09", "text": "Vucevic said he tells younger players they should still invest practice time honing those post-up basics, even if they've become a less important part of the sport overall. And some team executives agree with these veteran centers. They don't expect a major uptick in post-up frequency anytime soon.But because so much of modern NBA offense is about attacking mismatches, they view a capable post-up scorer as the \"ultimate release valve,\" as one Eastern Conference executive said.ESPN", "quote": "But because so much of modern NBA offense is about attacking mismatches, they view a capable post-up scorer as the \"ultimate release valve,\" as one Eastern Conference executive said", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47243702/nba-2025-2026-season-postups-trends-kristaps-porzingis-victor-wembanyama", "tags": ["Chicago Bulls", "Nikola Vucevic", "Statistics", "Analytics"]}, {"date": "", "archive_date": "2025-12-09", "text": "“People are going to call us crazy, but I think we’re a contender,” Adebayo said. “We’re going to be called delusional. But how I look at delusion [is] if you ask how many people could be NBA players, what is the percentage of that?So, you’ve got to have a little bit of delusion when it comes to speaking stuff into existence. “Like I always say, ‘Speak stuff into existence that matters.’ Manifest things that matter. Being able to just dream about that, write it down and keep looking at that. That goes a long way. And some of that is real. So, I think we’re contenders when we’re fully healthy.”Andscape", "quote": "So, you’ve got to have a little bit of delusion when it comes to speaking stuff into existence", "outlet": "Andscape", "source_url": "https://andscape.com/features/bam-adebayo-in-the-drivers-seat-for-miami-heat/", "tags": ["Miami Heat", "Bam Adebayo"]}, {"date": "", "archive_date": "2025-12-09", "text": "Bennett Durando: David Adelman: \"I think we don't freak out as much as maybe the outside noise does. I know losing at home is never good. But winning on the road this many times is also very good. ...There's only one OKC right now. Then there's us, Lakers, Houston, San Antonio & you keep going.\"x.com", "quote": "There's only one OKC right now. Then there's us, Lakers, Houston, San Antonio & you keep going.\"", "outlet": "x.com", "source_url": "https://x.com/BennettDurando/status/1998546339425362056", "tags": ["Houston Rockets", "Los Angeles Lakers", "San Antonio Spurs", "David Adelman"]}, {"date": "", "archive_date": "2025-12-09", "text": "Josh Lewenberg:Immanuel Quickley will miss tonight’s NBA Cup quarterfinals game with an illness.Jamal Shead is available (and will presumably get plenty of run with IQ out).x.com", "quote": "Immanuel Quickley will miss tonight’s NBA Cup quarterfinals game with an illness.", "outlet": "x.com", "source_url": "https://x.com/JLew1050/status/1998540119771435413", "tags": ["Toronto Raptors", "Injuries", "Immanuel Quickley", "Jamal Shead", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Brandon Rahbar:Shai Gilgeous-Alexander is available to play tomorrow vs the Suns. Lu Dort and Alex Caruso are back. Merry Christmas, Thunder fans.x.com", "quote": "Shai Gilgeous-Alexander is available to play tomorrow vs the Suns", "outlet": "x.com", "source_url": "https://x.com/BrandonRahbar/status/1998535987635331531", "tags": ["Oklahoma City Thunder", "Phoenix Suns", "Injuries", "Alex Caruso", "Shai Gilgeous-Alexander", "Luguentz Dort"]}, {"date": "", "archive_date": "2025-12-09", "text": "Kellan Olson:Devin Booker (right groin strain) has been upgraded to questionable for the Suns tomorrow against the Thunder in the NBA Cup quarterfinals.x.com", "quote": "Devin Booker (right groin strain) has been upgraded to questionable for the Suns tomorrow against the Thunder in the NBA Cup quarterfinals", "outlet": "x.com", "source_url": "https://x.com/KellanOlson/status/1998535800863306011", "tags": ["Oklahoma City Thunder", "Phoenix Suns", "Injuries", "Devin Booker", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-09", "text": "Ira Winderman:Pelle Larsson with a sprained left ankle, questionable to return.x.com", "quote": "Pelle Larsson with a sprained left ankle, questionable to return", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/1998546290410742220", "tags": ["Miami Heat", "Injuries", "Pelle Larsson"]}, {"date": "", "archive_date": "2025-12-09", "text": "DLLS Mavs:Ryan Nembhard donated $5,000 to the local Boys and Girls Club!x.com", "quote": "Ryan Nembhard donated $5,000 to the local Boys and Girls Club!", "outlet": "x.com", "source_url": "https://x.com/DLLS_Mavs/status/1998540203154096269", "tags": ["Dallas Mavericks", "Philanthropy", "Ryan Nembhard"]}, {"date": "", "archive_date": "2025-12-09", "text": "Thankfullyfor all involved, it sounds like Iisalo will be leaning into Jackson Jr.'s offensive skillset a bit more now that Edey is settled into the rotations. “There are several components there that make (Jackson Jr.) a great player,” noted the Finnish tactician.“He is a very good player on the perimeter, very good player on the inside, it's just a matter of time before (his stats) are up again.”Clutch Points", "quote": "Thankfully", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/memphis-grizzlies/grizzlies-being-stubborn-passing-up-jaren-jackson-jr-offense", "tags": ["Memphis Grizzlies", "Jaren Jackson Jr", "Zach Edey", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-09", "text": "Though Sabonis has missed a significant amount of time due to a partially torn meniscus in his knee, his name has been thrown in trade speculation. However, NBA insider Sam Amick would say on FanDuel's “Run It Back” show that he spoke to Sabonis' camp, and there was not an expectation that he would be dealt at the trade deadline.“I’ve talked to his camp recently. It does not sound like they anticipate being moved at the deadline,” Amick said.“It’s more a message of patience. And he really likes living in the area, and as far as quality of life, he’s doing okay.”Clutch Points", "quote": "“I’ve talked to his camp recently. It does not sound like they anticipate being moved at the deadline,” Amick said.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/sacramento-kings/kings-news-domantas-sabonis-camp-sends-clear-signal-trade-buzz", "tags": ["Sacramento Kings", "Trade", "Domantas Sabonis"]}, {"date": "", "archive_date": "2025-12-09", "text": "Kevin Gray Jr.: I’ve reached out to multiple sources with knowledge regarding the report that Mavericks C Dwight Powell intends to retire at the end of the year.At this time those sources say they can not confirm the report that Powell intends to retire with one source saying it was “news to them.”#MFFLx.com", "quote": "At this time those sources say they can not confirm the report that Powell intends to retire with one source saying it was “news to them.”", "outlet": "x.com", "source_url": "https://x.com/KevinGraySports/status/1998521592683323805", "tags": ["Dallas Mavericks", "Dwight Powell"]}, {"date": "", "archive_date": "2025-12-09", "text": "Dave McMenamin:“To be back reintroduced to it can definitely, I guess you can say, had me be a reborn person.Like a little kid on the first day of school again.” — Marcus Smart on what being a part of LAL this season has done for him after his career took a detour from stability after Bostonx.com", "quote": "“To be back reintroduced to it can definitely, I guess you can say, had me be a reborn person.", "outlet": "x.com", "source_url": "https://x.com/mcten/status/1998504586135613700", "tags": ["Los Angeles Lakers", "Marcus Smart"]}, {"date": "", "archive_date": "2025-12-09", "text": "Clemente Almanza: Ajay Mitchell on his ‘Belgian Waffle’ moment:“They asked me to do 2 — 1 serious, 1 funny… Didn’t expect them to put it out…People from my school were a little upset. Gotta shoutout UC Santa Barbara.”x.com", "quote": "“They asked me to do 2 — 1 serious, 1 funny… Didn’t expect them to put it out…", "outlet": "x.com", "source_url": "https://x.com/CAlmanza1007/status/1998454404693823944", "tags": ["Oklahoma City Thunder", "Frivolities", "Ajay Mitchell"]}, {"date": "", "archive_date": "2025-12-09", "text": "Damichael Cole:On 12/12, No. 12 (Ja Morant) for the Grizzlies is treating fans with 250 tickets. More details ??x.com", "quote": "On 12/12, No. 12 (Ja Morant) for the Grizzlies is treating fans with 250 tickets", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1998430419877007369", "tags": ["Memphis Grizzlies", "Philanthropy", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-09", "text": "Mike Curtis:#Mavs rookie Ryan Nembhard made a surprise visit to East Dallas Boys & Girls Club this afternoon.x.com", "quote": "#Mavs rookie Ryan Nembhard made a surprise visit to East Dallas Boys & Girls Club this afternoon", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/1998528657657315838", "tags": ["Dallas Mavericks", "Philanthropy", "Ryan Nembhard"]}, {"date": "", "archive_date": "2025-12-09", "text": "As he looks ahead, Paul says he’s still waiting to see exactly how the rest of the season unfolds. But one feeling has caught him off guard.“I’m actually at peace with everything,” he says.“More than anything, I’m excited about being around and getting a chance to play a small role in whatever anything looks like next.”People", "quote": "“I’m actually at peace with everything,” he says.", "outlet": "People", "source_url": "https://people.com/chris-paul-opens-up-after-getting-cut-from-clippers-exclusive-11864716", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-09", "text": "Law Murray: Tyronn Lue:\"When we first came into the season, we thought we had a great team, we thought we had a great chance.And so when you lose Bradley Beal, when you lose Kawhi, you lose Derrick Jones, you lose Bogie, things can get hard. And so they have been hard for us\"x.com", "quote": "\"When we first came into the season, we thought we had a great team, we thought we had a great chance.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1998507330523246973", "tags": ["Los Angeles Clippers", "Tyronn Lue", "Kawhi Leonard", "Bradley Beal", "Bogdan Bogdanovic", "Derrick Jones"]}]