[{"date": "", "archive_date": "2025-12-17", "text": "Ramona Shelburne: Some of the things early on — like, he invited guys to his suite at the Rams game, and he threw a Halloween party, and then... no one came. After that, they get worked the first night in Utah, which makes this even sadder. Like, seriously — a Halloween party, and maybe three players showed up. I think Brad came, and Zubac. Chris is trying to be like, “I’m going to help you build some culture. I’ll bring guys over to my house. Let’s work out together. Let’s have a Halloween party.He and his wife threw the party in the suite after the Halloween game — and again, only three players came.So you’re looking at this and thinking: he’s trying to fill the leadership void the way he knows how, and every time he did, they would kind of recoil. Like, “Eh, it’s too much.”YouTube", "quote": "He and his wife threw the party in the suite after the Halloween game — and again, only three players came.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=dCQpzZuFZmU", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-17", "text": "Jared Weiss:Victor Wembanyama learned Tuesday morning that his grandmother has passed away in France,a team source told @TheAthletic . Wembanyama was in tears during his post-game press conference and said, \"I'm sorry, I lost somebody today.\"x.com", "quote": "Victor Wembanyama learned Tuesday morning that his grandmother has passed away in France,", "outlet": "x.com", "source_url": "https://x.com/JaredWeissNBA/status/2001174243263045791", "tags": ["San Antonio Spurs", "Deaths", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "“It’s do-or-die, I think, out there,” said Spurs rookie Dylan Harper, who led San Antonio with 21 points off the bench. “You’ve seen the level of intensity rise up for us, and them.Obviously, they came out with the win. But for us, it’s not taking anything for granted; I think that’s the biggest thing. When we all go out there, we all know that we’ve got to play 110% in order to win things like this.”Washington Post", "quote": "“It’s do-or-die, I think, out there,” said Spurs rookie Dylan Harper, who led San Antonio with 21 points off the bench. “You’ve seen the level of intensity rise up for us, and them.", "outlet": "Washington Post", "source_url": "https://www.washingtonpost.com/sports/nba/2025/12/16/spurs-nba-cup-wembanyama/e9ad4b74-db03-11f0-b484-4459fa8e79e5_story.html", "tags": ["San Antonio Spurs", "NBA Cup", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-17", "text": "Josh Hart:Damn in 4k…..x.com", "quote": "Damn in 4k….", "outlet": "x.com", "source_url": "https://x.com/joshhart/status/2001173285095301213", "tags": ["New York Knicks", "Josh Hart", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Lacob himself, which Simon and SFGate confirmed through Warriors Senior Vice President of Communications Raymond Ridder, actually replied to the fan's email two minutes after Dutari sent it,and relayed his shared frustration while stating he was \"working on it.\" “You can’t be as frustrated as me,” Lacob wrote. “I am working on it. It’s complicated. Style of play. Coaches desires regarding players. League trends. Jimmy is not the problem. Joe\"NBC Sports Bay Area", "quote": "Lacob himself, which Simon and SFGate confirmed through Warriors Senior Vice President of Communications Raymond Ridder, actually replied to the fan's email two minutes after Dutari sent it,", "outlet": "NBC Sports Bay Area", "source_url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/joe-lacob-fan-email/1900064/", "tags": ["Golden State Warriors", "Joe Lacob", "Jimmy Butler"]}, {"date": "", "archive_date": "2025-12-17", "text": "During Tuesday's practice, he was asked if he feels the Suns have their respect back.“Every day, you fight for respect every day,” Ott said. “This league changes too fast. Too many things can happen. LeBron (James) is still out there fighting, so it's like every day you get out there. We're all trying to be the best that we can, really challenge ourselves to grow. The only way to do that is to play, be in the arena. “Like it's easy from the outside. It's easy to say the only way to get better is to be in the heat, and our group enjoys it, and we want to be in those environments. We talked about it in Oklahoma City. We'd love to be playing obviously in Vegas, but we've had some of those moments where it's going to get like that because we want to be there, and that'll make us grow.Clutch Points", "quote": "“Every day, you fight for respect every day,” Ott said. “This league changes too fast. Too many things can happen. LeBron (James) is still out there fighting, so it's like every day you get out there. We're all trying to be the best that we can, really challenge ourselves to grow. The only way to do that is to play, be in the arena", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/phoenix-suns/do-the-suns-have-respect-back-jordan-ott-seems-to-think-so", "tags": ["Phoenix Suns", "Jordan Ott"]}, {"date": "", "archive_date": "2025-12-17", "text": "Despite a move from linear television to streaming,the NBA Cup semifinals posted a healthy increase over last year. Saturday’s NBA Cup semifinals averaged 1.67 million viewers on Amazon Prime Video, up 14% from last year, when the games aired on ABC and TNT. The double-digit increase is a sharp turnaround from the quarterfinals, which were down 20%.Sports Media Watch", "quote": "the NBA Cup semifinals posted a healthy increase over last year", "outlet": "Sports Media Watch", "source_url": "https://www.sportsmediawatch.com/2025/12/nba-cup-viewership-semifinals-up-prime-video/", "tags": ["TV Ratings", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Norman Powell: “I was extremely surprised just because, one, the year that I had, you know, almost making All-Star, um, filling that void. Like they—I feel like they didn't think that I'd been able to step into that role the way I did. Andthen like everybody talking about how I did in the season and them, you know, being up for the contract extension, going into the exit meetings and stuff and talking to them like, ‘Oh, we love you, we want you here as a Clipper, we’ll figure out the extension.’Uh, when I come back—I was in Europe too with my girlfriend—uh, ‘When you come back, Summer League, that’s when talks and stuff open up.’ So I’m expecting that. About maybe like four days before my trip over, talking to my agent, that there’s like some smoke in the air, some rumblings and stuff. Um, then he called me, uh, two days later—I’m on a damn boat trip, doing a tour with my girl, in the middle of the tour—shut the whole thing down. Like, tour over with.”YouTube", "quote": "then like everybody talking about how I did in the season and them, you know, being up for the contract extension, going into the exit meetings and stuff and talking to them like, ‘Oh, we love you, we want you here as a Clipper, we’ll figure out the extension.’", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=zB2AEX1EUPo", "tags": ["Los Angeles Clippers", "Miami Heat", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-17", "text": "Norman Powell:Yeah, but I was shocked because they were just saying that they want to give me an extension. And then from there to being traded, you know, it’s like—you have to tell me that, right? Just keep it business.Don’t tell me you want me here, then you just automatically trade me for whatever.YouTube", "quote": "Yeah, but I was shocked because they were just saying that they want to give me an extension. And then from there to being traded, you know, it’s like—you have to tell me that, right? Just keep it business.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=zB2AEX1EUPo", "tags": ["Los Angeles Clippers", "Miami Heat", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-17", "text": "Norman Powell:“The anger and s*** goes toward the front office, you know what I mean? Um, usually does. So like my job is to go out there and show you that you made a mistake—not that, you know, whatever you feel for your team. But I’m gonna come out and prove to you that, like, y’all shouldn’t have traded me. “So that’s where my motivation comes from. But like, yeah, I don’t find motivation from like other players and what they doing. I feel like I’m past that. Like I had that when I was first coming into the league—like that whole list. I’m a 46 pick, but they got Rashad Vaughn, Terry Rozier, they got Delon Wright. Like I had like RJ Hunter, a whole list of guys that were kill—that were drafted ahead of me. Like, ‘Oh, you think 45 people are better than me? All right, cool. I’m gonna go show you.’YouTube", "quote": "“The anger and s*** goes toward the front office, you know what I mean? Um, usually does. So like my job is to go out there and show you that you made a mistake—not that, you know, whatever you feel for your team. But I’m gonna come out and prove to you that, like, y’all shouldn’t have traded me", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=zB2AEX1EUPo", "tags": ["Los Angeles Clippers", "Miami Heat", "RJ Hunter", "Delon Wright", "Rashad Vaughn", "Terry Rozier", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-17", "text": "Marc J. Spears:KAT donating his $500K to his foundation in the Dominican Republic to help kids.x.com", "quote": "KAT donating his $500K to his foundation in the Dominican Republic to help kids", "outlet": "x.com", "source_url": "https://x.com/MarcJSpears/status/2001154553572724743", "tags": ["New York Knicks", "Karl-Anthony Towns", "Philanthropy", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't:KAT: \"Damn don't I look good when it says champions on a shirt?\"x.com", "quote": "KAT: \"Damn don't I look good when it says champions on a shirt?\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001155412469367192", "tags": ["New York Knicks", "Karl-Anthony Towns", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't: Wemby:\"Some people are built for this moment and some aren't…we definitely are\"x.com", "quote": "\"Some people are built for this moment and some aren't…we definitely are\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000081924748960161", "tags": ["San Antonio Spurs", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "MrBuckBuck: Knicks sophomoreTyler Kolek recreates the Kobe championship photox.com", "quote": "Tyler Kolek recreates the Kobe championship photo", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2001159224047304983", "tags": ["New York Knicks", "NBA Cup", "Tyler Kolek"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't: UD: \"Every team could use a Josh Hart bro. I love what you do dawg\" Josh: \"Appreciate you\"Jalen: \"Not if that coach looks to practice a lot\"x.com", "quote": "Jalen: \"Not if that coach looks to practice a lot\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001154200642654445", "tags": ["New York Knicks", "Frivolities", "Josh Hart", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-17", "text": "Oh No He Didn't:Mike Brown: \"Excuse me I just had a beer. Excuse me mom\"x.com", "quote": "Mike Brown: \"Excuse me I just had a beer. Excuse me mom\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001152186349216139", "tags": ["New York Knicks", "Mike Brown", "Frivolities", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-17", "text": "Austin Rivers:\"Ja’s gotta get out of Memphis. I’ve seen it. I’ve seen the experiment. I’m over it. He’s done a lot of great things there. He’s had playoff runs. He’s a very talented player. I’d like a fresh start for him — somewhere that makes sense. I would like him paired with another star. I don’t want Ja to be the best player. I don’t mind if he’s one of them, meaning like if he’s your one or two. I just don’t want him to stand out so alone. I want him to be paired with someone he can go to battle with — realistically — and actually compete. That’s a fresh start. Out of Memphis. I think the market for him down there — I would like him to get a whole rebrand. He is a star.”YouTube", "quote": "\"Ja’s gotta get out of Memphis. I’ve seen it. I’ve seen the experiment. I’m over it", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=qe54WoLUod8", "tags": ["Memphis Grizzlies", "Trade", "Austin Rivers", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-17", "text": "Sactown Sports 1140: Sacramento Kings forward Keegan Murray was asked how he's been processing Sacramento's losses. \"It sucks,\" he said after Tuesday's practice.\"I haven't been on a team that has lost many games in I don't even know how long.\"x.com", "quote": "\"I haven't been on a team that has lost many games in I don't even know how long.\"", "outlet": "x.com", "source_url": "https://x.com/Sactown1140/status/2001065920077127906?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E2001065920077127906%7Ctwgr%5Efacef32d91d77c24d974c6575621c594b398a201%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fbasketnews.com%2Fnews-236974-keegan-murray-sends-horrific-words-as-brutal-season-continues-for-kings.html", "tags": ["Sacramento Kings", "Keegan Murray"]}, {"date": "", "archive_date": "2025-12-16", "text": "After months of fact-finding and vetting from J.P. Morgan and the Raine investment group, CommissionerAdam Silver said Tuesday night that NBA is on the verge of “serious conversations” in January with prospective NBA Europe franchises that some sources believe will be tantamount to open bidding. Other sources said that the NBA Europe’s financial blueprint is crystalizing by the day. A salary cap still needs to be formalized, but a source familiar with the template said the NBA’s 30 current owners will won 50% of the league and the European franchises will own the other 50% —similar to how the WNBA is structured.Sports Business Journal", "quote": "Adam Silver said Tuesday night that NBA is on the verge of “serious conversations” in January with prospective NBA Europe franchises that some sources believe will be tantamount to open bidding", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/nba-europe-franchise-bids-could-come-in-january/", "tags": ["Adam Silver", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "Source have said that the NBA is seeking between $500M and $1B for NBA Europe franchise fees, and Silver reiterated Tuesday night that the possibilities include “soccer clubs, some who have basketball teams,some who don’t have basketball teams, existing basketball organizations who potentially would be interested in joining our league. We’re talking to other organizations or individuals who don’t own any team who would be interested if we expanded to Europe, looking at opportunities.”Sports Business Journal", "quote": "Source have said that the NBA is seeking between $500M and $1B for NBA Europe franchise fees, and Silver reiterated Tuesday night that the possibilities include “soccer clubs, some who have basketball teams,", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/nba-europe-franchise-bids-could-come-in-january/", "tags": ["NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "Considering Rockets F Kevin Durant is an investor in PSG, another prospective NBA Europe franchise, Siver said the NBA would have to “figure out a framework for those issues and work with the Players Association on that.”Under the current CBA, NBA players can only invest in WNBA franchise — not NBA teams.Sports Business Journal", "quote": "Considering Rockets F Kevin Durant is an investor in PSG, another prospective NBA Europe franchise, Siver said the NBA would have to “figure out a framework for those issues and work with the Players Association on that.”", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/nba-europe-franchise-bids-could-come-in-january/", "tags": ["Houston Rockets", "Kevin Durant", "NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "NBA VP/Global Partner Management David Brody gave a glimpse into the efforts of launching NBA Europe, according to a Q&A with Sam Bradley of DIGIDAY. Questions and answers have been edited for clarity and brevity. Q: Is the demand for more European players becoming global superstars in the NBA enough to support a European extension of the league? Brody:“The NBA is a global culture phenomenon. You can’t underscore just how important the culture aspect is to the commercial area of the business. You don’t have to look far into music, film, fashion, arts, technology to see an NBA player front and center. When I’m sitting down with brands…they want to talk about three things. One is where we sit in culture.Two, this unmatched, unparalleled global audience. And three, [that it’s] a young, multicultural, diverse, tech savvy audience. I think there’s tremendous opportunity.” Q: Would this mean importing the NBA’s American business model to Europe? Brody: “We have 17 offices around the world. I think we’re unique in the sports landscape in terms of that kind of commitment to having boots on the ground in local markets. In our London office, we have over 100 employees who wake up every single day thinking about the fact that the basketball experience there is different from where it is in the United States.”Sports Business Journal", "quote": "“The NBA is a global culture phenomenon. You can’t underscore just how important the culture aspect is to the commercial area of the business. You don’t have to look far into music, film, fashion, arts, technology to see an NBA player front and center. When I’m sitting down with brands…they want to talk about three things. One is where we sit in culture.", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/16/qa-nbas-brody-details-efforts-plans-for-possible-european-extension/", "tags": ["NBA Europe"]}, {"date": "", "archive_date": "2025-12-16", "text": "Legion Hoops:Steve McGehee: The Lone Soldier.x.com", "quote": "Steve McGehee: The Lone Soldier", "outlet": "x.com", "source_url": "https://x.com/LegionHoops/status/2001147841537040737", "tags": ["New York Knicks", "Awards", "OG Anunoby", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "James L. Edwards: Jalen Brunson starts his speech with shouting out OG, Kolek, Robinson and Clarkson.\"Without them, we don't win this.\"Bluesky", "quote": "\"Without them, we don't win this.\"", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jledwardsiii.bsky.social/post/3ma5shcgbc22t", "tags": ["New York Knicks", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Tim Bontemps: Dylan Harper on the ceiling for this San Antonio Spurs team now that they’re finally whole and healthy:“The sky is the limit.”x.com", "quote": "“The sky is the limit.”", "outlet": "x.com", "source_url": "https://x.com/TimBontemps/status/2001147522463752426", "tags": ["San Antonio Spurs", "NBA Cup", "Dylan Harper"]}, {"date": "", "archive_date": "2025-12-16", "text": "Tom Haberstroh: 32 Second-Chance Points for the Knicks. Most by a Knicks team in regulation in ... 2025-26 2024-25 2023-24 2022-23 2021-22 2020-21Hadn't been done since 2020.x.com", "quote": "Hadn't been done since 2020", "outlet": "x.com", "source_url": "https://x.com/tomhaberstroh/status/2001147289750950370", "tags": ["New York Knicks", "Statistics"]}, {"date": "", "archive_date": "2025-12-16", "text": "Ian Begley:Knicks come back from 11 down late in 3rd quarter to take NBA Cup championship with win over Spurs.Mitchell Robinson (10 offensive rebounds) was huge in 2nd half; Jordan Clarkson (15 pts) & Tyler Kolek (14 points, 5 assists, 5 rebounds, one TO) gave Knicks life off bench.x.com", "quote": "Knicks come back from 11 down late in 3rd quarter to take NBA Cup championship with win over Spurs.", "outlet": "x.com", "source_url": "https://x.com/IanBegley/status/2001144091111805204", "tags": ["New York Knicks", "San Antonio Spurs", "Jordan Clarkson", "Mitchell Robinson", "NBA Cup", "Tyler Kolek"]}, {"date": "", "archive_date": "2025-12-16", "text": "Marc J. Spears: Knicks guardJalen Brunson is MVP of the NBA Cup.x.com", "quote": "Jalen Brunson is MVP of the NBA Cup", "outlet": "x.com", "source_url": "https://x.com/MarcJSpears/status/2001144050418868381", "tags": ["New York Knicks", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Keerthika Uthayakumar: Including the NBA Cup Championship,the Knicks are 13-4 with OG Anunoby in the lineup.x.com", "quote": "the Knicks are 13-4 with OG Anunoby in the lineup", "outlet": "x.com", "source_url": "https://x.com/keerthikau/status/2001144785776615476", "tags": ["New York Knicks", "OG Anunoby", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jake Fischer:Another weird thing I learned this week... two-way players can't receive the full amount of NBA Cup prize money as standard roster players. Justice for the two-way guys!x.com", "quote": "Another weird thing I learned this week... two-way players can't receive the full amount of NBA Cup prize money as standard roster players. Justice for the two-way guys!", "outlet": "x.com", "source_url": "https://x.com/JakeLFischer/status/2001145337348534373", "tags": ["Trade"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jorge Sierra:How much do Knicks players increase their yearly earnings by winning the NBA Cup?x.com", "quote": "How much do Knicks players increase their yearly earnings by winning the NBA Cup?", "outlet": "x.com", "source_url": "https://x.com/hoopshype/status/2001142047344902262", "tags": ["New York Knicks", "Salaries", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "The NBA and Las Vegas have been linked for many years. A summer league has been held in the city annually since 2004, and Team USA basketball also trains in Las Vegas —though sources close to the program said it could look for a new location to train for 2027 FIBA World Cup and and 2028 Olympics in Los Angeles.While a city might want to propose hosting the NBA Cup final, the league could stick with Las Vegas and allow the event to grow as it did with Las Vegas Summer League, which has become a signature event for the league that many veterans make a point to attend.New York Times", "quote": "though sources close to the program said it could look for a new location to train for 2027 FIBA World Cup and and 2028 Olympics in Los Angeles.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6895286/2025/12/16/nba-cup-future-adam-silver-college-arena/", "tags": ["Las Vegas", "Team USA"]}, {"date": "", "archive_date": "2025-12-16", "text": "Appearing on Prime’s pregame coverage of the NBA Cup Final between the New York Knicks and San Antonio Spurs, Silver expressed why he thought the Prime Video studio of Taylor Rooks, Dirk Nowitzki, Steve Nash, Blake Griffin, and Udonis Haslem was “fantastic” compared to others broadcasting the league. “By the way, in all honesty, I love the chemistry of you guys. I mean, obviously, it’s why you did so well in a team sport.The chemistry’s fantastic,” Silver began. “And I also will just say quickly, as a fan, I think you do a great job educating other fans about the game because that, I would say, has frustrated me in the past about some coverage when it’s sort of reduced to ‘one side wanted it more’ or ‘this side played harder.’When you guys are explaining, like, why can’t a guy get a shot off, why is a particular defense working, I think the studio you guys built is off the charts. And I think the technology that you’re using- when you guys go out on the floor to demonstrate things, I can say as a fan I love that part of the coverage.”Awful Announcing", "quote": "The chemistry’s fantastic,” Silver began. “And I also will just say quickly, as a fan, I think you do a great job educating other fans about the game because that, I would say, has frustrated me in the past about some coverage when it’s sort of reduced to ‘one side wanted it more’ or ‘this side played harder.’", "outlet": "Awful Announcing", "source_url": "https://awfulannouncing.com/nba/adam-silver-praises-prime-crew-frustrated-coverage-elsewhere.html", "tags": ["New York Knicks", "San Antonio Spurs", "Blake Griffin", "Steve Nash", "Dirk Nowitzki", "Udonis Haslem", "Adam Silver", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Oh No He Didn't:Adam Silver says \"some storied college locations\" are under consideration for future NBA cup championship gamesx.com", "quote": "Adam Silver says \"some storied college locations\" are under consideration for future NBA cup championship games", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001097598237605922", "tags": ["Adam Silver", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "New York Basketball: Dirk on OG: \"He wanted to know more about shooting so last year he reached out tome…He wanted to know every little detail about feet, positioning of hands, breathing, where eyes go––he asked me all sorts of questions.One main thing I told him about: finger position on ball\"x.com", "quote": "me…He wanted to know every little detail about feet, positioning of hands, breathing, where eyes go––he asked me all sorts of questions.", "outlet": "x.com", "source_url": "https://x.com/NBA_NewYork/status/2001103944207003911", "tags": ["New York Knicks", "Dirk Nowitzki", "OG Anunoby"]}, {"date": "", "archive_date": "2025-12-16", "text": "Silver touched on a variety of potential issues -- including players specializing in a single sport at a far earlier age than in the past, the faster pace of play today than in the past and the year-round training of athletes -- as all potentially playing a part, before saying the league is committed to studying the issue in every way possible. \"So the answer is it's frustrating,\" Silver said.\"It's frustrating for our teams. It's frustrating for our fans. But I do think we have to be true to what the evidence is as opposed to saying there's a narrative out there that injuries are up or injuries are up because of scheduling. They're not.\"ESPN", "quote": "\"It's frustrating for our teams. It's frustrating for our fans. But I do think we have to be true to what the evidence is as opposed to saying there's a narrative out there that injuries are up or injuries are up because of scheduling. They're not.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47330098/adam-silver-decision-nba-expansion-made-2026", "tags": ["Injuries", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Attendance at the semifinals and final at T-Mobile Arena was rough, with empty seats littered around the arena.A plethora of fans got free tickets as “seat fillers” through a popular ticketing website called 1iota.com for the semis and final, The Post has learned.And those seats weren’t way up in the nosebleeds — they were courtside.New York Post", "quote": "A plethora of fans got free tickets as “seat fillers” through a popular ticketing website called 1iota.com for the semis and final, The Post has learned.", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/16/sports/nba-gave-away-courtside-seats-to-beef-up-cup-final-crowd/", "tags": ["Business", "Las Vegas", "Fans", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Barry Jackson: Kudos to @ByTimReynolds for asking if NBA has considered giving Heat relief of some kind (with cap or draft). \"This is an unprecedented situation. I'm incredibly sympathetic to the Heat and their fans.We are going to try to work something out with them. There's no obvious solution. As to the draft pick they conveyed, he hasn't been convicted of anything. It's an unfortunate circumstance..We will be looking at this with the Heat.. and see if there's any satisfactory relief. At the moment, there is none.\"x.com", "quote": "We are going to try to work something out with them. There's no obvious solution. As to the draft pick they conveyed, he hasn't been convicted of anything. It's an unfortunate circumstance..", "outlet": "x.com", "source_url": "https://x.com/flasportsbuzz/status/2001094867317825798", "tags": ["Miami Heat", "Draft", "Adam Silver", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-16", "text": "Keith Smith: On NBA expansion, Adam Silver said the league continues to study domestic expansion.Silver said the NBA will make a decision in 2026 on whether to move forward with the domestic expansion process. Silver said he's very cognizant of not \"teasing\" cities with drawn out talks.x.com", "quote": "Silver said the NBA will make a decision in 2026 on whether to move forward with the domestic expansion process", "outlet": "x.com", "source_url": "https://x.com/KeithSmithNBA/status/2001093129756188773", "tags": ["Adam Silver", "NBA Expansion"]}, {"date": "", "archive_date": "2025-12-16", "text": "Marc J. Spears: Adam Silver said he has talked to Chris Paul and was in bed when he got the alert that CP was sent home from the Clippers.“I’d love to see him finish off the season on another team,” Silver said. Silver said “it’s not for him to say” whether LAC should’ve handled it better.x.com", "quote": "“I’d love to see him finish off the season on another team,” Silver said. Silver said “it’s not for him to say” whether LAC should’ve handled it better", "outlet": "x.com", "source_url": "https://x.com/MarcJSpears/status/2001090435788497217", "tags": ["Los Angeles Clippers", "Chris Paul", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Oh No He Didn't:\"I've talked to Chris, I've talked to Steve Ballmer but frankly not about this.I probably was in bed when I saw an alert on my phone. I would say I was dismayed just for everyone involved...I would love to see him finish off the season on another team\"x.com", "quote": "\"I've talked to Chris, I've talked to Steve Ballmer but frankly not about this.", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2001091476416086232", "tags": ["Los Angeles Clippers", "Chris Paul", "Steve Ballmer", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Marc Stein: Adam Silver acknowledges concern with the soft tissue injuries that have sidelined numerous star players this season and says the league office is \"very focused on it\" but pushes back on the notion early season game overload is causing the injuries.\"They're not,\" Silver said.x.com", "quote": "\"They're not,\" Silver said", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2001091094067425585", "tags": ["NBA", "Injuries", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "Mike Vorkunov: Adam Silver is \"optimistic\" about a new WNBA CBA deal.\"We acknowledge that our players deserve to be paid significantly more than they have so far based on the increased success of the league.It’s just a question of finding a meeting of the minds on what is a fair deal.\"x.com", "quote": "\"We acknowledge that our players deserve to be paid significantly more than they have so far based on the increased success of the league.", "outlet": "x.com", "source_url": "https://x.com/MikeVorkunov/status/2001095595834921079", "tags": ["CBA", "WNBA", "Adam Silver"]}, {"date": "", "archive_date": "2025-12-16", "text": "“Everything I do on the court, I couldn't do,” Allen said to reporters. “Even on the bench, trying to clap for teammates, I literally had to clap with my wrist to try to make it work.So I was struggling there for a while.” Allen explained that his first injury occurred in the second game of the season, spraining his right finger in Brooklyn on October 24, and “it's been bothering me since.” The left ring finger fracture happened five days after that, on the road in Boston. “I've basically been playing with two hurt fingers on two different hands for the past month before I sat out,” Allen said. “At this point, it's just been recovery, trying to make sure that I can get back in shape, make sure that I don't re-injure it and set myself back even further. So, it's just been a lot of conditioning, a lot of waiting, just a lot of trying to get ready to play again.”Clutch Points", "quote": "“Everything I do on the court, I couldn't do,” Allen said to reporters. “Even on the bench, trying to clap for teammates, I literally had to clap with my wrist to try to make it work.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/cavs-jarrett-allen-breaks-silence-finger-injuries-clap-wrist", "tags": ["Cleveland Cavaliers", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "These finger problems have affected Allen's ability to catch the ball and shoot with either hand. “Honestly, they both hurt equally,” Allen said.“I mean, they were both bad. This one [on my left], breaking a bone, but spraining a ligament. Like, I can't even straighten this [right] finger out anymore.That's how bad it was.”Clutch Points", "quote": "“I mean, they were both bad. This one [on my left], breaking a bone, but spraining a ligament. Like, I can't even straighten this [right] finger out anymore.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/cavs-jarrett-allen-breaks-silence-finger-injuries-clap-wrist", "tags": ["Cleveland Cavaliers", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "Allen was the only one of the three to attribute the struggles to a lack of confidence. “I feel like we know we're a good team,” Allen said.“We know that we have all this ability to do it, but sometimes we all get down on ourselves. Sometimes you question yourself. I think if we get back to how we were last year, where we're not questioning if we could do it or questioning how far we're going to take it, I think that's going to be good for us.”Clutch Points", "quote": "“We know that we have all this ability to do it, but sometimes we all get down on ourselves. Sometimes you question yourself. I think if we get back to how we were last year, where we're not questioning if we could do it or questioning how far we're going to take it, I think that's going to be good for us.”", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/darius-garland-jarrett-allen-pinpoint-reason-cavs-inconsistencies", "tags": ["Cleveland Cavaliers", "Jarrett Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "It's pretty frustrating. I don't know if it's, like, the most frustrating I've been through,” Wade said after Tuesday's practice. “We did have a year where we won 17 games; that was pretty frustrating.With this much talent, and we're playing hard, doing the right things, it's frustrating to not see shots fall when they normally would. And I think that's the most frustrating part is we're doing everything right.We're taking the right process and doing it. It's just things aren't falling our direction right now and that is frustrating. “But I wouldn't say it's the most frustrating thing I've been a part of because we still have that belief. We know we have the talent to come out of this on the right side. So, it's frustrating, but we obviously know we're a better team than what we're showing. We've just got to get some things squared away, go through a few things, fine tune some things, and I think we'll be back – we won't even remember this frustrating part.”Clutch Points", "quote": "With this much talent, and we're playing hard, doing the right things, it's frustrating to not see shots fall when they normally would. And I think that's the most frustrating part is we're doing everything right.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/cleveland-cavaliers/darius-garland-jarrett-allen-pinpoint-reason-cavs-inconsistencies", "tags": ["Cleveland Cavaliers", "Dean Wade"]}, {"date": "", "archive_date": "2025-12-16", "text": "Dan Weiss: Mike Brown asked if he got any intel from Victor’s French national teammate Guerschon Yabusele “I think his intel is the same as anyone playing Wemby the night before.You go to church, get down on your knees and say a prayer to the good lord.”x.com", "quote": "You go to church, get down on your knees and say a prayer to the good lord.”", "outlet": "x.com", "source_url": "https://x.com/DanWeissPBP/status/2001080388396179695", "tags": ["New York Knicks", "San Antonio Spurs", "Mike Brown", "Guerschon Yabusele", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-16", "text": "Dan Weiss:Mitch Johnson says the plan for Victor will look a lot like the last game with maybe a couple more minutes.x.com", "quote": "Mitch Johnson says the plan for Victor will look a lot like the last game with maybe a couple more minutes", "outlet": "x.com", "source_url": "https://x.com/DanWeissPBP/status/2001080832446930959", "tags": ["San Antonio Spurs", "Mitch Johnson", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-16", "text": "Law Murray: Ja Morant sprained his left ankle last night at Intuit Dome.He is questionable for tomorrow at MinnesotaBrandon Clarke (knee) is questionable to make his season debut. Cam Spencer (personal) is outx.com", "quote": "He is questionable for tomorrow at Minnesota", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/2001065716695388350", "tags": ["Memphis Grizzlies", "Minnesota Timberwolves", "Injuries", "Ja Morant", "Brandon Clarke", "Cam Spencer"]}, {"date": "", "archive_date": "2025-12-16", "text": "Lester Jones, a former top Atlanta Hawks finance executive, pleaded guilty Tuesday to a federal wire fraud charge after prosecutors alleged that he embezzled $3.8 million from the team. Jones had been a senior vice president of financial planning and analysis until last season but was indicted in October by the U.S. Attorney’s Office for the Northern District of Georgia for using his position to enrich himself on the franchise’s account.New York Times", "quote": "Lester Jones, a former top Atlanta Hawks finance executive, pleaded guilty Tuesday to a federal wire fraud charge after prosecutors alleged that he embezzled $3.8 million from the team", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6894932/2025/12/16/hawks-executive-guilty-lester-jones-nba/", "tags": ["Atlanta Hawks", "Law"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotto: \"To my understanding, Utah wants to build around Lauri Markkanen. What they want to do, ideally, they have a ton of cap space this summer. Use it to make the roster better. If they're going to be in the lottery this year, they hope that's the last time for the foreseeable future where they can start to build this thing. Re-sign Walker Kessler, but wait until you use the cap space.Lauri draws a ton of interest around the league, but right now, Utah wants to hold onto him.\"x.com", "quote": "Lauri draws a ton of interest around the league, but right now, Utah wants to hold onto him.\"", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000982943486108013", "tags": ["Utah Jazz", "Trade", "Lauri Markkanen", "Walker Kessler"]}, {"date": "", "archive_date": "2025-12-16", "text": "A season that had become a waiting game will continue to be that way for Miami Heat forward Nikola Jovic, now sidelined by an elbow injury suffered in Monday night’s loss to the Toronto Raptors. An MRI Tuesday showed only a contusion and laceration, with Jovic listed going forward as day to day.South Florida Sun-Sentinel", "quote": "A season that had become a waiting game will continue to be that way for Miami Heat forward Nikola Jovic, now sidelined by an elbow injury suffered in Monday night’s loss to the Toronto Raptors", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/16/heat-breathe-sigh-of-relief-after-nikola-jovics-injury-scare-herro-gets-mri/", "tags": ["Miami Heat", "Injuries", "Nikola Jovic"]}, {"date": "", "archive_date": "2025-12-16", "text": "The Heat also revealed a follow-up MRI on Tyler Herro’s right big toe, again showing only a contusion.Herro also is listed as day to day.South Florida Sun-Sentinel", "quote": "The Heat also revealed a follow-up MRI on Tyler Herro’s right big toe, again showing only a contusion.", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/16/heat-breathe-sigh-of-relief-after-nikola-jovics-injury-scare-herro-gets-mri/", "tags": ["Miami Heat", "Injuries", "Tyler Herro"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jon Krawczynski:Edwards questionable for tomorrow.Mike Conley remains outx.com", "quote": "Edwards questionable for tomorrow.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/2001044929322049565", "tags": ["Minnesota Timberwolves", "Injuries", "Mike Conley", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jon Krawczynski:Rudy Gobert announces the birth of his baby girl.x.com", "quote": "Rudy Gobert announces the birth of his baby girl", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/2001063693207921032", "tags": ["Minnesota Timberwolves", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-16", "text": "Nick DePaula:Tyrese Haliburton gifted the current Oshkosh North High School squads with exclusive pairs of his Puma Hali 1 signature shoe. \"Once it became a reality that I was getting my own shoe, there was no question we had to do a pair dedicated to my roots,\" says @Halix.com", "quote": "Tyrese Haliburton gifted the current Oshkosh North High School squads with exclusive pairs of his Puma Hali 1 signature shoe", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/2001063487813066763", "tags": ["Indiana Pacers", "Sneakers", "High School", "Tyrese Haliburton"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotto: \"For Milwaukee, in talking with their front office people, they still want to build around Giannis... They're still active on the trade market now trying to find another piece to help build this Bucks team withGiannis...Talking to rival executives that have interest in trading for Giannis, they've told me they don't think Milwaukee wants to move him right now.\"x.com", "quote": "Giannis...Talking to rival executives that have interest in trading for Giannis, they've told me they don't think Milwaukee wants to move him right now.\"", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000627903059669104", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotto: \"Hawks officials are hoping he (Trae Young) can come back at some point later this month... The Hawks have had a better defensive rating without Trae.Something to consider for the summer when he has a player option, and now NBA executives are thinking that he may have to pick that up.\"x.com", "quote": "Something to consider for the summer when he has a player option, and now NBA executives are thinking that he may have to pick that up.\"", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000964420483322296", "tags": ["Atlanta Hawks", "Trae Young"]}, {"date": "", "archive_date": "2025-12-16", "text": "Eric Nehm: Per league sources,the Bucks have applied for a Disabled Player Exception (DPE) for Taurean Prince. The Bucks ruled Prince out indefinitely after he underwent surgery to address the herniated disc in his neck on Nov. 13.x.com", "quote": "the Bucks have applied for a Disabled Player Exception (DPE) for Taurean Prince", "outlet": "x.com", "source_url": "https://x.com/eric_nehm/status/2001034429595312337", "tags": ["Milwaukee Bucks", "Taurean Prince"]}, {"date": "", "archive_date": "2025-12-16", "text": "Keith Smith:$2.7M for this DPE.Could be used to give a player more than the prorated minimum down the line. Bulls have until March 10 to use it.x.com", "quote": "$2.7M for this DPE.", "outlet": "x.com", "source_url": "https://x.com/KeithSmithNBA/status/2001033568479248801", "tags": ["Chicago Bulls", "Noa Essengue"]}, {"date": "", "archive_date": "2025-12-16", "text": "Duane Rankin: \"Chaotic. Crazy. Everything in between.\" \"We were right there.\" Mark Williams and Royce O'Neale on Suns 116-114 loss to Lakers. Jordan Ott on Last Two-Minute report:\"Game's over. I've been through it multiple times. They do their evaluation afterwards, we do ours. Doesn't change anything. We'll move on. We've got to get better.\"x.com", "quote": "\"Game's over. I've been through it multiple times. They do their evaluation afterwards, we do ours. Doesn't change anything. We'll move on. We've got to get better.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2001033926853451887", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Royce O'Neale", "Jordan Ott", "Mark Williams"]}, {"date": "", "archive_date": "2025-12-16", "text": "Duane Rankin: Suns coach Jordan Ott on Devin Booker's response to return game after missing previous three with a right groin strain: \"Good. That was a big takeaway, big step in it. Everything seemed to be pretty good.\" On Isaiah Livers (right hip strain) progress:\"It's kind of been up and down. His injury is so unique to not only him, but everyone around the league. What he's coming back from. Being out that long. So when he feels pain or when he feels it's not right, we have to figure out exactly what it is.\"Livers missed all last season after having hip surgery.x.com", "quote": "\"It's kind of been up and down. His injury is so unique to not only him, but everyone around the league. What he's coming back from. Being out that long. So when he feels pain or when he feels it's not right, we have to figure out exactly what it is.\"", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2001031515606786138", "tags": ["Phoenix Suns", "Injuries", "Devin Booker", "Jordan Ott", "Isaiah Livers"]}, {"date": "", "archive_date": "2025-12-16", "text": "Anthony Slater:Al Horford is back on the court. Steve Kerr said his injury issue has healed.Called him doubtful for Thursday in Phoenix, but nearing a return.Twitter @anthonyVslater", "quote": "Al Horford is back on the court. Steve Kerr said his injury issue has healed.", "outlet": "Twitter @anthonyVslater", "source_url": "https://hoopshype.com/social/", "tags": ["Golden State Warriors", "Al Horford", "Injuries"]}, {"date": "", "archive_date": "2025-12-16", "text": "Anthony Slater: In a search for better continuity,Steve Kerr said he will keep the five-man group of Steph Curry, Moses Moody, Jimmy Butler, Draymond Green and Quinten Post as the established starting lineup for the foreseeable future(barring injury).Twitter @anthonyVslater", "quote": "Steve Kerr said he will keep the five-man group of Steph Curry, Moses Moody, Jimmy Butler, Draymond Green and Quinten Post as the established starting lineup for the foreseeable future", "outlet": "Twitter @anthonyVslater", "source_url": "https://hoopshype.com/social/", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Stephen Curry", "Jimmy Butler", "Draymond Green", "Moses Moody", "Quinten Post"]}, {"date": "", "archive_date": "2025-12-16", "text": "Anthony Slater:Steve Kerr on the Joe Lacob email leak about his current frustrations (included “coaches desires regarding players”) “Not a big deal.” “Imagine if everyone’s emails were posted publicly, how tough that would be to live.”“Joe supports me. I support him.”Twitter @anthonyVslater", "quote": "Steve Kerr on the Joe Lacob email leak about his current frustrations (included “coaches desires regarding players”) “Not a big deal.” “Imagine if everyone’s emails were posted publicly, how tough that would be to live.”", "outlet": "Twitter @anthonyVslater", "source_url": "https://hoopshype.com/social/", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Joe Lacob", "Owners"]}, {"date": "", "archive_date": "2025-12-16", "text": "Dan Woike:Pretty insightful (and succinct) answer from JJ Redick when I asked him today about what's the best way to play around star players. \"It depends on what the star player does well.\"Q: What's the best way to play around your star player? \"Defend and shoot threes.\"Twitter @DanWoikeSports", "quote": "Pretty insightful (and succinct) answer from JJ Redick when I asked him today about what's the best way to play around star players. \"It depends on what the star player does well.\"", "outlet": "Twitter @DanWoikeSports", "source_url": "https://hoopshype.com/social/", "tags": ["Coaching", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-16", "text": "Dan Woike:Luka Dončić bought every member of the basketball ops staff, players and coaches e-bikes- “a very nice gesture,” JJ Redick said.Twitter @DanWoikeSports", "quote": "Luka Dončić bought every member of the basketball ops staff, players and coaches e-bikes", "outlet": "Twitter @DanWoikeSports", "source_url": "https://hoopshype.com/social/", "tags": ["Los Angeles Lakers", "Coaching", "JJ Redick", "Luka Doncic"]}, {"date": "", "archive_date": "2025-12-16", "text": "Chris Hine:Chris Finch said Anthony Edwards did player development work (he's hanging around after practice to do some work too) but was not an \"active\" participant in practice today.Said he and Mike Conley are getting \"closer and closer.\"Bluesky", "quote": "Chris Finch said Anthony Edwards did player development work (he's hanging around after practice to do some work too) but was not an \"active\" participant in practice today.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/christopherhine.bsky.social/post/3ma4weypumc27", "tags": ["Minnesota Timberwolves", "Injuries", "Mike Conley", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jim Eichenhofer:James Borrego today on Jordan Poole being a difference-maker for #Pelicans: \"Overall, his impact on the game is tremendous. Just how he can score the ball, stretch the defense, make plays.He can go on a big roll by himself – he can turn a 2-point game into an 8-point game quickly.\"Twitter @Jim_Eichenhofer", "quote": "James Borrego today on Jordan Poole being a difference-maker for #Pelicans: \"Overall, his impact on the game is tremendous. Just how he can score the ball, stretch the defense, make plays.", "outlet": "Twitter @Jim_Eichenhofer", "source_url": "https://hoopshype.com/social/", "tags": ["New Orleans Pelicans", "Coaching", "James Borrego"]}, {"date": "", "archive_date": "2025-12-16", "text": "NBA Communications:Rio Grande Valley Vipers forward Teddy Allen has been named the NBA G League Player of the Weekfor games played Monday, Dec. 8 through Sunday, Dec. 14.Twitter", "quote": "Rio Grande Valley Vipers forward Teddy Allen has been named the NBA G League Player of the Week", "outlet": "Twitter", "source_url": "http://twitter.com/NBAPR/status/2001019644896010307", "tags": ["G League", "Awards", "Teddy Allen"]}, {"date": "", "archive_date": "2025-12-16", "text": "Sean Cunningham:Zach LaVine suffered a moderate left ankle sprain and will be reevaluated in one week.Domantas Sabonis has an illness and is not at practice today.Twitter @SeanCunningham", "quote": "Zach LaVine suffered a moderate left ankle sprain and will be reevaluated in one week.", "outlet": "Twitter @SeanCunningham", "source_url": "https://hoopshype.com/social/", "tags": ["Sacramento Kings", "Injuries", "Zach LaVine", "Domantas Sabonis"]}, {"date": "", "archive_date": "2025-12-16", "text": "James Ham: According to a league source, Kings centerDomantas Sabonis is set to be re-evaluated in the coming days. He is a month into a 3-4 week re-evaluation window.The initial MRI was conducted on Nov. 16.Twitter @James_HamNBA", "quote": "Domantas Sabonis is set to be re-evaluated in the coming days. He is a month into a 3-4 week re-evaluation window.", "outlet": "Twitter @James_HamNBA", "source_url": "https://hoopshype.com/social/", "tags": ["Sacramento Kings", "Injuries", "Domantas Sabonis"]}, {"date": "", "archive_date": "2025-12-16", "text": "Anthony Slater:Pat Spencer is out Thursday in Phoenix for personal reasons,per Warriors.Twitter @anthonyVslater", "quote": "Pat Spencer is out Thursday in Phoenix for personal reasons,", "outlet": "Twitter @anthonyVslater", "source_url": "https://hoopshype.com/social/", "tags": ["Golden State Warriors", "Pat Spencer"]}, {"date": "", "archive_date": "2025-12-16", "text": "Federal prosecutors asked the judge overseeing the illegal sports gambling case involving Terry Rozier to determine if a conflict of interest exists because the Miami Heat guard is paying the legal fees of one of his codefendants.Prosecutors said in a new legal filing on Tuesday that Rozier’s lawyer may ultimately try to blame that codefendant, Deniro Laster, for the crime as well, allegations that Rozier’s lawyer has denied.New York Times", "quote": "Federal prosecutors asked the judge overseeing the illegal sports gambling case involving Terry Rozier to determine if a conflict of interest exists because the Miami Heat guard is paying the legal fees of one of his codefendants.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6894254/2025/12/16/terry-rozier-nba-sports-gambling-betting-deniro-laster/", "tags": ["Miami Heat", "Law", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-16", "text": "Rozier, who has made more than $100 million during his NBA career, is longtime friends with Laster. Prosecutors allege Rozier told Laster that Rozier was leaving a March 2023 game early.Laster, according to an indictment filed in October, sold that information to a group of sports gamblers, who then made wagers on Rozier’s statistics for that game. Rozier and Laster were both arrested and charged this fall on two federal counts and have both pleaded not guilty.New York Times", "quote": "Rozier, who has made more than $100 million during his NBA career, is longtime friends with Laster. Prosecutors allege Rozier told Laster that Rozier was leaving a March 2023 game early.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6894254/2025/12/16/terry-rozier-nba-sports-gambling-betting-deniro-laster/", "tags": ["Miami Heat", "Law", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-16", "text": "Prosecutors pointed to (Terry Rozier’s lawyer Jim) Trusty’s comments in the days after Rozier’s arrest, where he said that Rozier told a friend that he would come out of the game.Trusty told CNN that Rozier “relied on a bad friend” and told Fox News, “whatever that friend did is not on Terry (Rozier).”New York Times", "quote": "Trusty told CNN that Rozier “relied on a bad friend” and told Fox News, “whatever that friend did is not on Terry (Rozier).”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6894254/2025/12/16/terry-rozier-nba-sports-gambling-betting-deniro-laster/", "tags": ["Miami Heat", "Law", "Terry Rozier"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jim Oczwarski:Giannis Antetokounmpo is about two weeks removed from his calf strain. He's doing some stationary shooting, but that's it.The long end of the initial recovery window was four weeks, which Doc Rivers said at the beginning was the more likely timeframe of a potential return for Giannis Antetokounmpo #NBASkyBluesky", "quote": "Giannis Antetokounmpo is about two weeks removed from his calf strain. He's doing some stationary shooting, but that's it.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jimowczarski.bsky.social/post/3ma4uqoafpk2k", "tags": ["Milwaukee Bucks", "Injuries", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jim Oczwarski: #Bucks head coachDoc Rivers said AJ Green was a limited participant in practice and would be considered day-to-daywith the AC joint sprain in his left shoulder.Bluesky", "quote": "Doc Rivers said AJ Green was a limited participant in practice and would be considered day-to-day", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jimowczarski.bsky.social/post/3ma4uqoafpk2k", "tags": ["Milwaukee Bucks", "Injuries", "AJ Green"]}, {"date": "", "archive_date": "2025-12-16", "text": "Atlanta Hawks PR:The Atlanta Hawks announced today that two-way forward Caleb Houstan has been transferred to the College Park Skyhawksfrom the Hawks.Twitter @HawksPR", "quote": "The Atlanta Hawks announced today that two-way forward Caleb Houstan has been transferred to the College Park Skyhawks", "outlet": "Twitter @HawksPR", "source_url": "http://twitter.com/HawksPR/status/2001009831524581725", "tags": ["Atlanta Hawks", "G League", "Caleb Houstan"]}, {"date": "", "archive_date": "2025-12-16", "text": "K.C. Johnson:Ayo Dosunmu: “We need to play harder.” Said the effort has stemmed from mental issues, meaning the missed shots and/or losing has impacted effort.Said team’s 5-0 start featured better effort.Twitter @KCJHoop", "quote": "Ayo Dosunmu: “We need to play harder.” Said the effort has stemmed from mental issues, meaning the missed shots and/or losing has impacted effort.", "outlet": "Twitter @KCJHoop", "source_url": "https://hoopshype.com/social/", "tags": ["Chicago Bulls", "Ayo Dosunmu"]}, {"date": "", "archive_date": "2025-12-16", "text": "British sports streaming giant DAZN is in advanced talks to acquire a majority stake in Main Street Sports Group, the big regional sports broadcaster in the U.S.,according to people familiar with the matter. A deal could be announced as soon as January, if the talks don’t hit any snags, the people said.Wall Street Journal", "quote": "British sports streaming giant DAZN is in advanced talks to acquire a majority stake in Main Street Sports Group, the big regional sports broadcaster in the U.S.,", "outlet": "Wall Street Journal", "source_url": "https://www.wsj.com/business/media/dazn-in-advanced-talks-for-stake-in-broadcaster-main-street-sports-ff9afcfa?", "tags": ["Media", "Business"]}, {"date": "", "archive_date": "2025-12-16", "text": "Coming out of bankruptcy with a much lighter debt load, Main Street Sports has struck partnerships with companies such as Amazon and FanDuel, including rebranding its TV channels and direct-to-consumer offering as FanDuel Sports Network. Today,Main Street Sports has the local rights to 29 major league teams in the U.S., across the National Basketball Association, the National Hockey League and Major League Baseball.Wall Street Journal", "quote": "Main Street Sports has the local rights to 29 major league teams in the U.S., across the National Basketball Association, the National Hockey League and Major League Baseball", "outlet": "Wall Street Journal", "source_url": "https://www.wsj.com/business/media/dazn-in-advanced-talks-for-stake-in-broadcaster-main-street-sports-ff9afcfa?", "tags": ["Media", "Business"]}, {"date": "", "archive_date": "2025-12-16", "text": "Joel Lorenzi:The Bulls have been granted a Disabled Player Exception in light of Noa Essengue’s season-ending shoulder procedure,league sources tell @TheAthletic.Twitter", "quote": "The Bulls have been granted a Disabled Player Exception in light of Noa Essengue’s season-ending shoulder procedure,", "outlet": "Twitter", "source_url": "http://twitter.com/JoelXLorenzi/status/2001002968460746770", "tags": ["Chicago Bulls", "Injuries", "Salaries", "Noa Essengue"]}, {"date": "", "archive_date": "2025-12-16", "text": "Jason Beede:\"I'm doing good,\" a more reserved Jalen Suggs said. \"I get to spend some time with our [medical] team and get my body right. So, I'm good.\"The #Magic guard added: \"I'm good. Just working on the body, working on the mind, get everything right and get ready [to be] back to roll.\"Twitter @therealBeede", "quote": "\"I'm doing good,\" a more reserved Jalen Suggs said. \"I get to spend some time with our [medical] team and get my body right. So, I'm good.\"", "outlet": "Twitter @therealBeede", "source_url": "https://hoopshype.com/social/", "tags": ["Orlando Magic", "Injuries", "Jalen Suggs"]}, {"date": "", "archive_date": "2025-12-16", "text": "Tim Reynolds:Nikola Jovic (elbow laceration) and Tyler Herro (toe) both had MRIs today that showed no serious issues. Both are day to day.Given how bad the Jovic fall looked last night, huge break for the Heat.Twitter @ByTimReynolds", "quote": "Nikola Jovic (elbow laceration) and Tyler Herro (toe) both had MRIs today that showed no serious issues. Both are day to day.", "outlet": "Twitter @ByTimReynolds", "source_url": "https://hoopshype.com/social/", "tags": ["Miami Heat", "Injuries", "Tyler Herro", "Nikola Jovic"]}, {"date": "", "archive_date": "2025-12-16", "text": "Darryl Peterson had 26 points on 9-for-15 shooting (nearly all of it in one half) in the Jayhawks' exhibition game at Louisville, cementing himself as the front-runner for the No. 1 pick early on. He backed that up with 21 points in the regular-season opener against Green Bay and 22 points against North Carolina.\"He has the most complete offensive game of anybody in college,\" said one college coach who scouted Kansas.\"When you combine the variety of shotmaking, the deep 3-point shooting potential, his ability to play ball in hand, I think he's a guy that's reminiscent of some of the great young players in recent memory, the last 15-20 years.\"ESPN", "quote": "\"He has the most complete offensive game of anybody in college,\" said one college coach who scouted Kansas.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47306186/no-1-pick-nba-draft-confidential-darryn-peterson-aj-dybantsa-cameron-boozer", "tags": ["Draft", "No. 1 Pick", "Darryl Peterson"]}, {"date": "", "archive_date": "2025-12-16", "text": "\"He's got a very advanced offensive scoring package, reminiscent of what an NBA wing player looks like playing in college,\" said one college coach who faced AJ Dybantsa this season.\"In high school and FIBA settings he was a little bit of a ball stopper. He's been allowing the offense to function around him and then picking his spots when he gets really aggressive. It's his ability to make tough shots, it's his size at that position, which is a valued position in the NBA. Those bigger wings that have the ability to make plays, ball in hand, put pressure on the rim, make tough shots. He's toolsy enough to become a good defender. He plays hard.\"ESPN", "quote": "\"He's got a very advanced offensive scoring package, reminiscent of what an NBA wing player looks like playing in college,\" said one college coach who faced AJ Dybantsa this season.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47306186/no-1-pick-nba-draft-confidential-darryn-peterson-aj-dybantsa-cameron-boozer", "tags": ["Draft", "No. 1 Pick", "AJ Dybantsa"]}, {"date": "", "archive_date": "2025-12-16", "text": "Cam Boozer is perceived as less of a sure bet at the next level due to his lack of explosiveness compared to Peterson and Dybantsa. But Boozer has consistently produced against high-level opponents that have NBA-caliber size, posting 35 points against Arkansas, 29 against Florida, 18 points and 15 rebounds against Michigan State, as well as double-doubles against Kansas and Texas.\"He projects to get better as a shooter and he already has good [mechanics] on his shot,\" one coach who faced Duke this season said. \"Is he the top player in this class? I don't know,but he's going to help a team win and he's going to average 20 and 10. Probably forever.\"ESPN", "quote": "\"He projects to get better as a shooter and he already has good [mechanics] on his shot,\" one coach who faced Duke this season said. \"Is he the top player in this class? I don't know,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47306186/no-1-pick-nba-draft-confidential-darryn-peterson-aj-dybantsa-cameron-boozer", "tags": ["Draft", "No. 1 Pick", "Cam Boozer"]}, {"date": "", "archive_date": "2025-12-16", "text": "The business Toronto is ultimately willing to conduct before the February trade buzzer will likely come down to how good the 16-11 Raptors still are as that deadline draws closer. Toronto, though, has sent out some early signals that it hopes to upgrade its frontcourt.Sources with knowledge of the Raptors' thinking have identified them as a team with interest in Domantas Sabonis as well as Anthony Davis.marcstein.substack.com", "quote": "Sources with knowledge of the Raptors' thinking have identified them as a team with interest in Domantas Sabonis as well as Anthony Davis", "outlet": "marcstein.substack.com", "source_url": "https://open.substack.com/pub/marcstein/p/the-many-many-layers-to-the-nbas", "tags": ["Dallas Mavericks", "Sacramento Kings", "Toronto Raptors", "Trade", "Anthony Davis", "Domantas Sabonis"]}, {"date": "", "archive_date": "2025-12-16", "text": "Another player who has been on Milwaukee's radar under the same premise, both this season and in previous years, is Trail Blazers swingman Jerami Grant. Grant has two seasons remaining on his deal after this one worth just over $70 million … and Portland already controls Milwaukee's first-round pick in 2028, 2029 and 2030 as a vestige of the Damian Lillard trademarcstein.substack.com", "quote": "Another player who has been on Milwaukee's radar under the same premise, both this season and in previous years, is Trail Blazers swingman Jerami Grant", "outlet": "marcstein.substack.com", "source_url": "https://open.substack.com/pub/marcstein/p/the-many-many-layers-to-the-nbas", "tags": ["Milwaukee Bucks", "Portland Trail Blazers", "Trade", "Jerami Grant"]}, {"date": "", "archive_date": "2025-12-16", "text": "Milwaukee regularly called about Andrew Wiggins during his tenure in Golden State, league sources say. And the Bucks were also quite interested in Dejounte Murray,sources add, while Atlanta was holding the trade conversations that ultimately landed the former All-Star point guard on Bourbon Street.marcstein.substack.com", "quote": "Milwaukee regularly called about Andrew Wiggins during his tenure in Golden State, league sources say. And the Bucks were also quite interested in Dejounte Murray,", "outlet": "marcstein.substack.com", "source_url": "https://open.substack.com/pub/marcstein/p/the-many-many-layers-to-the-nbas", "tags": ["Miami Heat", "Milwaukee Bucks", "New Orleans Pelicans", "Trade", "Andrew Wiggins", "Dejounte Murray"]}, {"date": "", "archive_date": "2025-12-16", "text": "K.C. Johnson:Ayo Dosunmu said he has two sprained thumbs and a bone bruise in right thumb. Has both thumbs taped. Said left thumb is worse than right thumb.Only way to fully let both heal is rest. He has missed two games and is hopeful to play tomorrow.Twitter @KCJHoop", "quote": "Ayo Dosunmu said he has two sprained thumbs and a bone bruise in right thumb. Has both thumbs taped. Said left thumb is worse than right thumb.", "outlet": "Twitter @KCJHoop", "source_url": "https://hoopshype.com/social/", "tags": ["Chicago Bulls", "Injuries", "Ayo Dosunmu"]}, {"date": "", "archive_date": "2025-12-16", "text": "Danny Cunningham: #Cavs head coachKenny Atkinson said that Sam Merrill is progressing through his recovery.He's been doing a lot of shooting but still has not yet gone through contact.Bluesky", "quote": "Kenny Atkinson said that Sam Merrill is progressing through his recovery.", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/dannycunningham.bsky.social/post/3ma4rad6tn22a", "tags": ["Cleveland Cavaliers", "Injuries", "Sam Merrill"]}, {"date": "", "archive_date": "2025-12-16", "text": "Brad Rowland:Trae Young has been assigned to College Park. (Yes, you’re reading that correctly. It’s procedural for practice reasons.)Bluesky", "quote": "Trae Young has been assigned to College Park", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/btrowland.bsky.social/post/3ma4piwhl6c2w", "tags": ["Atlanta Hawks", "G League", "Injuries", "Trae Young"]}, {"date": "", "archive_date": "2025-12-16", "text": "Bobby Marks:A reminder that Tuesday is the last day a player can be traded and have his contract aggregated again by the Feb. 5 deadline.Twitter @BobbyMarks42", "quote": "A reminder that Tuesday is the last day a player can be traded and have his contract aggregated again by the Feb. 5 deadline", "outlet": "Twitter @BobbyMarks42", "source_url": "https://hoopshype.com/social/", "tags": ["Trade"]}, {"date": "", "archive_date": "2025-12-16", "text": "From his spot on the sidelines, Ime Udoka let his displeasure with the officiating be known throughout the Houston Rockets' 128-125 loss to the Denver Nuggets on Monday night.When the game was done, he sat behind a table in a conference room and let it be known in even more certain terms. “I think it was as poorly officiated game as I’ve seen in a long time,” the Rockets coach said.Houston Chronicle", "quote": "When the game was done, he sat behind a table in a conference room and let it be known in even more certain terms. “I think it was as poorly officiated game as I’ve seen in a long time,” the Rockets coach said", "outlet": "Houston Chronicle", "source_url": "https://www.houstonchronicle.com/sports/rockets/article/ime-udoka-refs-officials-nuggets-21245167.php", "tags": ["Houston Rockets", "Coaching", "Ime Udoka", "Referees"]}, {"date": "", "archive_date": "2025-12-16", "text": "Then, he went further, blasting crew chief Zach Zarba and his two officials Natalie Sago and JD Ralls. Zarba hit Udoka with a technical foul in the second quarter shortly after Alperen Şengün also received a technical for complaining about not getting a foul call on Nikola Jokić.“Two have no business being out there and the crew chief is acting starstruck,” Udoka said. “You were seeing all kinds of inconsistent calls, and I’m sure we should have gotten a few more techs.”Houston Chronicle", "quote": "“Two have no business being out there and the crew chief is acting starstruck,” Udoka said. “You were seeing all kinds of inconsistent calls, and I’m sure we should have gotten a few more techs.”", "outlet": "Houston Chronicle", "source_url": "https://www.houstonchronicle.com/sports/rockets/article/ime-udoka-refs-officials-nuggets-21245167.php", "tags": ["Denver Nuggets", "Houston Rockets", "Coaching", "Ime Udoka", "Referees", "Nikola Jokic", "Alperen Sengun"]}, {"date": "", "archive_date": "2025-12-16", "text": "Kevin Durant, who finished with 25 points, said he didn’t get to see the foul on Thompson because he was guarding the inbounder and never got a good look at the replay, but he was more judicious about the officiating than his coach.“It’s unfortunate, you know,” Durant said. “The refs can’t get every play right.”Houston Chronicle", "quote": "“It’s unfortunate, you know,” Durant said. “The refs can’t get every play right.”", "outlet": "Houston Chronicle", "source_url": "https://www.houstonchronicle.com/sports/rockets/article/ime-udoka-refs-officials-nuggets-21245167.php", "tags": ["Houston Rockets", "Kevin Durant", "Referees"]}, {"date": "", "archive_date": "2025-12-16", "text": "Sean Highkin:The Blazers just announced that they're going to honor the 1999-00 Western Conference Finals team at Monday's gamevs. Detroit.Bluesky", "quote": "The Blazers just announced that they're going to honor the 1999-00 Western Conference Finals team at Monday's game", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/highkin.bsky.social/post/3ma4oy6wcls2v", "tags": ["Portland Trail Blazers"]}]