[{"date": "", "archive_date": "2025-12-13", "text": "FullCourtPass: Carmelo Anthony believes LeBron James could lead the NBA in scoring at age 40\"If he really wanted to, he could lead the league in scoring. ... If he really said, 'Yo, this year I'ma go average 30,' he can do it in year 23.\"x.com", "quote": "\"If he really wanted to, he could lead the league in scoring. ... If he really said, 'Yo, this year I'ma go average 30,' he can do it in year 23.\"", "outlet": "x.com", "source_url": "https://x.com/Fullcourtpass/status/1999877144403685876?s=20", "tags": ["Los Angeles Lakers", "LeBron James", "Carmelo Anthony"]}, {"date": "", "archive_date": "2025-12-13", "text": "Michael Scotto:The Xinjiang Flying Tigers and Kevon Harris have agreed to a deal,Senior VP of @CSETalent Darrell Comer told @hoopshype . Harris was on a two-way deal with the Houston Rockets and averaged 19.4 points and 6.1 rebounds in the G League. Last season, he was G League Next Up Game MVPx.com", "quote": "The Xinjiang Flying Tigers and Kevon Harris have agreed to a deal,", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/1999890760100131027", "tags": ["Houston Rockets", "Free Agency", "G League", "Kevon Harris"]}, {"date": "", "archive_date": "2025-12-13", "text": "Pistons PR:The Detroit Pistons have recalled guard Chaz Lanier from the Motor City Cruise,the NBA G League affiliate of the Pistons. In two games with the Cruise, Lanier averaged 33.5 points, 2.5 rebounds and 1.5 assists while shooting 64% from the field and 58% from 3-point range.x.com", "quote": "The Detroit Pistons have recalled guard Chaz Lanier from the Motor City Cruise,", "outlet": "x.com", "source_url": "https://x.com/Pistons_PR/status/1999881756397474200?s=20", "tags": ["Detroit Pistons", "G League", "Chaz Lanier"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mr. BuckBuck: John Hollinger:“One of the things I've been told about the [Derik Queen] trade is that New Orleans didn't even understand what it was trading. And that Atlanta had in its front office, because Atlanta had Bryson Graham in their front office who had just come from New Orleans.”x.com", "quote": "“One of the things I've been told about the [Derik Queen] trade is that New Orleans didn't even understand what it was trading. And that Atlanta had in its front office, because Atlanta had Bryson Graham in their front office who had just come from New Orleans.”", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/1999867594438828359?s=20", "tags": ["Atlanta Hawks", "New Orleans Pelicans", "Bryson Graham", "Derik Queen"]}, {"date": "", "archive_date": "2025-12-13", "text": "KC Johnson: FWIW,sounds like little to no engagement from other teams currently. White is definitely on some teams' radar and, as he noted with his pending UFA status, interest could intensify between now and Feb. trade deadlinex.com", "quote": "sounds like little to no engagement from other teams currently. White is definitely on some teams' radar and, as he noted with his pending UFA status, interest could intensify between now and Feb. trade deadline", "outlet": "x.com", "source_url": "https://x.com/KCJHoop/status/1999628540841721948", "tags": ["Chicago Bulls", "Trade", "Coby White"]}, {"date": "", "archive_date": "2025-12-13", "text": "Pablo Torre: Well, the story was that—it was also like Kevin Durant being recruited to the Knicks. Do you remember anything about the track or about the— Method Man: I don’t remember the track, but I remember we shot a visual for it, and that was a long day in a dirty part of New York. It was just one of them dirty alleyways and [__], and I was like, 'When is this going to be over? Let’s hurry up and get this over with.' We took pictures, all that. It was about a four to five hour process, and then it was over.\"\"Yeah. We really wanted KD to come, and I knew KD wanted to come to New York. He just wasn’t clear on where he wanted to go.\"YouTube", "quote": "\"Yeah. We really wanted KD to come, and I knew KD wanted to come to New York. He just wasn’t clear on where he wanted to go.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=_gu9u2FoYWg", "tags": ["Houston Rockets", "New York Knicks", "Free Agency", "Kevin Durant", "Frivolities"]}, {"date": "", "archive_date": "2025-12-13", "text": "Pablo Torre: \"So, I just got to jump in here to say that about three months ago, we got a tip that kind of reminded me of the tip we got previously about the 2010 New York Knicks recruitment video for LeBron James—which we uncovered here at Pablo Torre Finds Out. You know, the whole Sopranos reunion thing.\" \"But this tip—the new tip—was that the Wu-Tang Clan had, in fact, been paid by the same organization, James Dolan’s Knicks, for the NBA free agency window of 2019. And whatwe were told was that the Knicks paid the Wu-Tang Clan to write, record, and film an original song to woo Kevin Durant. And after asking our sources to comb through their phones and their hard drives—all of us racing to do this ahead of our interview with Method Man, who was involved in this song—we finally found it, a few hours actually after Meth walked out of the studio.YouTube", "quote": "we were told was that the Knicks paid the Wu-Tang Clan to write, record, and film an original song to woo Kevin Durant. And after asking our sources to comb through their phones and their hard drives—all of us racing to do this ahead of our interview with Method Man, who was involved in this song—we finally found it, a few hours actually after Meth walked out of the studio", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=_gu9u2FoYWg", "tags": ["Houston Rockets", "New York Knicks", "Free Agency", "Kevin Durant", "Frivolities"]}, {"date": "", "archive_date": "2025-12-13", "text": "Buta high-ranking Bulls official told the Sun-Times this week that no one from the Pelicans contacted executive vice president of basketball operations Arturas Karnisovas about moving up.The official also said the Bulls were shocked by the move and by Dumars subsequently saying several times since that he had reached out to them. In fact, if the Pelicans had made such an offer, the Bulls would have done it. What they ended up doing instead was drafting project Noa Essengue at No. 12. Essengue’s rookie season officially ended when he had shoulder surgery Wednesday. He had played all of six minutes.Chicago Sun-Times", "quote": "a high-ranking Bulls official told the Sun-Times this week that no one from the Pelicans contacted executive vice president of basketball operations Arturas Karnisovas about moving up.", "outlet": "Chicago Sun-Times", "source_url": "https://chicago.suntimes.com/bulls/2025/12/12/high-ranking-bulls-source-said-new-orleans-never-called", "tags": ["Chicago Bulls", "New Orleans Pelicans", "Draft"]}, {"date": "", "archive_date": "2025-12-13", "text": "Ben Simmons:We got motion in the ocean?Instagram", "quote": "We got motion in the ocean", "outlet": "Instagram", "source_url": "https://www.instagram.com/p/DSLIc1JEtc2/?img_index=2", "tags": ["Frivolities", "Ben Simmons"]}, {"date": "", "archive_date": "2025-12-13", "text": "KC Johnson: Shared what Coby White said about trade rumors on @CHSN__ pregame show:\"I love being here. I love being on this team. But I understand it’s a business and it's different going into (UFA). They have to do what they think is best for the organization. It’s out of my control.\"x.com", "quote": "\"I love being here. I love being on this team. But I understand it’s a business and it's different going into (UFA). They have to do what they think is best for the organization. It’s out of my control.\"", "outlet": "x.com", "source_url": "https://x.com/KCJHoop/status/1999628540841721948?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1999628540841721948%7Ctwgr%5E4709d7be1d547de16339c7fc49ef928449372362%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fd-1426525028151746239.ampproject.net%2F2510081644000%2Fframe.html", "tags": ["Chicago Bulls", "Trade", "Coby White"]}, {"date": "", "archive_date": "2025-12-13", "text": "Jon Krawczynski:I can tell you that there is absolutely nothing cooking there right now.Could that change down the road? Maybe. He's certainly a name to watch. But nothing percolating yet.x.com", "quote": "I can tell you that there is absolutely nothing cooking there right now.", "outlet": "x.com", "source_url": "https://x.com/Timberwolves215/status/1999228607776817305", "tags": ["Chicago Bulls", "Minnesota Timberwolves", "Trade", "Coby White"]}, {"date": "", "archive_date": "2025-12-13", "text": "Amid being the top subject of discussions across the league, the Milwaukee Bucks will only consider moving on from Giannis Antetokounmpo if the Greek star formally asks to be traded. That's what veteran league insider Marc Stein has insisted in his recent appearance on talkSPORT, noting that it will all begin under the final say of Antetokounmpo.“Teams are calling the Bucks, and the Bucks keep telling teams: ‘He’s not available, we’re not trading him.’ The only way there’s gonna be a Giannis sweepstakes — Giannis himself has to go to the Bucks and say ‘I want out.’He has to firmly say it, and that has not happened,\" Stein said.BasketNews", "quote": "“Teams are calling the Bucks, and the Bucks keep telling teams: ‘He’s not available, we’re not trading him.’ The only way there’s gonna be a Giannis sweepstakes — Giannis himself has to go to the Bucks and say ‘I want out.’", "outlet": "BasketNews", "source_url": "https://basketnews.com/news-236742-insider-bucks-to-consider-giannis-trade-but-only-under-one-condition.html", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-13", "text": "MrBuckBuck:Anthony Davis on Kyrie Irving as a teammate: “We’re really close, we actually been trying to become teammates for awhile,that’s another story, we don’t have time for that…Having him as a ‘coach’ now, he constantly texts me about stuff he sees when we on the road...\"x.com", "quote": "Anthony Davis on Kyrie Irving as a teammate: “We’re really close, we actually been trying to become teammates for awhile,", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/1999762578491469846", "tags": ["Dallas Mavericks", "Kyrie Irving", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mat Ishbia: \"Well, those are definitely great thoughts — and it’s important to think about philosophy and how the CBA changes things. But here’s what I’d say about those moves — and look, Kevin and Brad are great guys. Nothing about them specifically. But I’ll say this:We didn’t do — and I didn’t do — a good enough job defining what kind of guys and what kind of team we were going to be.\"\"So therefore, before I go after a big acquisition — a top-10, top-15 player — it better fit our culture and our organization, and how we’re going to do things.\" \"Now I have that DNA. I’ve defined it. We didn’t define it before. Back then, the thinking was: grab a bunch of talented players, throw them together, get a past championship coach, don’t worry about the luxury tax, and just go try to compete. That didn’t work. So it’s been a great learning experience for me.\"YouTube", "quote": "We didn’t do — and I didn’t do — a good enough job defining what kind of guys and what kind of team we were going to be.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=39x8Y19tXaY", "tags": ["Houston Rockets", "Los Angeles Lakers", "Phoenix Suns", "Kevin Durant", "Bradley Beal", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mat Ishbia: \"So what I said was — well, what do we have? We had a pretty good team. We were the nine seed. I know everyone thinks we're still the 2021 NBA Finals team, but that was two years earlier. We were the nine seed when I bought the team. We were just a little over .500.\" \"And I said — and James Jones, who’s a great GM — I said, 'What do we need?' And he’s like, 'We were never allowed to go over the luxury tax.' So I said, 'Go for it. Let’s go over the luxury tax. Let’s go for it. We have a good team. We have Devin Booker. We have Chris Paul. We have Deandre [Ayton], Mikal [Bridges]... What do we have to do to win a championship? I'm all for it.'\" \"Andwe made some decisions. And by the way, don’t get me wrong — I’m not acting like I didn’t know about the decisions. I wasn’t involved, but my DNA is on this team and this organization going forward for the next 50 years. So — get ready.\"YouTube", "quote": "we made some decisions. And by the way, don’t get me wrong — I’m not acting like I didn’t know about the decisions. I wasn’t involved, but my DNA is on this team and this organization going forward for the next 50 years. So — get ready.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=39x8Y19tXaY", "tags": ["Los Angeles Clippers", "Phoenix Suns", "Chris Paul", "James Jones", "Devin Booker", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mat Ishbia: \"AndI told people — if you don’t like it, don’t be a Phoenix Suns fan, because I’m going to be involved with those details. The first part was setting the identity and setting the vision of what Suns basketball is about.And that’s what we made changes on this summer — and what you’re hopefully starting to see now.\"YouTube", "quote": "I told people — if you don’t like it, don’t be a Phoenix Suns fan, because I’m going to be involved with those details. The first part was setting the identity and setting the vision of what Suns basketball is about.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=39x8Y19tXaY", "tags": ["Phoenix Suns", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-13", "text": "Besides the losing streak, Powell has been a standout, being one of the main offensive scorers for Miami, averaging a team-high 24.6 points per game while shooting 50 percent from the field and 43.6 percent from deep. Powell would say this season has been “the most pure basketball” he's played, helped by the team's new fast-paced, free-flowing offense.“I feel good,” Powell said. “Playing, going out there, not thinking, not worried about anything, just playing the game in front of me, trying to be the best version of myself for the team, trying to be a great leader, trying to show through my years of experience and the different roles that I've been in,talking to the guys, with everybody's role changing and things like that.” “I think that's where I found my niche,” Powell continued. “And where I can be the most impactful with my play and then my leadership style coming in here early, with the young guys, seeing me get my work in, talking to them, keeping them motivated.”Clutch Points", "quote": "“I feel good,” Powell said. “Playing, going out there, not thinking, not worried about anything, just playing the game in front of me, trying to be the best version of myself for the team, trying to be a great leader, trying to show through my years of experience and the different roles that I've been in,", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/miami-heat/exclusive-why-heat-tenure-most-pure-basketball-of-norman-powells-career", "tags": ["Miami Heat", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-13", "text": "“So everything we're going through now was great for us to, you know, kind of see it, go through, it, feel what it's like, you know, to go on a four-game losing streak, and for us to mentally be tough, to dig ourselves out of it and start playing our brand of basketball,” Powell continued.“But each day we're moving closer to the playoffs. We want to start getting better and seeing the true identity of Miami Heat basketball going into 2026.”Clutch Points", "quote": "“So everything we're going through now was great for us to, you know, kind of see it, go through, it, feel what it's like, you know, to go on a four-game losing streak, and for us to mentally be tough, to dig ourselves out of it and start playing our brand of basketball,” Powell continued.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/miami-heat/exclusive-why-heat-tenure-most-pure-basketball-of-norman-powells-career", "tags": ["Miami Heat", "Norman Powell"]}, {"date": "", "archive_date": "2025-12-13", "text": "Powell:“you have a feud between me man?” Herro: “what’s feuding? I need a definition\"?reddit", "quote": "“you have a feud between me man?” Herro: “what’s feuding? I need a definition\"", "outlet": "reddit", "source_url": "https://www.reddit.com/r/heat/comments/1pl20re/powell_you_have_a_feud_between_me_man_herro_whats/", "tags": ["Miami Heat", "Frivolities", "Norman Powell", "Tyler Herro"]}, {"date": "", "archive_date": "2025-12-13", "text": "“Danny always plays like he belongs,” coach Jordi Fernández said before. “When he’s had the opportunity, he’s taken advantage of the opportunity. Going back to Macao, he had some guys in front of him.And that was communicated, like to the rest of the guys. It’s my job. Was I right or wrong? I don’t know. But when he had the chance to play, took advantage of his minutes. “When he had the opportunity to play with Long Island, he took advantage of his minutes. And now that he’s in the rotation, he’s taking advantage of his minutes. So I’m very happy with him. He’s a special player because at his size he can do so many different things. And still trying to figure it out because he’s showing me what he’s capable of doing. He’s capable of doing a lot of things — good things.”New York Post", "quote": "“Danny always plays like he belongs,” coach Jordi Fernández said before. “When he’s had the opportunity, he’s taken advantage of the opportunity. Going back to Macao, he had some guys in front of him.", "outlet": "New York Post", "source_url": "https://nypost.com/2025/12/13/sports/danny-wolf-continues-to-impress-nets-in-more-ways-than-one/", "tags": ["Brooklyn Nets", "Jordi Fernandez", "Danny Wolf"]}, {"date": "", "archive_date": "2025-12-13", "text": "Varun Shankar: Asked Brian Keefe after the game if Cam Whitmore's DNP was because he isn't meeting the Wizards standards — the reasoning Keefe gave after the ATL game.“I’m not gonna discuss this any further after this conversation tonight but we have a deep roster. [Cam is] gonna be back in here in the mix at some point, it always works out this way.We’re seeing different guys — Will Riley, Jamir [Watkins] — those guys stepped up and have been playing well. Just looking at those combinations, nothing more than that.”x.com", "quote": "“I’m not gonna discuss this any further after this conversation tonight but we have a deep roster. [Cam is] gonna be back in here in the mix at some point, it always works out this way.", "outlet": "x.com", "source_url": "https://x.com/ByVarunShankar/status/1999695181235519491", "tags": ["Washington Wizards", "Brian Keefe", "Cam Whitmore"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mat Ishbia:“Devin Booker is just an all-around winner across the board. And he cares. He’s a great person for the community. He’s a great person — he’s had my back. I’ll have his back. We talk all the time.We’ve had connect—like this is not like, uh, you know, ‘Oh, he’s just a really good player, go shoot some baskets and try to help us win games.’ Like this guy’s dedicated to the Phoenix Suns and has done great things. And, you know, um, he’s been here his whole career. And so definitely Devin’s a huge, huge part of the community in Phoenix. He’s done an amazing job. And I think he’s one of the best basketball players in the world, you know? And um, I think you—as you point out—he takes some tough shots, and he’s in some tough situations. We ask him to do a lot of things that other star players might not want to do. And he’s willing to do them because he wants the team to win.”YouTube", "quote": "“Devin Booker is just an all-around winner across the board. And he cares. He’s a great person for the community. He’s a great person — he’s had my back. I’ll have his back. We talk all the time.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=39x8Y19tXaY", "tags": ["Phoenix Suns", "Devin Booker", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-13", "text": "Mat Ishbia: I'm putting myself out there. I'm going to stand up for our guys. What we're going to do differently in Phoenix is, I'm going to stand up. You talk bad about Dillon Brooks, or Devin Booker, or Jordan Goodwin — I will stand up for them. I'm the owner. I'm supposed to be... No, no. I'm here. I'm here with it. \"If you say we’re going to have the worst defense in the league, I’ve got to say — everyone can... I feel like the national media sometimes doesn't really know what we’re doing. \"By the way,we deserve to not be looked at highly. We didn’t have a good couple of years — I get it. I’ll take the blame. But you know, Bill (Simmons) made a comment, and I thought it was way out of line. And I have no disrespect — all respect — for Bill. But he was wrong, and I told him that. And I have no problem putting that out in public. \"And guess what? If I’m wrong, I promise — everyone will point it out, as you pointed out. And when we started 1–4, I think people thought it was fun to talk bad about me again. And I... I enjoy it. I relish in it. Because I know we’re doing the right things in Phoenix, and the results will show. It might not happen day one, but it will happen over time. And I’m excited for it.\"YouTube", "quote": "we deserve to not be looked at highly. We didn’t have a good couple of years — I get it. I’ll take the blame. But you know, Bill (Simmons) made a comment, and I thought it was way out of line. And I have no disrespect — all respect — for Bill. But he was wrong, and I told him that. And I have no problem putting that out in public", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=39x8Y19tXaY", "tags": ["Phoenix Suns", "Bill Simmons", "Devin Booker", "Dillon Brooks", "Jordan Goodwin", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-13", "text": "Jon Krawczynski: Rudy Gobert:\"Tonight I felt like I was very proud of the team. We could've lost our mind. We could've got disconnected. We did the opposite. We stayed together.\"x.com", "quote": "\"Tonight I felt like I was very proud of the team. We could've lost our mind. We could've got disconnected. We did the opposite. We stayed together.\"", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999736372153012239", "tags": ["Minnesota Timberwolves", "Rudy Gobert"]}, {"date": "", "archive_date": "2025-12-13", "text": "Jon Krawczynski:Donte DiVincenzo: \"Tonight we just settled down with the lights on. we made big plays.When we stay together, we stay composed, it doesn't matter who we have on the floor. When we're a unit and we're together, we're really damn good.\"x.com", "quote": "Donte DiVincenzo: \"Tonight we just settled down with the lights on. we made big plays.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999736848625860629", "tags": ["Minnesota Timberwolves", "Donte DiVincenzo"]}, {"date": "", "archive_date": "2025-12-13", "text": "Steph, what does a night where you take 28 field goal attempts feel like on your body—especially as you're coming back from injury? Stephen Curry: The attempts aren’t really the thing that wears you out. It’s more about if you’re on-ball a lot in pick-and-roll, or how much you’re running off-ball as well. That middle of the game—when you’re doing rehab, it’s usually a sustained kind of session. But in a game, you’ve got long timeouts, halftime, all that.So your rest periods come during the game. I was just trying to get back to the rhythm of that. So the shots themselves aren’t necessarily what create fatigue—it’s more the style of play.YouTube", "quote": "So your rest periods come during the game. I was just trying to get back to the rhythm of that. So the shots themselves aren’t necessarily what create fatigue—it’s more the style of play", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=z35Hbbg43uc", "tags": ["Golden State Warriors", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-13", "text": "Not relevant to the game—but what about your pregame shot that you hit before you ran in? Stephen Curry:That’s the second one I’ve made. I thought it was going to be a better night—creating some good mojo off of that. But yeah, I don’t know what else to say.YouTube", "quote": "That’s the second one I’ve made. I thought it was going to be a better night—creating some good mojo off of that. But yeah, I don’t know what else to say", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=z35Hbbg43uc", "tags": ["Golden State Warriors", "Stephen Curry", "Frivolities"]}, {"date": "", "archive_date": "2025-12-13", "text": "Derek Bodner: Embiid: \"I want to play more as a team, making sure everybody is involved. If somebody has to sacrifice, I will.\"But in some occasions, when I got it going or nights like tonight, it's gonna happen. I don't expect having to do this when everybody's healthy, but I will if I have to.\"Bluesky", "quote": "\"But in some occasions, when I got it going or nights like tonight, it's gonna happen. I don't expect having to do this when everybody's healthy, but I will if I have to.\"", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/derekbodner.bsky.social/post/3m7ts66aqfs2h", "tags": ["Philadelphia 76ers", "Joel Embiid"]}, {"date": "", "archive_date": "2025-12-13", "text": "Derek Bodner:\"Something hasn't felt right with my hand lately. I had a couple days to recover, put some work in,\" Embiid said in the clip, noting that the hand feels better now.Bluesky", "quote": "\"Something hasn't felt right with my hand lately. I had a couple days to recover, put some work in,\" Embiid said in the clip, noting that the hand feels better now", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/derekbodner.bsky.social/post/3m7trvq7snc2h", "tags": ["Philadelphia 76ers", "Joel Embiid"]}, {"date": "", "archive_date": "2025-12-13", "text": "Who is the best player in the NBA right now?Victor Wembanyama: I think Jokic is the best offensive player. I don’t think he’s the best player—it’s hard to say. I think it’s between Giannis and Shai. When I come back on the court—I think it’ll be me.YouTube", "quote": "Victor Wembanyama: I think Jokic is the best offensive player. I don’t think he’s the best player—it’s hard to say. I think it’s between Giannis and Shai. When I come back on the court—I think it’ll be me", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=Qyff7Hrt_Bw", "tags": ["Denver Nuggets", "Oklahoma City Thunder", "San Antonio Spurs", "Nikola Jokic", "Shai Gilgeous-Alexander", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-13", "text": "You’ve had a heck of a summer the last 9 to 10 months. You’ve been playing absolutely incredible basketball—and then all of a sudden, you're diagnosed with a blood clot. What was that moment like for you? Victor Wembanyama: I remember clearly. I mean, it’s going to be one year soon since I learned.So it was five minutes of total breakdown, probably. You know—obviously crying, and sadness, and feeling the fragility of life and health.YouTube", "quote": "So it was five minutes of total breakdown, probably. You know—obviously crying, and sadness, and feeling the fragility of life and health", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=Qyff7Hrt_Bw", "tags": ["San Antonio Spurs", "Injuries", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-13", "text": "Victor Wembanyama: I was thinking about this, like—as you said—I wasn’t thinking about basketball.Basketball wasn’t my priority all of a sudden. And at a time like this, where you have to take measures quickly, you unfortunately have to make choices.There’s this worry of maybe not doing the right thing, you know.YouTube", "quote": "Basketball wasn’t my priority all of a sudden. And at a time like this, where you have to take measures quickly, you unfortunately have to make choices.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=Qyff7Hrt_Bw", "tags": ["San Antonio Spurs", "Injuries", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-13", "text": "Seven months have passed since Tatum ruptured his Achilles tendon during the conference semifinal series against the Knicks, and within the organization he continues to indicate that he would like to return this season. It probably falls somewhere between possible and likely, but a league source stressed thatthe team remains several steps away from even considering the decision.Tatum must still reach several mile markers in his recovery before discussions about a return can be considered.Boston Globe", "quote": "the team remains several steps away from even considering the decision.", "outlet": "Boston Globe", "source_url": "https://www.bostonglobe.com/2025/12/12/sports/celtics-jayson-tatum-jordan-walsh/", "tags": ["Boston Celtics", "Injuries", "Jayson Tatum"]}, {"date": "", "archive_date": "2025-12-13", "text": "Two-way contract centerAmari Williams was a surprise addition to the injury report this week with a hairline fracture in his right hand. A league source said Williams suffered the injury when he hit the hand during Maine’s win over the College Park Skyhawks on Monday,but that he is unlikely to be sidelined for an extended period. The rookie big man registered 10 points, 13 rebounds, and 11 assists in the game.Boston Globe", "quote": "Amari Williams was a surprise addition to the injury report this week with a hairline fracture in his right hand. A league source said Williams suffered the injury when he hit the hand during Maine’s win over the College Park Skyhawks on Monday,", "outlet": "Boston Globe", "source_url": "https://www.bostonglobe.com/2025/12/12/sports/celtics-jayson-tatum-jordan-walsh/", "tags": ["Boston Celtics", "Injuries", "Amari Williams"]}, {"date": "", "archive_date": "2025-12-13", "text": "Olgun Uluc:Representatives from 5 NBA teams are in Traralgon, Victoria for tonight’s SEM Phoenix vs NZ Breakers game, sources told ESPN. Portland, Golden State, Washington, Chicago, and Charlotte are in the building, I’m told. Projected lottery pick Karim Lopez is in action for NZ.x.com", "quote": "Representatives from 5 NBA teams are in Traralgon, Victoria for tonight’s SEM Phoenix vs NZ Breakers game, sources told ESPN. Portland, Golden State, Washington, Chicago, and Charlotte are in the building, I’m told. Projected lottery pick Karim Lopez is in action for NZ", "outlet": "x.com", "source_url": "https://x.com/OlgunUluc/status/1999775468053225828", "tags": ["Charlotte Hornets", "Chicago Bulls", "Golden State Warriors", "Phoenix Suns", "Portland Trail Blazers", "Washington Wizards", "Draft", "Karim Lopez"]}, {"date": "", "archive_date": "2025-12-13", "text": "\"Okay, so you said that your fingerprints are on it more now than before — on decision-making?\" Mat Ishbia: \"100%. I’m involved with every detail. And that was the change. I told myself this summer: I did a bad job. I didn’t define the identity of the Phoenix Suns. I just kind of came in and said, ‘Let’s go over the luxury tax. Let’s make a trade.’ There were certain players I didn’t like — and now, I’m involved with those details, to the fullest extent. For better or for worse. ButI’ve got a great GM — obviously — and a great coach and a great front office. But I’m involved. I’m not just writing a check anymore.\"YouTube", "quote": "I’ve got a great GM — obviously — and a great coach and a great front office. But I’m involved. I’m not just writing a check anymore.\"", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=39x8Y19tXaY", "tags": ["Phoenix Suns", "Mat Ishbia"]}, {"date": "", "archive_date": "2025-12-13", "text": "Memphis MayorPaul Young optimistic about reaching lease agreement with GrizzliesBusiness News", "quote": "Paul Young optimistic about reaching lease agreement with Grizzlies", "outlet": "Business News", "source_url": "https://www.bizjournals.com/memphis/news/2025/12/11/paul-young-memphis-grizzlies-fedexforum-lease.html", "tags": ["Memphis Grizzlies", "Business"]}, {"date": "", "archive_date": "2025-12-13", "text": "On “The Program with Woj,” hostAdrian Wojnarowski interviewed Somalia Men’s National Basketball Team coach Dalmar Ali to learn more about his experience as the new leader of the Somalian National Team. Ali credited former Raptors exec Masai Ujiri for inspiring him to use a career in basketball for the greater good. “Ujiri is the reason why I really found that this orange ball that we hold every day can really change someone’s life,” Ali said.“... I look at him as one of us because not only as a Torontonian, but he’s from the continent of Africa. ... To see him be passionate about this thing and try to show that people that no matter where you’re from in the world, you can be successful ... I said, ‘You know what? I’m going to use this orange ball and I’m going to change people’s lives with it.’”Sports Business Journal", "quote": "Adrian Wojnarowski interviewed Somalia Men’s National Basketball Team coach Dalmar Ali to learn more about his experience as the new leader of the Somalian National Team. Ali credited former Raptors exec Masai Ujiri for inspiring him to use a career in basketball for the greater good. “Ujiri is the reason why I really found that this orange ball that we hold every day can really change someone’s life,” Ali said.", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/11/podcast-picks-too-close-to-the-sun/", "tags": ["Masai Ujiri"]}, {"date": "", "archive_date": "2025-12-13", "text": "[Highlight] Victor Wembanyama on whether prize money is a motivating factor in the NBA Cup:“Poor Vic needs more money, right? … Just stacking money hasn’t really been a goal of mine.”reddit", "quote": "“Poor Vic needs more money, right? … Just stacking money hasn’t really been a goal of mine.”", "outlet": "reddit", "source_url": "https://www.reddit.com/r/nba/comments/1plavw7/highlight_victor_wembanyama_on_whether_prize/", "tags": ["San Antonio Spurs", "Frivolities", "Victor Wembanyama", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-13", "text": "Emirates NBA Cup Group Play viewership up 90% year-over-yearNBA.com", "quote": "Emirates NBA Cup Group Play viewership up 90% year-over-year", "outlet": "NBA.com", "source_url": "https://www.nba.com/news/nba-cup-group-play-2025-viewership-up-90-percent", "tags": ["TV Ratings", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-13", "text": "Gatorade, the NBA’s most-tenured sponsor (since 1984), was the most likely to be identified as such by NBA fans in a recent CivicScience/SBJ Sports Consumer Insights survey. Additionally, this is the 10th season for New Era, who joins a dozen other sponsors who have been with the league for at least a decade. The league’s overall sponsorship business has seen record revenue for the past five consecutive years, according to a source familiar with the data.Sports Business Journal", "quote": "Gatorade, the NBA’s most-tenured sponsor (since 1984), was the most likely to be identified as such by NBA fans in a recent CivicScience/SBJ Sports Consumer Insights survey", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/11/nba-heads-into-final-emirates-cup-weekend-with-49-full-season-sponsors/", "tags": ["Media"]}, {"date": "", "archive_date": "2025-12-13", "text": "Former Cleveland Cavaliers starDaniel 'Booby' Gibson was detained in Ohio this week after police discovered a warrant for his arrest. Gibson, 39, was initially pulled over in the Cleveland suburb of Beachwood as part of a routine traffic stop after police noticed the taillights on his truck were turned off at around 10:30pm local time on Monday. However, after running his California driving license during the stop, officers discovered that the former NBA player was wanted for failing to appear in court over a speeding ticket.Daily Mail", "quote": "Daniel 'Booby' Gibson was detained in Ohio this week after police discovered a warrant for his arrest", "outlet": "Daily Mail", "source_url": "https://www.dailymail.co.uk/sport/nba/article-15376879/daniel-gibson-arrest-cleveland-cavaliers-ohio.html", "tags": ["Law", "Daniel Gibson"]}, {"date": "", "archive_date": "2025-12-13", "text": "The officer told him that there was nothing he could do, leading to the ex-Cleveland star demanding his name and badge number.'Every time I've ever been arrested out here, or pulled over, every officer has allowed me to go home and handle the stuff from home,' Gibson said - before name-dropping the mayor.Daily Mail", "quote": "'Every time I've ever been arrested out here, or pulled over, every officer has allowed me to go home and handle the stuff from home,' Gibson said - before name-dropping the mayor", "outlet": "Daily Mail", "source_url": "https://www.dailymail.co.uk/sport/nba/article-15376879/daniel-gibson-arrest-cleveland-cavaliers-ohio.html", "tags": ["Law", "Daniel Gibson"]}, {"date": "", "archive_date": "2025-12-12", "text": "Damichael Cole: The Grizzlies couldn’t get the needed stops late in this one.Final: Utah 130, Memphis 126Every other Grizzlies loss this season is against a team currently above .500. Keyonte George was a problem. 39 points. Grizz-Clippers on Mondayx.com", "quote": "Final: Utah 130, Memphis 126", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1999684919174607339", "tags": ["Los Angeles Clippers", "Memphis Grizzlies", "Utah Jazz", "Keyonte George"]}, {"date": "", "archive_date": "2025-12-12", "text": "Damichael Cole: The impact of losing Zach Edey..Memphis was outscored 24-14 in second chance points against Utah.Lost the rebounding battle for the first time since Nov. 24th against Denver. Edey left that game early in the first quarter.x.com", "quote": "Memphis was outscored 24-14 in second chance points against Utah.", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1999686366649811194", "tags": ["Denver Nuggets", "Memphis Grizzlies", "Utah Jazz", "Zach Edey"]}, {"date": "", "archive_date": "2025-12-12", "text": "Omari Sankofa II: Duren on the 20-5 start:“It shows the world that we’re serious about winning, that we are serious about contending for a championship.Because that’s what we’ve do it for … I think we’re the best team in the league and we’re going to continue to show it.”x.com", "quote": "“It shows the world that we’re serious about winning, that we are serious about contending for a championship.", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/1999684768137642480", "tags": ["Detroit Pistons", "Jalen Duren"]}, {"date": "", "archive_date": "2025-12-12", "text": "Mike Curtis:Final: Mavs 119, Nets 111. Dallas improves to 10-16 and wins its fifth game in the last six. Anthony Davis led with a double-double of 24 points and 14 rebounds. Cooper Flagg had 22 points, 5 rebounds and 8 assists. Brandon Williams made clutch plays down the stretch.x.com", "quote": "Final: Mavs 119, Nets 111", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/1999689480438186365", "tags": ["Dallas Mavericks", "Brooklyn Nets", "Anthony Davis", "Brandon Williams", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-12", "text": "Gilgeous-Alexander has been clear that championships will always be his priority over chasing records. Several members of the Thunder, including Gilgeous-Alexander, have emphasized the importance of blocking out potential distractions such as focusing too much on future possibilities.\"We are trying to be a better version of ourselves every night we go out there, and we like to hunt in that form,\" Gilgeous-Alexander.\"If we didn't get better tonight, then we wasted an opportunity. That's kind of how we see it.\"ESPN", "quote": "\"We are trying to be a better version of ourselves every night we go out there, and we like to hunt in that form,\" Gilgeous-Alexander.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47289603/shai-gilgeous-alexander-says-thunder-want-nba-wins-mark", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-12", "text": "Caitlin Clark:this has to be AIx.com", "quote": "this has to be AI", "outlet": "x.com", "source_url": "https://x.com/CaitlinClark22/status/1999675930806222998", "tags": ["Golden State Warriors", "Stephen Curry", "Caitlin Clark"]}, {"date": "", "archive_date": "2025-12-12", "text": "Jon Krawczynski:Bones is questionable with a bruised kneex.com", "quote": "Bones is questionable with a bruised knee", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999687373085675724", "tags": ["Minnesota Timberwolves", "Injuries", "Bones Hyland"]}, {"date": "", "archive_date": "2025-12-12", "text": "Austin Krell:39 and 9 for Embiid tonight.A reminder that he still has it in there, just a matter of staying on the court and finding consistency. Sixers win.x.com", "quote": "39 and 9 for Embiid tonight.", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/1999668473715114106", "tags": ["Indiana Pacers", "Philadelphia 76ers", "Joel Embiid"]}, {"date": "", "archive_date": "2025-12-12", "text": "Danny Cunningham:#Cavs beat the Wizards 130-126 thanks to 48 points from Donovan Mitchell and a much higher level of intensity in the fourth quarter as a team.I don't think this is so much a step in the right direction as it is a crisis averted.x.com", "quote": "#Cavs beat the Wizards 130-126 thanks to 48 points from Donovan Mitchell and a much higher level of intensity in the fourth quarter as a team.", "outlet": "x.com", "source_url": "https://x.com/RealDCunningham/status/1999670203693891823", "tags": ["Cleveland Cavaliers", "Washington Wizards", "Donovan Mitchell"]}, {"date": "", "archive_date": "2025-12-12", "text": "Joel Lorenzi:Bulls end their skid with a 129-126 win in Charlotte, their first since Nov. 21.Massive overturned call there to decide the game. Okoro with 15 in his return, Collins with 16 & 8 as he comes close to returning to form.x.com", "quote": "Bulls end their skid with a 129-126 win in Charlotte, their first since Nov. 21.", "outlet": "x.com", "source_url": "https://x.com/JoelXLorenzi/status/1999669066265690215", "tags": ["Charlotte Hornets", "Chicago Bulls", "Zach Collins", "Isaac Okoro"]}, {"date": "", "archive_date": "2025-12-12", "text": "Omari Sankofa II:FINAL: Pistons 142, Hawks 115.Season-highs in points scored and win margin, dominated both ends. They improve to 20-5 overall. Eight players reached double figures, led by 17 points, five assists and five rebounds for Isaiah Stewart. Cade Cunningham and Jalen Duren each had 15x.com", "quote": "FINAL: Pistons 142, Hawks 115.", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/1999668111889641845", "tags": ["Atlanta Hawks", "Detroit Pistons", "Isaiah Stewart", "Cade Cunningham", "Jalen Duren"]}, {"date": "", "archive_date": "2025-12-12", "text": "Omari Sankofa II: JB on Holland's impact:\"It’s unique for a guy his age. A lot of guys his age come into the league searching how they can fit in and be part ofit … Ron does all the small things to help you win.\"x.com", "quote": "\"It’s unique for a guy his age. A lot of guys his age come into the league searching how they can fit in and be part of", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/1999670387261735141", "tags": ["Detroit Pistons", "JB Bickerstaff", "Ron Holland"]}, {"date": "", "archive_date": "2025-12-12", "text": "Farbod Esnaashari: Blake Griffin says he considers the Clippers home and would want to get his jersey retired if they called.\"That is what I consider home, and that's part of the reason why it sucks to see what's happened. But yeah, that's not something I would ever turn down.\"x.com", "quote": "\"That is what I consider home, and that's part of the reason why it sucks to see what's happened. But yeah, that's not something I would ever turn down.\"", "outlet": "x.com", "source_url": "https://x.com/Farbod_E/status/1999672272391667839", "tags": ["Los Angeles Clippers", "Blake Griffin"]}, {"date": "", "archive_date": "2025-12-12", "text": "Nick DePaula:Stephen Curry warms up in the Adidas x CLOT AE 1 Lowsx.com", "quote": "Stephen Curry warms up in the Adidas x CLOT AE 1 Lows", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/1999672022847357161", "tags": ["Golden State Warriors", "Sneakers", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-12", "text": "Nick DePaula:Stephen Curry arrives in the Nike Garnett 3s against Minnesota@KevinGarnett5KGx.com", "quote": "Stephen Curry arrives in the Nike Garnett 3s against Minnesota", "outlet": "x.com", "source_url": "https://x.com/NickDePaula/status/1999666767124398536", "tags": ["Golden State Warriors", "Sneakers", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-12", "text": "Matt Guzman: Speaking with ESPN, Victor Wembanyama was asked who the NBA’s best player is:“Jokić is the best offensive player … I don’t think he’s the best player. (It’s) between Giannis (Antetokounmpo) and Shai (Gilgeous-Alexander). “When I come back to the court, it will be me.” #PorVidax.com", "quote": "“Jokić is the best offensive player … I don’t think he’s the best player. (It’s) between Giannis (Antetokounmpo) and Shai (Gilgeous-Alexander)", "outlet": "x.com", "source_url": "https://x.com/mattgzman/status/1999635597913391687", "tags": ["Denver Nuggets", "Milwaukee Bucks", "Oklahoma City Thunder", "San Antonio Spurs", "Giannis Antetokounmpo", "Nikola Jokic", "Shai Gilgeous-Alexander", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-12", "text": "Matt Guzman: #Spurs star Victor Wembanyama on his lengthy recovery process: \"There was no reason to take inconsiderate risk ... I (had) to trust the process a lot.Because it wasn't always painful. It was almost never painful or even uncomfortable.\"#PorVidax.com", "quote": "Because it wasn't always painful. It was almost never painful or even uncomfortable.\"", "outlet": "x.com", "source_url": "https://x.com/mattgzman/status/1999642800401363227", "tags": ["San Antonio Spurs", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-12", "text": "MrBuckBuck: ShaiGilgeous-Alexander on if breaking the 73-win record would mean anything to him: \"Absolutely. Winning matters.\"Via: https://reddit.com/r/nba/comments/1pl8egh/sga_on_if_breaking_the_73win_record_would_mean/…x.com", "quote": "Gilgeous-Alexander on if breaking the 73-win record would mean anything to him: \"Absolutely. Winning matters.\"", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/1999646882373804539", "tags": ["Oklahoma City Thunder", "Shai Gilgeous-Alexander"]}, {"date": "", "archive_date": "2025-12-12", "text": "What is Ryan Nembhard's situation with going from a two-way to a standard deal with Dallas? Grant Afseth: My understanding is correct. I don't think they can do it until either. I don't remember the exact date. It might be January 6th. I know some people have that as a date.Some people believe it's January 4th, but basically early January is when that salary cap logistics would allow them to convert Ryan Nembhard's contract to a standard deal from a two-way.Youtube", "quote": "Some people believe it's January 4th, but basically early January is when that salary cap logistics would allow them to convert Ryan Nembhard's contract to a standard deal from a two-way", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4", "tags": ["Dallas Mavericks", "Salary Cap", "Ryan Nembhard"]}, {"date": "", "archive_date": "2025-12-12", "text": "Jon Krawczynski:Chris Finch said he didn’t see Edwards’ injury as anything to be concerned about for the long term.I asked him who would start and he declined to say. He did make a nice offer though: “Would you like me to tell you my social security number too, Jon?” As a matter of fact …x.com", "quote": "Chris Finch said he didn’t see Edwards’ injury as anything to be concerned about for the long term.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999655083609370725", "tags": ["Minnesota Timberwolves", "Injuries", "Chris Finch", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-12", "text": "Anthony Slater:Draymond Green will be in Portland on Sunday, per Kerr, back from personal absence.He said foot issue won’t keep him out, but it’ll be up to Rick Celebrini whether to activate Green after 10-day absence or hold him for another game.x.com", "quote": "Draymond Green will be in Portland on Sunday, per Kerr, back from personal absence.", "outlet": "x.com", "source_url": "https://x.com/anthonyVslater/status/1999650615144882179", "tags": ["Golden State Warriors", "Portland Trail Blazers", "Injuries", "Draymond Green", "Rick Celebrini"]}, {"date": "", "archive_date": "2025-12-12", "text": "From your perspective, when you look at Riccardi, Finley, Kidd, is there a preference there with how Dumont would value their opinions? Grant Afseth: I don't know if Jason Kidd's opinions value like clear cut more than everybody else. But I do know from a basketball standpoint, his opinions are valued quite a bit by the ownership group. And I know, Mark Cuban is providing input as well. I don't want to make that sound like Mark Cuban's the GM by any means, or Jason Kidd the GM or whatever. But I just know that while they're getting through this, it's really, really important that the head coach has alignment on what they're doing on the basketball court. So by default, you're going to have to rely on like not only is he respected, but you are by necessity going to have to get through, the season with his input value very heavily.So I think that's, probably, like, I don't want to say like he's clear cut, like more important voice wise than the interim GM, but his basketball input is very heavily valued.Youtube", "quote": "So I think that's, probably, like, I don't want to say like he's clear cut, like more important voice wise than the interim GM, but his basketball input is very heavily valued", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4", "tags": ["Dallas Mavericks", "Jason Kidd", "Mark Cuban", "Michael Finley", "Matt Riccardi"]}, {"date": "", "archive_date": "2025-12-12", "text": "I know you mentioned Patrick Dumont has final say, but is there a clear hierarchy of who runs the team right now? Grant Afseth:But from my understanding I think there's kind of a collection of voices, right now, I think Jason Kidd is somebody that I would definitely look at as someone who has influence on these decisions.Like Patrick Dumont leans on him, like, I think there's, like, almost like, I guess you could say I don't this is a great comparison, but it's almost like a basketball cabinet, if you will, or Council of Multiple Voices.Youtube", "quote": "But from my understanding I think there's kind of a collection of voices, right now, I think Jason Kidd is somebody that I would definitely look at as someone who has influence on these decisions.", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4", "tags": ["Dallas Mavericks", "Jason Kidd", "Mark Cuban", "Matt Riccardi", "Patrick Dumont"]}, {"date": "", "archive_date": "2025-12-12", "text": "The Mavericks’ potential trade candidates have remained consistent — including a willingness to entertain offers for Anthony Davis, Klay Thompson, Daniel Gafford, and D’Angelo Russell — but the team is not aggressively shopping those players, sources told DallasHoopsJournal.com.The internal view is that any deal must clearly improve Dallas’ long-term outlook, whether through added flexibility, future assets, or a cleaner roster fit.Dallas Hoops Journal", "quote": "The internal view is that any deal must clearly improve Dallas’ long-term outlook, whether through added flexibility, future assets, or a cleaner roster fit", "outlet": "Dallas Hoops Journal", "source_url": "https://dallashoopsjournal.com/p/nba-rumors-notebook-early-developments-to-monitor-about-the-dallas-mavericks-and-across-the-league/", "tags": ["Dallas Mavericks", "Trade", "Klay Thompson", "Anthony Davis", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-12", "text": "In contract discussions with the Jazz, Kessler sought upwards of $120 million in total compensation for a long-term contract extension,sources told DallasHoopsJournal.com, but Utah was unwilling to commit to that price range. “There was a clear gap in talks between Kessler and Utah,” one source said.Dallas Hoops Journal", "quote": "In contract discussions with the Jazz, Kessler sought upwards of $120 million in total compensation for a long-term contract extension,", "outlet": "Dallas Hoops Journal", "source_url": "https://dallashoopsjournal.com/p/nba-rumors-notebook-early-developments-to-monitor-about-the-dallas-mavericks-and-across-the-league/", "tags": ["Utah Jazz", "Extensions", "Walker Kessler"]}, {"date": "", "archive_date": "2025-12-12", "text": "Mike Curtis:Jason Kidd began his pregame press conference with a statement on his former teammate Jason Collins, who is battling Stage 4 brain cancer:\"Just want to give a shoutout to Jason Collins. A teammate of mine. A friend of mine. I actually coached him in Brooklyn. Our prayers go out to him & his family. He's going to fight & beat this, just knowing the person he is. Our prayers go out to Big J.\"x.com", "quote": "Jason Kidd began his pregame press conference with a statement on his former teammate Jason Collins, who is battling Stage 4 brain cancer:", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/1999634699241590886", "tags": ["Dallas Mavericks", "Jason Kidd", "Jason Collins"]}, {"date": "", "archive_date": "2025-12-12", "text": "Dan Woike:Lakers say guard Austin Reaves has been diagnosed with a mild left calf strain. Reaveswill be re-evaluated in approximately one week.x.com", "quote": "Lakers say guard Austin Reaves has been diagnosed with a mild left calf strain. Reaves", "outlet": "x.com", "source_url": "https://x.com/DanWoikeSports/status/1999629204921680293", "tags": ["Los Angeles Lakers", "Injuries", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grant Afseth: TheDallas Mavericks have downgraded D’Angelo Russell and Daniel Gafford to out against the Brooklyn Nets.x.com", "quote": "Dallas Mavericks have downgraded D’Angelo Russell and Daniel Gafford to out against the Brooklyn Nets", "outlet": "x.com", "source_url": "https://x.com/GrantAfseth/status/1999627214527300086", "tags": ["Dallas Mavericks", "Brooklyn Nets", "Injuries", "D'Angelo Russell", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grizzlies PR: Status Update:Ja Morant is available tonight against the Utah Jazz.x.com", "quote": "Ja Morant is available tonight against the Utah Jazz", "outlet": "x.com", "source_url": "https://x.com/GrizzliesPR/status/1999624435632873667", "tags": ["Memphis Grizzlies", "Utah Jazz", "Injuries", "Ja Morant"]}, {"date": "", "archive_date": "2025-12-12", "text": "What is your understanding of Kyrie Irving coming back this season? Grant Afseth: Yeah, I think he's been working very hard to have a comeback this season. I think he very much wants to. Obviously the way the team has played out has kind of created uncertainty for what people think could happen. But I do know he's been someone that's worked very hard to make that comeback. He takes a lot of pride in being able to show I'm an elite player coming off this injury. Even like being able to attack it, to come back sooner than someone might think, like, kind of defy the odds, if you will. But it's a complicated general situation because, from that standpoint, because he doesn't want a timeline out there where if it's not met, then you're talking about a setback and then that, like add some distraction area elements to it. I think it's more of like a he's going to attack it, try to come back as soon as possible. But not have that external pressure to where, you know, we're, we're discussing timetables, things of that nature.I've personally like, from my understanding of the situation, have long held like the, the thought that there's optimism of a pre All-Star break return.But that's not ever been like super like that's happening, there's a set guarantee like anything of that nature.Youtube", "quote": "I've personally like, from my understanding of the situation, have long held like the, the thought that there's optimism of a pre All-Star break return.", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Dallas Mavericks", "Kyrie Irving"]}, {"date": "", "archive_date": "2025-12-12", "text": "Does Kyrie Irving have input on the moves they will make? Like did he know of the Luka trade? Grant Afseth: I'm not fully sure on. I don't think he's been included on every move they made by any means. I think when they're like going into offseasons, like some players like, hey, you know, what are some players that you think could help this team like that type of feedback? Not necessarily like a, Hey, we're about to make this move. Do you like it? Or should we call it like that type of thing or.I think it's more like just the general idea of who are some guys that you think could help us. Let's talk about it. And, we can see how that shakes out and help us mold our offseason plan, if you will.Youtube", "quote": "I think it's more like just the general idea of who are some guys that you think could help us. Let's talk about it. And, we can see how that shakes out and help us mold our offseason plan, if you will", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Dallas Mavericks", "Trade", "Kyrie Irving"]}, {"date": "", "archive_date": "2025-12-12", "text": "But obviously with all the noise we know about A.D, do you think a divorce or you know, obviously a trade is inevitable or is that something that could be avoided? Grant Afseth: I think honestly it's fluid depending on what offers come in.My understanding of the sentiment right now, I don't think it's like a we absolutely have to get rid of Anthony Davis, by any means necessary before the deadline hits. I think it's definitely going to be a matter of. Is there a trade offer that comes through that we deem acceptable?And if that is a good trade for us to make to build around Cooper Flagg, then, you know, perhaps pull the trigger, but I think, that's going to be a matter of external factors.Youtube", "quote": "My understanding of the sentiment right now, I don't think it's like a we absolutely have to get rid of Anthony Davis, by any means necessary before the deadline hits. I think it's definitely going to be a matter of. Is there a trade offer that comes through that we deem acceptable?", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Dallas Mavericks", "Trade", "Anthony Davis", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grant Afseth: Shams Charania from ESPN reported a couple of potential Eastern Conference suitors like the Atlanta Hawks, Detroit Pistons, Toronto Raptors. But those teams so far, doesn't seem like there's meaningful traction by any means of a great offer that the Dallas Mavericks cannot refuse.I've been asking around, and there's more skepticism than optimism about Detroit and Atlanta as viable trade destinations. Because of various reasons, like Detroit has it rolling right now. Like, there's, probably a reluctance to break that team up and complicate things chemistry wise with how the season has gone for them. And then Atlanta, they also have to solve Trae Young's future, with their team long-term. So do you go into the offseason where you have to give contract clarity to Trae Young and Anthony Davis? That's where it gets complicated. And they could get a potential top three, even number one overall pick this year where you're adding that next to Jalen Johnson.Youtube", "quote": "I've been asking around, and there's more skepticism than optimism about Detroit and Atlanta as viable trade destinations. Because of various reasons, like Detroit has it rolling right now. Like, there's, probably a reluctance to break that team up and complicate things chemistry wise with how the season has gone for them", "outlet": "Youtube", "source_url": "https://youtu.be/sEPja1PuIH4?si=G9cM2JWLbG1pVvS2", "tags": ["Atlanta Hawks", "Dallas Mavericks", "Detroit Pistons", "Toronto Raptors", "Trade", "Anthony Davis", "Trae Young", "Jalen Johnson"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grant Afseth: TheDallas Mavericks announced that Danté Exum underwent successful right knee surgery.x.com", "quote": "Dallas Mavericks announced that Danté Exum underwent successful right knee surgery", "outlet": "x.com", "source_url": "https://x.com/GrantAfseth/status/1999619243311267889", "tags": ["Dallas Mavericks", "Injuries", "Dante Exum"]}, {"date": "", "archive_date": "2025-12-12", "text": "New York Basketball:\"I thought it was a good play…I threw it too hard…chasing down ball, throw it off him…Myhomeboy said the Reds gonna be giving me a call––if y'all watching, invite me to spring training––yeah but it was no foul play intended\" –– Desmond Bane on throwing ball at OG Anunobyx.com", "quote": "\"I thought it was a good play…I threw it too hard…chasing down ball, throw it off him…My", "outlet": "x.com", "source_url": "https://x.com/NBA_NewYork/status/1999603488662102163", "tags": ["New York Knicks", "Orlando Magic", "OG Anunoby", "Desmond Bane"]}, {"date": "", "archive_date": "2025-12-12", "text": "Wizards PR: TheWashington Wizards have recalled G AJ Johnson from the@CapitalCityGoGo .x.com", "quote": "Washington Wizards have recalled G AJ Johnson from the", "outlet": "x.com", "source_url": "https://x.com/WizPRStats/status/1999584243089920148", "tags": ["Washington Wizards", "G League", "AJ Johnson"]}, {"date": "", "archive_date": "2025-12-12", "text": "Omari Sankofa II: JB on finally having a healthy roster:“It’s great for us and that’s what we’ve been working toward, being able to have everyone available and then being able to make decisions … lineups, rotations … that you couldn’t make before.”x.com", "quote": "“It’s great for us and that’s what we’ve been working toward, being able to have everyone available and then being able to make decisions … lineups, rotations … that you couldn’t make before.”", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/1999604765408268704", "tags": ["Detroit Pistons", "JB Bickerstaff"]}, {"date": "", "archive_date": "2025-12-12", "text": "“It would mean a lot for him to be back,” Castle said.“We haven’t played a game yet with our full team healthy. So, just getting the first look at that on the biggest stage, it would be the perfect time for his return.”Andscape", "quote": "“We haven’t played a game yet with our full team healthy. So, just getting the first look at that on the biggest stage, it would be the perfect time for his return.”", "outlet": "Andscape", "source_url": "https://andscape.com/features/spurs-stephon-castle-buys-stake-in-connecticut-soccer-teams/", "tags": ["San Antonio Spurs", "Victor Wembanyama", "Stephon Castle"]}, {"date": "", "archive_date": "2025-12-12", "text": "With a nearly 40-inch vertical leap, San Antonio Spurs guard Stephon Castle says he would be a goalie if he played the game of soccer. What isn’t a game is that the 21-year-old is a part-owner of two expansion soccer franchises.The former University of Connecticut star is part of the expanded ownership in the Connecticut Sports Group (CSG), which owns two expansion pro soccer clubs in CT United FC and a future Connecticut women’s pro soccer club.Andscape", "quote": "The former University of Connecticut star is part of the expanded ownership in the Connecticut Sports Group (CSG), which owns two expansion pro soccer clubs in CT United FC and a future Connecticut women’s pro soccer club", "outlet": "Andscape", "source_url": "https://andscape.com/features/spurs-stephon-castle-buys-stake-in-connecticut-soccer-teams/", "tags": ["San Antonio Spurs", "Business", "Stephon Castle"]}, {"date": "", "archive_date": "2025-12-12", "text": "Jon Krawczynski:Ant downgraded to out tonight.Rare for him to miss a game against Steph (or any game for that matter)x.com", "quote": "Ant downgraded to out tonight.", "outlet": "x.com", "source_url": "https://x.com/JonKrawczynski/status/1999596998673018955", "tags": ["Golden State Warriors", "Minnesota Timberwolves", "Anthony Edwards"]}, {"date": "", "archive_date": "2025-12-12", "text": "K.C. Johnson: Per Donovan, Coby White is inIsaac Okoro, Tre Jones and Jalen Smith also in. Okoro and Smith are on 20-Minute restriction and Jones 24.x.com", "quote": "Isaac Okoro, Tre Jones and Jalen Smith also in", "outlet": "x.com", "source_url": "https://x.com/KCJHoop/status/1999608644510335085", "tags": ["Chicago Bulls", "Injuries", "Tre Jones", "Jalen Smith", "Coby White", "Isaac Okoro"]}, {"date": "", "archive_date": "2025-12-12", "text": "Austin Krell:Tyrese Maxey is OUT tonight due to an illness.x.com", "quote": "Tyrese Maxey is OUT tonight due to an illness", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/1999604621170635032", "tags": ["Philadelphia 76ers", "Injuries", "Tyrese Maxey"]}, {"date": "", "archive_date": "2025-12-12", "text": "Michael Scotto: TheSan Antonio Spurs are signing Kyle Mangas to a two-way contract,league sources told @hoopshype. Mangas has averaged 18.5 points on 50% shooting from the field and 41% from 3-point range, 5.0 assists, 2.9 rebounds, and 1.5 steals for the Austin Spurs in the G League.x.com", "quote": "San Antonio Spurs are signing Kyle Mangas to a two-way contract,", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/1999586602348077168", "tags": ["San Antonio Spurs", "Free Agency", "G League", "Kyle Mangas"]}, {"date": "", "archive_date": "2025-12-12", "text": "Michael Scotto: TheSan Antonio Spurs will waive two-way forward Riley Minix to make room for the signing of Kyle Mangas to a two-way deal,league sources said. Minix has averaged 15.5 points on 46% from the field and 39% from 3-point range, 6.4 boards and 3.3 assists in the G League this seasonx.com", "quote": "San Antonio Spurs will waive two-way forward Riley Minix to make room for the signing of Kyle Mangas to a two-way deal,", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/1999588590133670026", "tags": ["San Antonio Spurs", "G League", "Kyle Mangas", "Riley Minix"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: Redick also mentioned how \"We're the worst transition team and the worst in the first 8-10 seconds\",\"We're not a team that generates a lot of live ball turnovers\", and \"We're not a fast team\"x.com", "quote": "\"We're not a team that generates a lot of live ball turnovers\", and \"We're not a fast team\"", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999590027110883528", "tags": ["Los Angeles Lakers", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: The Los Angeles Lakers have the best pick-and-roll offense in the league.But in asking JJ Redick about how some teams defend the Lakers PnR, Redick acknowledged what I've mentioned before: the Lakers aren't a ball/body movement team, and that can shut out the non-ball-handlersx.com", "quote": "But in asking JJ Redick about how some teams defend the Lakers PnR, Redick acknowledged what I've mentioned before: the Lakers aren't a ball/body movement team, and that can shut out the non-ball-handlers", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999588363482071045", "tags": ["Los Angeles Lakers", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: in different parts of today's media, JJ Redick kept it real\"I don't think there's anybody in that meeting room that thinks we're a good defensive team right now, but I also don't think there's anybody in that meeting room that thinks we can't be a good defensive team\"x.com", "quote": "\"I don't think there's anybody in that meeting room that thinks we're a good defensive team right now, but I also don't think there's anybody in that meeting room that thinks we can't be a good defensive team\"", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999590025982529689", "tags": ["Los Angeles Lakers", "JJ Redick"]}, {"date": "", "archive_date": "2025-12-12", "text": "Law Murray: Asked Gabe Vincent about his shooting mechanics, months after JJ Redick praised his work in that areaVincent rattled off a battery of factors that a shooter has to consider.Said B.E.E.F. (balance/eyes/elbow/follow) are on his list -- but he's not revealing the list yetx.com", "quote": "Vincent rattled off a battery of factors that a shooter has to consider.", "outlet": "x.com", "source_url": "https://x.com/LawMurrayTheNU/status/1999591663447212169", "tags": ["Los Angeles Lakers", "JJ Redick", "Gabe Vincent"]}, {"date": "", "archive_date": "2025-12-12", "text": "Duane Rankin: Suns coach Jordan Ott on Devin Booker (right groin strain):“He did practice with us. It’s always a good sign.Now we’ll see how he responds from this. It’s probably the most he’s done. See exactly where he’s at, but everything seems to be progressing.” Has missed last three games with groin injury. On Oso Ighodaro from Suns last game Wednesday at OKC: \"I think it was just knee-to-knee at that time. That was in the 3rd, knee-to-knee. Game got out of control, but we like him with that last unit as another ball handler at times and to give him reps. We often forget that Oso, it's just his second season.\" #Sunsx.com", "quote": "“He did practice with us. It’s always a good sign.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/1999583876314959906", "tags": ["Phoenix Suns", "Injuries", "Devin Booker", "Jordan Ott", "Oso Ighodaro"]}, {"date": "", "archive_date": "2025-12-12", "text": "Shams Charania:San Antonio Spurs' Victor Wembanyama is likely to return for Saturday's NBA Cup semifinals against the Oklahoma City Thunder in Las Vegas,sources tell ESPN. Final clearance will come after today's practice for Wembanyama, who's been sidelined since Nov. 14 due to a calf strain.x.com", "quote": "San Antonio Spurs' Victor Wembanyama is likely to return for Saturday's NBA Cup semifinals against the Oklahoma City Thunder in Las Vegas,", "outlet": "x.com", "source_url": "https://x.com/ShamsCharania/status/1999569968313036854?s=20", "tags": ["San Antonio Spurs", "Injuries", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-12", "text": "How do you evaluate the season so far? Vincent:“It’s been a good start, I’d say. We’ve had some bumps in the road and lessons to be learned from. We’ve had some good tests. But obviously, we have a lot more work to do. But I think we’re headed in the right direction.”Essentially Sports", "quote": "“It’s been a good start, I’d say. We’ve had some bumps in the road and lessons to be learned from. We’ve had some good tests. But obviously, we have a lot more work to do. But I think we’re headed in the right direction.”", "outlet": "Essentially Sports", "source_url": "https://www.essentiallysports.com/nba-active-basketball-news-exclusive-la-lakers-gabe-vincent-dishes-on-lebron-james-luka-doncic-s-sacrifices-role-on-the-team-and-more-exclusive/", "tags": ["Los Angeles Lakers", "Gabe Vincent"]}, {"date": "", "archive_date": "2025-12-12", "text": "What are the lessons learned? Gabe Vincent:“It’s continuing to trust and continuing to build. It’s hard to build a championship team and championship habits overnight. It doesn’t happen that way. There are going to be growing pains. There are going to be bumps and bruises along the way, whether it’s dropping games we shouldn’t drop or battling against certain types of defenses and offenses and so forth.”Essentially Sports", "quote": "“It’s continuing to trust and continuing to build. It’s hard to build a championship team and championship habits overnight. It doesn’t happen that way. There are going to be growing pains. There are going to be bumps and bruises along the way, whether it’s dropping games we shouldn’t drop or battling against certain types of defenses and offenses and so forth.”", "outlet": "Essentially Sports", "source_url": "https://www.essentiallysports.com/nba-active-basketball-news-exclusive-la-lakers-gabe-vincent-dishes-on-lebron-james-luka-doncic-s-sacrifices-role-on-the-team-and-more-exclusive/", "tags": ["Los Angeles Lakers", "Gabe Vincent"]}, {"date": "", "archive_date": "2025-12-12", "text": "What have the sacrifices looked like for Luka, LeBron, and Austin? Gabe Vincent:“All three of those guys can put up ridiculous numbers offensively. It’s to the point where teams are double-teaming them at half-court off tipoff. They’re capable. They’re more than capable of commanding a double team and scoring themselves. But it takes a lot of sacrifice from them to get off of it and trust that the ball will get back to them and so forth.”Essentially Sports", "quote": "“All three of those guys can put up ridiculous numbers offensively. It’s to the point where teams are double-teaming them at half-court off tipoff. They’re capable. They’re more than capable of commanding a double team and scoring themselves. But it takes a lot of sacrifice from them to get off of it and trust that the ball will get back to them and so forth.”", "outlet": "Essentially Sports", "source_url": "https://www.essentiallysports.com/nba-active-basketball-news-exclusive-la-lakers-gabe-vincent-dishes-on-lebron-james-luka-doncic-s-sacrifices-role-on-the-team-and-more-exclusive/", "tags": ["Los Angeles Lakers", "LeBron James", "Luka Doncic", "Gabe Vincent", "Austin Reaves"]}, {"date": "", "archive_date": "2025-12-12", "text": "For quite some time now, the Warriors have been open about their desire to acquire the Pelicans’ Trey Murphy III.But if they’re going to use Kuminga to do that, then it would be helpful to know how, if at all, the Pelicans value the Warriors’ 23-year-old forward. For the time being, the feedback is mixed on that front. ’Tis the season for smokescreens, after all. Yet this part is indisputable when it comes to the Warriors’ side of the equation: These past six weeks have not been kind when it comes to Kuminga’s value. After the first six games of the season when Kuminga was receiving rave reviews, he has returned to the rollercoaster existence that embodied the vast majority of his first four seasons.New York Times", "quote": "For quite some time now, the Warriors have been open about their desire to acquire the Pelicans’ Trey Murphy III.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Golden State Warriors", "New Orleans Pelicans", "Trade", "Jonathan Kuminga", "Trey Murphy"]}, {"date": "", "archive_date": "2025-12-12", "text": "No story about trade targets is complete without discussing Golden State’s Jonathan Kuminga. Never mind that he’s not eligible to be moved until Jan. 15. There are Kuminga-related dynamics worth analyzing in the here and now — some familiar, and some not so much.The Kings are widely expected to revisit their offseason interest in Kuminga, and it remains to be seen if that’s the case for teams like Phoenix and Chicago that have been intrigued by him before. But the New Orleans Pelicans, in many ways, are front and center in this discussion.New York Times", "quote": "The Kings are widely expected to revisit their offseason interest in Kuminga, and it remains to be seen if that’s the case for teams like Phoenix and Chicago that have been intrigued by him before. But the New Orleans Pelicans, in many ways, are front and center in this discussion", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6881845/2025/12/12/nba-trades-giannis-antetokounmpo-anthony-davis-warriors-mavericks/?source=user_shared_article", "tags": ["Chicago Bulls", "Golden State Warriors", "New Orleans Pelicans", "Phoenix Suns", "Sacramento Kings", "Trade", "Jonathan Kuminga"]}, {"date": "", "archive_date": "2025-12-12", "text": "Grizzlies PR: The@memgrizz have assigned Brandon Clarke to the @MemphisHustle. Clarke will be recalled to the Grizzlies following the Hustle's practice today.x.com", "quote": "@memgrizz have assigned Brandon Clarke to the @MemphisHustle", "outlet": "x.com", "source_url": "https://x.com/GrizzliesPR/status/1999532451714957663", "tags": ["Memphis Grizzlies", "G League", "Injuries", "Brandon Clarke"]}, {"date": "", "archive_date": "2025-12-12", "text": "Damichael Cole:Ja Morant has been upgraded to probable for today’s game against the Jazz.x.com", "quote": "Ja Morant has been upgraded to probable for today’s game against the Jazz", "outlet": "x.com", "source_url": "https://x.com/DamichaelC/status/1999526112414552158?s=20", "tags": ["Memphis Grizzlies", "Injuries", "Ja Morant"]}]