[{"date": "", "archive_date": "2025-12-16", "text": "The next day, Nov. 8, during the game against the Suns, tensions spread to the bench. Paul and Van Gundy somehow found themselves shoulder to shoulder on the bench. It was the first game of what would be five consecutive DNP-CDs. For a long time, neither man said a word. Eventually Paul broke the awkward silence, snarkily asking Van Gundy if he wasn't talking to him.Van Gundy scoffed in response, multiple sources who witnessed the exchange said, and questioned Paul's earnestness. The next day at the facility, Paul had another long meeting with Frank, sources said. In it, he gave Paul a \"final warning\" about being divisive.Paul also had another tense meeting with Van Gundy that day too, trying to resolve the previous night's exchange and other issues that had caused friction between them.ESPN", "quote": "Van Gundy scoffed in response, multiple sources who witnessed the exchange said, and questioned Paul's earnestness. The next day at the facility, Paul had another long meeting with Frank, sources said. In it, he gave Paul a \"final warning\" about being divisive.", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul", "Lawerence Frank"]}, {"date": "", "archive_date": "2025-12-16", "text": "In the release announcing Paul's signing,Frank said Paul would play a \"reserve\" role. Multiple sources said Frank described Paul's role as very limited to multiple players, who were concerned about how Paul's presence might affect their own roles. Over the course of several discussions during the summer, Paul, who started 82 games last season for the San Antonio Spurs, had said he was OK with the outlines of that role, sources said. But he had also stressed that he wanted a chance to compete and that he'd do the best he could to be an extension of the coaching staff.ESPN", "quote": "Frank said Paul would play a \"reserve\" role. Multiple sources said Frank described Paul's role as very limited to multiple players, who were concerned about how Paul's presence might affect their own roles", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul", "Lawrence Frank"]}, {"date": "", "archive_date": "2025-12-16", "text": "But once Paul began playing it, the Clippers seemed to recoil. When he offered suggestions to a player about training methods, he was warned not to undermine the staff, sources said. When he'd challenge players on or off the court, or tell them how to run a play, there were complaints from both players and coaches that he was abrasive.\"That's how Chris is,\" one executive with another team said. \"He wears you out. He's convinced he's right -- and he often is right, which kind of pisses you off -- and he'll go around to everyone until you agree with him.\"ESPN", "quote": "\"That's how Chris is,\" one executive with another team said. \"He wears you out. He's convinced he's right -- and he often is right, which kind of pisses you off -- and he'll go around to everyone until you agree with him.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-16", "text": "AFTER THE TEAM was blown out in its season opener against the Utah Jazz, sources said Paul attempted to get players to talk about the loss as they came into the locker room. It was the kind of thing Paul would routinely do on other teams. Butthe Clippers' locker room, full of veteran players and coaches, is not particularly active, even after wins, sources said. So Paul's attempt to encourage dialogue fell flat.ESPN", "quote": "the Clippers' locker room, full of veteran players and coaches, is not particularly active, even after wins, sources said. So Paul's attempt to encourage dialogue fell flat", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-16", "text": "Three of those losses (two against the Phoenix Suns, one against the Oklahoma City Thunder) came against teams Paul had recently played for, and at one point, sources said, he asked a member of the coaching staff why he hadn't been consulted on how those teams, and particularly their star players, Devin Booker and Shai Gilgeous-Alexander, operate.The question, or perhaps its delivery, was not thought to be constructive,sources said.ESPN", "quote": "The question, or perhaps its delivery, was not thought to be constructive,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-16", "text": "The first person he encountered was Frank, and the two agreed to talk. During the meeting,sources said Paul raised concerns about the team's culture -- noting the lack of conversation in the group text chat and the lack of time the players spent together off the court. Frank, for his part, stressed that Paul's style wasn't in line with what they needed it to be -- that his leadership was being perceived as subversive rather than helpful.ESPN", "quote": "sources said Paul raised concerns about the team's culture -- noting the lack of conversation in the group text chat and the lack of time the players spent together off the court", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-16", "text": "Van Gundy had been upset the night before that Paul had openly questioned how the coaching staff had used Leonard's limited minutes toward the end of the team's loss to the Dallas Mavericks, their seventh in eight games. Leonard was coming off a minutes restriction and was defending a red-hot Klay Thompson, known for his movement without the ball. That took a lot of energy, Paul had argued. Van Gundy accused Paul of changing the coverage without approval.Paul responded that he had only \"suggested\" switching Leonard's defensive assignment because he had bumped up against his minutes restriction.ESPN", "quote": "Paul responded that he had only \"suggested\" switching Leonard's defensive assignment because he had bumped up against his minutes restriction", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul", "Jeff Van Gundy"]}, {"date": "", "archive_date": "2025-12-16", "text": "To prove his point, Paul stood up and walked down the aisle of the plane to Leonard and Kris Dunn and asked them if he'd suggested a change or actually changed the coverage, multiple sources who witnessed the interaction said. Both players affirmed that he'd suggested it, sources said. The interaction was brought up again to other players on the team during the flight, and sources said that subsequently got back to the coaching staff and front office. That night, the team decided they'd finally had enough.\"He was a pain in the ass when he was a great player,\" another executive with a different team said. \"And now he's not a great player.\"ESPN", "quote": "\"He was a pain in the ass when he was a great player,\" another executive with a different team said. \"And now he's not a great player.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul"]}, {"date": "", "archive_date": "2025-12-16", "text": "Frank chose Atlanta, but the meeting got pushed back because the team's flight was delayed out of Miami by six hours, after another loss. Around 11 p.m., inside Frank's hotel room at the Four Seasons, he told Paul of the team's plans to send Paul home, adding that he hoped to work with Paul on how the statement would be announced and that he hoped the team could still retire Paul's jersey one day, sources said.Paul was stunned, sources said, and tried to plead his case. At one point, he brought teammate Brook Lopez into the room as something of a character witness. Lopez and Leonard were Paul's most ardent supporters on the team, sources said. Paul reminded Frank that he'd asked him to facilitate another meeting with Lue and that hadn't happened. Frank acknowledged that, but held firm. The decision had been made.ESPN", "quote": "Paul was stunned, sources said, and tried to plead his case. At one point, he brought teammate Brook Lopez into the room as something of a character witness", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47316812/inside-ugly-chris-paul-la-clippers-divorce-nba-season-disaster-end-kawhi-leonard-era", "tags": ["Los Angeles Clippers", "Chris Paul", "Lawrence Frank", "Brook Lopez"]}, {"date": "", "archive_date": "2025-12-16", "text": "MrBuckBuck: New Orleans PelicansHerb Jones is in disbelief after a fan trolls him saying he was traded to the Lakersx.com", "quote": "Herb Jones is in disbelief after a fan trolls him saying he was traded to the Lakers", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2000910301055885530", "tags": ["Los Angeles Lakers", "New Orleans Pelicans", "Trade", "Herb Jones"]}, {"date": "", "archive_date": "2025-12-16", "text": "Vinny Benedetto:\"I think people need to stop comparing us. I think he’s an amazing player by himself,\" Nikola Jokic on Alperen Sengun.x.com", "quote": "\"I think people need to stop comparing us. I think he’s an amazing player by himself,\" Nikola Jokic on Alperen Sengun", "outlet": "x.com", "source_url": "https://x.com/VBenedetto/status/2000818039307296781", "tags": ["Denver Nuggets", "Houston Rockets", "Nikola Jokic", "Alperen Sengun"]}, {"date": "", "archive_date": "2025-12-16", "text": "Back in September, Hart was robbed while staying in the Dominick Hotel in SoHo. Three watches and jewelry worth approximately $185,000 were stolen from his room. “I’ll buy a watch,” Hart, an avid watch collector and wearer, said.“I got robbed in September with no gun. I lost three watches so I have to start replacing those. We’re in Vegas. If I put it on a hand of blackjack, I might be able to double it and get more watches.”New York Times", "quote": "“I got robbed in September with no gun. I lost three watches so I have to start replacing those. We’re in Vegas. If I put it on a hand of blackjack, I might be able to double it and get more watches.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6891538/2025/12/16/knicks-spurs-nba-cup-finals-winnings/", "tags": ["New York Knicks", "Frivolities", "Josh Hart", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Towns has plans to donate his money to help the people of the Dominican Republic. Towns, who was born in New Jersey but plays internationally for the Dominican Republic because of his late mother’s roots, has earned approximately $300 million in NBA salary.“Honestly, I’ll probably give it to the Dominican Republic,” Towns said. “They have ‘Go Sports’, ‘Go Ministries’ over there. I feel very confident knowing the money will go over there and take care of the kids in the D.R. I would love to win so I can give them more money and help the community over there.”New York Times", "quote": "“Honestly, I’ll probably give it to the Dominican Republic,” Towns said. “They have ‘Go Sports’, ‘Go Ministries’ over there. I feel very confident knowing the money will go over there and take care of the kids in the D.R. I would love to win so I can give them more money and help the community over there.”", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6891538/2025/12/16/knicks-spurs-nba-cup-finals-winnings/", "tags": ["New Jersey", "Dominican Republic"]}, {"date": "", "archive_date": "2025-12-16", "text": "Mike Curtis: Asked Cooper Flagg about rolling his left ankle, which was heavily wrapped in ice after the game:“I just rolled it a little bit. It was hurting, but I wanted to stay in the game no matter what. I’m not coming out or anything like that. Just playing through it, being tough & knowing it’s a key moment in the game.”x.com", "quote": "“I just rolled it a little bit. It was hurting, but I wanted to stay in the game no matter what. I’m not coming out or anything like that. Just playing through it, being tough & knowing it’s a key moment in the game.”", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/2000901616183206067", "tags": ["Dallas Mavericks", "Injuries", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-16", "text": "Cooper Flagg scored the most points by an 18-year-old in NBA history, but he couldn't enjoy the accomplishment because it came in defeat.Flagg put up 42 points -- topping the previous mark of 37 set by LeBron James on Dec. 13, 2003 -- in a 140-133 loss to the Utah Jazz on Monday night. \"Obviously, we didn't win. So, it's tough for me to want to be happy or any of that,\" said Flagg, who had a bag of ice on an ankle after rolling it at the end of regulation. \"But obviously, it's a success.\"ESPN", "quote": "Flagg put up 42 points -- topping the previous mark of 37 set by LeBron James on Dec. 13, 2003 -- in a 140-133 loss to the Utah Jazz on Monday night", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47320994/mavericks-cooper-flagg-youngest-nba-history-score-40", "tags": ["Dallas Mavericks", "Los Angeles Lakers", "LeBron James", "Statistics", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-16", "text": "Blake Griffin on his trade to Detroit: I had gotten wind of it because one of my best friends is very close with people in the Pistons organization. I tried to figure out if it was true or not. My agent was calling, all that. When I found out to the time the trade went through, it was like two hours. I was trying to get information and couldn’t really get any, and I saw the tweet and I just put the phone down. Iwas playing a game on the trampoline with my kids, saw the notification, and just tossed the phone into the grass. I kept playing the game. I’ll never forget—I hope my kids were so young they had no clue what was going on.I just remember being like, ‘Wow, that’s crazy.’ That was the last thing I would have guessed when I woke up that morning. But it’s fine. I appreciated my time in Detroit, and I think it all worked out.”YouTube", "quote": "was playing a game on the trampoline with my kids, saw the notification, and just tossed the phone into the grass. I kept playing the game. I’ll never forget—I hope my kids were so young they had no clue what was going on.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=ynxTys2Q3lU", "tags": ["Detroit Pistons", "Los Angeles Clippers", "Blake Griffin"]}, {"date": "", "archive_date": "2025-12-16", "text": "MrBuckBuck:Jalen Brunson when asked if the team has given any thought to spreading the wealth from the NBA Cup to everyone else in the organization: \"Yes we have. Thanks for ruining the surprise.\"x.com", "quote": "Jalen Brunson when asked if the team has given any thought to spreading the wealth from the NBA Cup to everyone else in the organization: \"Yes we have. Thanks for ruining the surprise.\"", "outlet": "x.com", "source_url": "https://x.com/MrBuckBuckNBA/status/2000828827044602034", "tags": ["New York Knicks", "Jalen Brunson", "NBA Cup"]}, {"date": "", "archive_date": "2025-12-16", "text": "Farbod Esnaashari:Both Kawhi Leonard and James Harden left without speaking to media after losing to a very shorthanded Grizzlies.x.com", "quote": "Both Kawhi Leonard and James Harden left without speaking to media after losing to a very shorthanded Grizzlies", "outlet": "x.com", "source_url": "https://x.com/Farbod_E/status/2000816814683771009", "tags": ["Los Angeles Clippers", "Memphis Grizzlies", "Media", "James Harden", "Kawhi Leonard"]}, {"date": "", "archive_date": "2025-12-16", "text": "Cyro Asseo: I asked Jamal Shead on facing his former teammate Davion Mitchell vs Heat:“It felt like training camp... I learned so much from him... I wouldn’t be in this position... without him. I just took what I could from him... was really helpful that I got to be his backup...\"x.com", "quote": "“It felt like training camp... I learned so much from him... I wouldn’t be in this position... without him. I just took what I could from him... was really helpful that I got to be his backup...\"", "outlet": "x.com", "source_url": "https://x.com/CyroAsseo/status/2000806288910061981?s=20", "tags": ["Miami Heat", "Toronto Raptors", "Davion Mitchell", "Jamal Shead"]}, {"date": "", "archive_date": "2025-12-16", "text": "CJ McCollum: \"Like, I hit a growth spurt at the right time. I go to the right school. Like, everything kind of fell into place — with hard work, prayer, and just luck. But I say all this to say that, like, I made a lot of mistakes, but my circumstances dictated my life. Like, I get drafted to Portland — there’s nothing to do there.\" \"Like, you good at your job. It’s like Ohio. Like, growing up in certain places, you’re gonna be really good at what you do if you lock in — because there’s nothing to do.\" \"There’s no real distraction.If I would’ve got drafted to Miami, I always joke like — I might not have made it to 10 years. Like, you never know the circumstances of your situation. But I was — I was locked in and mature because I had a mature brother. And if he was immature, I would’ve been immature too. But like, he shaped — he shaped the work. And then I seen his success, then I was like, 'Oh shit... like this [ __ ] works.'\"YouTube", "quote": "If I would’ve got drafted to Miami, I always joke like — I might not have made it to 10 years. Like, you never know the circumstances of your situation", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=gOgqkDn0ND4", "tags": ["Miami Heat", "Portland Trail Blazers", "Washington Wizards", "CJ McCollum"]}, {"date": "", "archive_date": "2025-12-16", "text": "CJ McCollum: \"But no, I did — I remember what I said.I used to go on HoopsHype and look at deals and look at stats. I did this my whole life. Like, before I went to Lehigh, I knew George Hill’s stats. I knew Steve Nash. I knew every — like, Steph Curry — every borderline mid-major that went to the league, like first round. I looked at them. I looked at Eric Snow — obviously he went to Michigan State — but Keith McLeod went to Bowling Green. Antonio Daniels — Ohio high school legend. So I knew, like: 'Alright, I gotta average this. I gotta be this efficient. I gotta get to the tournament.' So when it came to contracts in the league, I did the same thing. I looked at your trajectory, size, points — obviously statistics. How good is the team? And I was like: 'Okay, he’s getting eight. Okay, this guy’s getting twelve. What do I have to do? And how much team success do we have to have for me to get paid?'YouTube", "quote": "I used to go on HoopsHype and look at deals and look at stats. I did this my whole life. Like, before I went to Lehigh, I knew George Hill’s stats. I knew Steve Nash. I knew every — like, Steph Curry — every borderline mid-major that went to the league, like first round", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=gOgqkDn0ND4", "tags": ["Washington Wizards", "CJ McCollum", "Salaries"]}, {"date": "", "archive_date": "2025-12-16", "text": "Mark Medina: Grizzlies coachTuomas Iisalo said that Ja Morant \"tweaked\" his ankle and will be reevaluated.But Iisalo is holding out hope that it's not a serious injury,.x.com", "quote": "Tuomas Iisalo said that Ja Morant \"tweaked\" his ankle and will be reevaluated.", "outlet": "x.com", "source_url": "https://x.com/MarkG_Medina/status/2000808765667598570", "tags": ["Memphis Grizzlies", "Injuries", "Ja Morant", "Tuomas Iisalo"]}, {"date": "", "archive_date": "2025-12-16", "text": "Scotty Pippen Jr: “Yeah, you know, so um I've been dealing with toe pain the last few years and you know, they've been telling me it was turf toe, turf toe. Um but you know, I went to meet a doctor and he basically told me I had fractured a bone in my toe, my big toe. Um and that it was very brittle. Sobasically they had to remove the bone out of my big toe and then reattached the ligaments. Um so I've been going through that process now. The time table is around like 3 to four months. Um but you know, I'm making steps in the right direction.”YouTube", "quote": "basically they had to remove the bone out of my big toe and then reattached the ligaments. Um so I've been going through that process now. The time table is around like 3 to four months. Um but you know, I'm making steps in the right direction.”", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=quN4PWvC2cw", "tags": ["Memphis Grizzlies", "Injuries", "Scotty Pippen Jr"]}, {"date": "", "archive_date": "2025-12-16", "text": "Oh No He Didn't: Ty Lue on whether the Clippers are soft:\"I don't see us being soft, I think most of the time we're trying.I think teams are faster than us, bigger than us. We gotta become even more scrappy\"x.com", "quote": "\"I don't see us being soft, I think most of the time we're trying.", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000813068864106567", "tags": ["Los Angeles Clippers", "Coaching", "Tyronn Lue"]}, {"date": "", "archive_date": "2025-12-16", "text": "Bennett Durando:David Adelman: \"The NBA, it's in such a good place right now. The skillset in some of these guys is outrageous.The way they can shoot it, pass it, handle it. Sengun and Nikola both iso-ing at the nail. What Durant is and what he has been. ... These two teams are very even.\"x.com", "quote": "David Adelman: \"The NBA, it's in such a good place right now. The skillset in some of these guys is outrageous.", "outlet": "x.com", "source_url": "https://x.com/BennettDurando/status/2000829207312785557", "tags": ["Denver Nuggets", "David Adelman"]}, {"date": "", "archive_date": "2025-12-16", "text": "Oh No He Didn't: Ime Udoka:\"Poorly officiated game I've seen in a long time. Two have no business being out there and the crew chief was acting star struck\"x.com", "quote": "\"Poorly officiated game I've seen in a long time. Two have no business being out there and the crew chief was acting star struck\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000806726107599159", "tags": ["Houston Rockets", "Coaching", "Ime Udoka", "Officiating"]}, {"date": "", "archive_date": "2025-12-16", "text": "During a recent segment via Eurohoops, Sarunas Jasikevicius gave his opinion that coaching in the NBA is all the same style, a far cry from what he says was plenty of variety among coaches back when he played in the league.“For me the craziest thing now is when you talk about the NBA coaches, I don’t mean it in a bad way, but I used to say back when I was in the NBA. . .they all play the same,” Jasikevicius said.“There used to be these huge names in the coaching of the NBA, and they all had their own thing. Pat Riley was one thing. You learn from the triangle of Phil Jackson. Then came Mike D’Antoni with his running, spacing and a little bit smaller ball. And it was so nice. [Gregg] Popovich was playing everything through another playmaker in Tim Duncan.”Clutch Points", "quote": "“For me the craziest thing now is when you talk about the NBA coaches, I don’t mean it in a bad way, but I used to say back when I was in the NBA. . .they all play the same,” Jasikevicius said.", "outlet": "Clutch Points", "source_url": "https://clutchpoints.com/nba/nba-stories/nba-news-euroleague-coach-nba-coaching-lack-style", "tags": ["Phil Jackson", "Coaching", "Pat Riley", "Sarunas Jasikevicius"]}, {"date": "", "archive_date": "2025-12-16", "text": "Carmelo Anthony:“You can't treat New York like you could treat any other city when it comes to performance. You can't do that. Performing in Utah or Milwaukee is a lot different than performing in New York.Even performing in Miami or performing in Dallas is different than performing in New York. New York is a performance-based community to the world. So when you come—when you play and—and you perform—you got to bring your A-game. So New York keeps you on that edge. It's just most people who don't—who have limitations, who can't perform on a night-night basis…”YouTube", "quote": "“You can't treat New York like you could treat any other city when it comes to performance. You can't do that. Performing in Utah or Milwaukee is a lot different than performing in New York.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=7J6AT74dqug", "tags": ["Dallas Mavericks", "Miami Heat", "Milwaukee Bucks", "New York Knicks", "Utah Jazz", "Carmelo Anthony"]}, {"date": "", "archive_date": "2025-12-16", "text": "Carmelo Anthony:“I do believe that there's other tough arenas to play in. Like, it's tough to play in OKC. It was tough to play in Utah. Utah was like a high school gym, like a college gym where the fans is right here.That's the court. The fans is right here. I could trip my foot out and you know and—and—and [] you up on the court. If you make a wrong move, you might trip over my ankle. In Utah, it was—it was—it’s a lot different. Uh Sacramento, right? Arco Arena. Cowbells. Cowbells. It was the worst [] to be a part of. Like it was the worst arena to play in because it was a—it just like a pit, right?\"YouTube", "quote": "“I do believe that there's other tough arenas to play in. Like, it's tough to play in OKC. It was tough to play in Utah. Utah was like a high school gym, like a college gym where the fans is right here.", "outlet": "YouTube", "source_url": "https://www.youtube.com/watch?v=7J6AT74dqug", "tags": ["Sacramento Kings", "Utah Jazz", "Carmelo Anthony"]}, {"date": "", "archive_date": "2025-12-16", "text": "The Boston Celtics issued a desperate plea to fans on Monday as they revealed a former member of staff had been given a heartbreaking health diagnosis. Dr. Ed Lacerte, the former head athletic trainer for the Celtics, has been diagnosed with Leukemia, the team announced on social media. The Celtics organization shared that Lacerte, who spent decades with the franchise, had been recommended to undergo a blood stem cell transplant by doctors. The team called on fans to sign up to the National Marrow Donor Program's registry to help with Lacerte's treatment.Daily Mail", "quote": "The Boston Celtics issued a desperate plea to fans on Monday as they revealed a former member of staff had been given a heartbreaking health diagnosis", "outlet": "Daily Mail", "source_url": "https://www.dailymail.co.uk/sport/nba/article-15386949/boston-celtics-ed-lacerte-leukemia.html", "tags": ["Boston Celtics"]}, {"date": "", "archive_date": "2025-12-15", "text": "“I don’t really have anything to say,” Fox said about the Kings. “It is what it is. I wish [Murray] the best. Whether that is rebuilding, I want him to be in the best situation for him.“The grass is greener on this side.”Andscape", "quote": "“The grass is greener on this side.”", "outlet": "Andscape", "source_url": "https://andscape.com/features/for-deaaron-fox-the-grass-is-greener-with-the-san-antonio-spurs/", "tags": ["Sacramento Kings", "San Antonio Spurs", "De'Aaron Fox"]}, {"date": "", "archive_date": "2025-12-15", "text": "“We go to the playoffs and after that you want to build upon that,” Fox said about his Kings tenure. “And that doesn’t mean going from the third seed to the first seed. It just means continuing to be a playoff team. I didn’t feel like we were there. …“Everything started going bad that summer [in 2024]. I’m in a place where I want to be [now].”Andscape", "quote": "“Everything started going bad that summer [in 2024]. I’m in a place where I want to be [now].”", "outlet": "Andscape", "source_url": "https://andscape.com/features/for-deaaron-fox-the-grass-is-greener-with-the-san-antonio-spurs/", "tags": ["Sacramento Kings", "San Antonio Spurs", "De'Aaron Fox"]}, {"date": "", "archive_date": "2025-12-15", "text": "The Kings are struggling with the likes of Murray and veterans Domantas Sabonis, Zach LaVine, DeMar DeRozan and Russell Westbrook on their roster. Sources told Andscape that there is a disconnect between some veteran Kings players and Christie and his coaching staff.Sacramento is expected to explore making trades of its veteran players, a source told Andscape.Andscape", "quote": "Sacramento is expected to explore making trades of its veteran players, a source told Andscape", "outlet": "Andscape", "source_url": "https://andscape.com/features/for-deaaron-fox-the-grass-is-greener-with-the-san-antonio-spurs/", "tags": ["Sacramento Kings", "San Antonio Spurs", "Trade", "DeMar DeRozan", "Russell Westbrook", "Zach LaVine", "Domantas Sabonis", "De'Aaron Fox"]}, {"date": "", "archive_date": "2025-12-15", "text": "Omari Sankofa II: FINAL:Pistons 112, Celtics 105.They owned the second half, outscoring Boston 59-48 while shooting 50% overall. Cunningham (32 points, 10 assists, 6-10 from 3) scored 9 in the fourth to close it out. Pistons are 21-5 overall. Still on top of the Eastx.com", "quote": "Pistons 112, Celtics 105.", "outlet": "x.com", "source_url": "https://x.com/omarisankofa/status/2000760033236160621", "tags": ["Boston Celtics", "Detroit Pistons", "Cade Cunningham"]}, {"date": "", "archive_date": "2025-12-15", "text": "Josh Lewenberg:What started out as the Ingram show turned into a great team win.7 different players scored in the 4th, as the Raptors bested Miami 32-19. They needed all of BI's 28 pts; he carried them long enough for the bench & Barnes to take over the 2nd half. Scottie spectacular in the 4thx.com", "quote": "What started out as the Ingram show turned into a great team win.", "outlet": "x.com", "source_url": "https://x.com/JLew1050/status/2000763191857402202", "tags": ["Miami Heat", "Toronto Raptors", "Brandon Ingram", "Scottie Barnes"]}, {"date": "", "archive_date": "2025-12-15", "text": "Keerthika Uthayakumar: Fun fact: coming into tonight, three teams had a losing record when leading by 10+ this season.The Pelicans, the Wizards and... the Clippers who lead the NBA with 8 blown double-digit leads.x.com", "quote": "The Pelicans, the Wizards and... the Clippers who lead the NBA with 8 blown double-digit leads", "outlet": "x.com", "source_url": "https://x.com/keerthikau/status/2000772714659811395", "tags": ["Los Angeles Clippers", "New Orleans Pelicans", "Washington Wizards"]}, {"date": "", "archive_date": "2025-12-15", "text": "Mavs PR:Cooper Flagg recorded the most points in a half in his career with 24 points (7-9 FG, 1-2 3FG, 9-11 FT), the most by any Maverick in a half this season. Flagg has now recorded 20+ points in five of his last seven games.x.com", "quote": "Cooper Flagg recorded the most points in a half in his career with 24 points (7-9 FG, 1-2 3FG, 9-11 FT), the most by any Maverick in a half this season", "outlet": "x.com", "source_url": "https://x.com/MavsPR/status/2000768249814749258", "tags": ["Dallas Mavericks", "Cooper Flagg"]}, {"date": "", "archive_date": "2025-12-15", "text": "Bennett Durando:Julian Strawther (back) has been cleared to play.Doesn’t mean he will tonight, obviously, but it’s the first time he’s active in exactly one month.x.com", "quote": "Julian Strawther (back) has been cleared to play.", "outlet": "x.com", "source_url": "https://x.com/BennettDurando/status/2000744772819148851", "tags": ["Denver Nuggets", "Injuries", "Julian Strawther"]}, {"date": "", "archive_date": "2025-12-15", "text": "Joey Linn:James Harden is playing tonight after being listed as questionable.x.com", "quote": "James Harden is playing tonight after being listed as questionable", "outlet": "x.com", "source_url": "https://x.com/joeylinn_/status/2000744746491523213", "tags": ["Los Angeles Clippers", "James Harden", "Injuries"]}, {"date": "", "archive_date": "2025-12-15", "text": "Denver Nuggets: Injury Update:Peyton Watson is questionable to return to the game with a Right Trunk Contusionx.com", "quote": "Peyton Watson is questionable to return to the game with a Right Trunk Contusion", "outlet": "x.com", "source_url": "https://x.com/nuggets/status/2000764234087719423", "tags": ["Denver Nuggets", "Injuries", "Peyton Watson"]}, {"date": "", "archive_date": "2025-12-15", "text": "Marc Stein: TheMavericks have ruled out Anthony Davis tonight in Utah with a left calf contusion. It will be the 16th game missed this season for Davis, who has appeared in 11 for 10-16 Dallas. : @dallasmavsx.com", "quote": "Mavericks have ruled out Anthony Davis tonight in Utah with a left calf contusion", "outlet": "x.com", "source_url": "https://x.com/TheSteinLine/status/2000725221595050355", "tags": ["Dallas Mavericks", "Utah Jazz", "Injuries", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-15", "text": "Grant Afseth:Dallas Mavericks center Daniel Gafford will be limited to 17-20 minutes in his return to the lineup against the Utah Jazz.He's been managing a right ankle injury.x.com", "quote": "Dallas Mavericks center Daniel Gafford will be limited to 17-20 minutes in his return to the lineup against the Utah Jazz.", "outlet": "x.com", "source_url": "https://x.com/GrantAfseth/status/2000726575625724271", "tags": ["Dallas Mavericks", "Utah Jazz", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-15", "text": "Mike Curtis: Asked Kidd about the approach for AD/Brandon Williams sitting: On Davis:\"We'll see. Hopefully he feels better tomorrow & we'll see how it goes during the week. That's it. We'll see how he feels.\"On Williams: \"He just woke up with soreness. He's out & hopefully he feels better tomorrow & the next day. Hopefully he's not out long.\"x.com", "quote": "\"We'll see. Hopefully he feels better tomorrow & we'll see how it goes during the week. That's it. We'll see how he feels.\"", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/2000728894316622063", "tags": ["Dallas Mavericks", "Injuries", "Anthony Davis", "Brandon Williams"]}, {"date": "", "archive_date": "2025-12-15", "text": "Anthony Chiang:Heat says it's a right elbow injury for Nikola Jovic.He won't return to tonight's game.x.com", "quote": "Heat says it's a right elbow injury for Nikola Jovic.", "outlet": "x.com", "source_url": "https://x.com/Anthony_Chiang/status/2000737333780312203", "tags": ["Miami Heat", "Injuries", "Nikola Jovic"]}, {"date": "", "archive_date": "2025-12-15", "text": "Tim Reynolds:Nikola Jovic left with his right arm in a splint-type device.x.com", "quote": "Nikola Jovic left with his right arm in a splint-type device", "outlet": "x.com", "source_url": "https://x.com/ByTimReynolds/status/2000733868094316965", "tags": ["Miami Heat", "Injuries", "Nikola Jovic"]}, {"date": "", "archive_date": "2025-12-15", "text": "Tim Reynolds:Tyler Herro (toe) is a late scratch tonight for the Heaters.x.com", "quote": "Tyler Herro (toe) is a late scratch tonight for the Heaters", "outlet": "x.com", "source_url": "https://x.com/ByTimReynolds/status/2000718227333116038", "tags": ["Miami Heat", "Injuries", "Tyler Herro"]}, {"date": "", "archive_date": "2025-12-15", "text": "Grizzlies PR: The@memgrizz today announced the following medical update:x.com", "quote": "@memgrizz today announced the following medical update:", "outlet": "x.com", "source_url": "https://x.com/GrizzliesPR/status/2000720069727281607", "tags": ["Memphis Grizzlies", "Injuries", "John Konchar"]}, {"date": "", "archive_date": "2025-12-15", "text": "Michael Scotto: TheAtlanta Hawks have waived two-way forward Jacob Toppin,league sources told @hoopshype. Toppin had surgery to repair a torn labrum in his right shoulder and will miss the remainder of the 2025-26 season. Atlanta opens up a two-way spot in the process.x.com", "quote": "Atlanta Hawks have waived two-way forward Jacob Toppin,", "outlet": "x.com", "source_url": "https://x.com/MikeAScotto/status/2000697738715902095", "tags": ["Atlanta Hawks", "Jacob Toppin"]}, {"date": "", "archive_date": "2025-12-15", "text": "Duane Rankin: Last Two-Minute report on LeBron James non-call on Dillon Brooks 3 to give Suns a 114-113 lead in 116-114 loss to Lakers. CNC (Correct Non Call). Explanation:James (LAL) contests to the side of Brooks (PHX) and would avoid making contact if not for Brooks extending his left leg/knee towards James.#Suns #LakeShowx.com", "quote": "James (LAL) contests to the side of Brooks (PHX) and would avoid making contact if not for Brooks extending his left leg/knee towards James.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2000703091835068430", "tags": ["Los Angeles Lakers", "Phoenix Suns", "LeBron James", "Referees", "Officiating", "Dillon Brooks"]}, {"date": "", "archive_date": "2025-12-15", "text": "Duane Rankin: Last Two-Minute report on Devin Booker fouling LeBron James on a 3. James went 2-of-3 to give Lakers 115-114 lead with three seconds left. Won 116-114. CC (Correct call).Replay review of the foul called on Booker (PHX) pursuant to a coach's challenge was deemed unsuccessful. Booker initiates contact with James' (LAL) right arm/wrist as he is starting his upward shooting motion.#Suns #LakeShowx.com", "quote": "Replay review of the foul called on Booker (PHX) pursuant to a coach's challenge was deemed unsuccessful. Booker initiates contact with James' (LAL) right arm/wrist as he is starting his upward shooting motion.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2000705245438206106", "tags": ["Los Angeles Lakers", "Phoenix Suns", "LeBron James", "Referees", "Officiating", "Devin Booker"]}, {"date": "", "archive_date": "2025-12-15", "text": "Duane Rankin: Last Two-Minute report on Dillon Brooks 2nd technical foul that led to an ejection with 12.2 seconds left in Suns 116-114 loss to Lakers. CC (Correct call)Brooks (PHX) is assessed a technical foul for unsportsmanlike physical contact with James (LAL) during a dead ball situation.#Suns #LakeShowx.com", "quote": "Brooks (PHX) is assessed a technical foul for unsportsmanlike physical contact with James (LAL) during a dead ball situation.", "outlet": "x.com", "source_url": "https://x.com/DuaneRankin/status/2000705070858695033", "tags": ["Los Angeles Lakers", "Phoenix Suns", "Referees", "Officiating", "Dillon Brooks"]}, {"date": "", "archive_date": "2025-12-15", "text": "Ira Winderman: Erik Spoelstra on Nikola Jovic,\"He's been good the last three weeks. He's made some progress in focusing on what he can control.\"x.com", "quote": "\"He's been good the last three weeks. He's made some progress in focusing on what he can control.\"", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/2000699650051878927", "tags": ["Miami Heat", "Erik Spoelstra", "Nikola Jovic"]}, {"date": "", "archive_date": "2025-12-15", "text": "Ira Winderman:Heat say Kasparas Jakucionis (left ankle soreness) is now cleared to play.Only Pelle Larsson (ankle) out. (And, of course, Terry Rozier.)x.com", "quote": "Heat say Kasparas Jakucionis (left ankle soreness) is now cleared to play.", "outlet": "x.com", "source_url": "https://x.com/IraHeatBeat/status/2000698219567706126", "tags": ["Miami Heat", "Injuries", "Terry Rozier", "Pelle Larsson", "Kasparas Jakucionis"]}, {"date": "", "archive_date": "2025-12-15", "text": "hello and welcome:“He (Kawhi) said it from day one… I’m not staying here.”- @FredVanVleetx.com", "quote": "“He (Kawhi) said it from day one… I’m not staying here.”", "outlet": "x.com", "source_url": "https://x.com/hellowelcomepod/status/2000677452217983247", "tags": ["Toronto Raptors", "Kawhi Leonard", "Fred VanVleet"]}, {"date": "", "archive_date": "2025-12-15", "text": "The great people of NBA Twitter let it be known their opinion that they believed the best of George was in the past, but he wanted to shut those thoughts down. \"I mean, prior to coming here, I was coming off one of my most efficient seasons,\" George explained. \"All-Star that year. I didn't see myself being washed that fast, but I knew. I knew that this league is about what you can do now, and they tend to forget everything that I have done.So, it was a bit of motivation going into the summer to just get healthy and kind of let everything else take care of itself.\"Sixers Wire", "quote": "So, it was a bit of motivation going into the summer to just get healthy and kind of let everything else take care of itself.\"", "outlet": "Sixers Wire", "source_url": "https://sixerswire-eu.usatoday.com/story/sports/nba/sixers/2025/12/15/sixers-paul-george-addresses-washed-accusations-after-loss-to-hawks/87770680007/", "tags": ["Philadelphia 76ers", "Paul George"]}, {"date": "", "archive_date": "2025-12-15", "text": "\"Oh, my God. I mean, it was rough, man,\" George began reminiscing of 2024-25.\"It was brutal. And when you play for Philly, it's brutal, man. I had an expectation coming into the year, and for me, me alone, like not even the noise outside and whatever people said, you know?It was just me, the expectation I had, and my first year playing with these guys, and the expectation they had of me, and it was just a lot that physically, I just couldn't do and so, yeah, mentally, man, it broke me down. It was rough and hard times just because it was like, ‘Man, I know what I'm capable of, but my body's just not allowing it.’ So it was a rough one last year.\"Sixers Wire", "quote": "\"It was brutal. And when you play for Philly, it's brutal, man. I had an expectation coming into the year, and for me, me alone, like not even the noise outside and whatever people said, you know?", "outlet": "Sixers Wire", "source_url": "https://sixerswire-eu.usatoday.com/story/sports/nba/sixers/2025/12/15/sixers-paul-george-addresses-washed-accusations-after-loss-to-hawks/87770680007/", "tags": ["Philadelphia 76ers", "Paul George"]}, {"date": "", "archive_date": "2025-12-15", "text": "“You said nine starting lineups?” Curry responded after a 136-131 loss to the Portland Trail Blazers. “I didn’t know that.”With Draymond Green back on the floor Sunday night after missing the last week and a half because of a foot injury and a team excused absence, Golden State used its 15th different starting lineup of the season.New York Times", "quote": "With Draymond Green back on the floor Sunday night after missing the last week and a half because of a foot injury and a team excused absence, Golden State used its 15th different starting lineup of the season", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6891313/2025/12/15/warriors-starting-lineup-carousel-nba/", "tags": ["Golden State Warriors", "Stephen Curry", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-15", "text": "“You can’t find continuity until you find stuff that works,” Green said. “And then it leads to wins. And right now we haven’t done that.So there’s no chance of finding continuity. You’re not just gonna start the same lineup to keep it familiar. If you ain’t f–ing winning, you ain’t winning. You got to change something. So until we figure it out, he’s going to be changing s— because we got to figure it out.”New York Times", "quote": "“You can’t find continuity until you find stuff that works,” Green said. “And then it leads to wins. And right now we haven’t done that.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6891313/2025/12/15/warriors-starting-lineup-carousel-nba/", "tags": ["Golden State Warriors", "Draymond Green"]}, {"date": "", "archive_date": "2025-12-15", "text": "Oh No He Didn't: Jalen Brunson: \"The conversation about the East being wide open I'm not a fan ofthat...the East is a lot better than people think and it's a grind every night\"x.com", "quote": "that...the East is a lot better than people think and it's a grind every night\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000667493421957558", "tags": ["New York Knicks", "Jalen Brunson"]}, {"date": "", "archive_date": "2025-12-15", "text": "Oh No He Didn't: Wemby on Spurs/Thunder potentially becoming a rivalry:\"I think we're not quite there yet but it's a good sign that people see that it's possible. It's not like we're the second seed right now.I don't think anybody right now can claim to have a rivalry with them in the league. They're in their own tier, but in the future, provided that they stay just as good and we reach that level, of course it'd be great to have a rivalry. I'm very interested by it\"x.com", "quote": "\"I think we're not quite there yet but it's a good sign that people see that it's possible. It's not like we're the second seed right now.", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000682141324071249", "tags": ["Oklahoma City Thunder", "San Antonio Spurs", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-15", "text": "Oh No He Didn't: Wemby on his \"pure, ethical basketball\" comment:\"In modern basketball, we see a lot of brands of basketball that don't offer much variety\"x.com", "quote": "\"In modern basketball, we see a lot of brands of basketball that don't offer much variety\"", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000679924579946624", "tags": ["San Antonio Spurs", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-15", "text": "Dan Weiss: Victor Wembanyama posted an incredible individual net rating difference of +74.9 Saturday .The Spurs had a net rating of +43.8 when Victor was on the court and -31.1 when he was off in his 21 minutes.#danalyticsx.com", "quote": "The Spurs had a net rating of +43.8 when Victor was on the court and -31.1 when he was off in his 21 minutes.", "outlet": "x.com", "source_url": "https://x.com/DanWeissPBP/status/2000679661487980603", "tags": ["San Antonio Spurs", "Analytics", "Victor Wembanyama"]}, {"date": "", "archive_date": "2025-12-15", "text": "Oh No He Didn't:\"I don't get the sense that they're (the Clippers) thinking about blowing it up.I think they want to get back to being as competitive as they can be\" - @ramonashelburnex.com", "quote": "\"I don't get the sense that they're (the Clippers) thinking about blowing it up.", "outlet": "x.com", "source_url": "https://x.com/ohnohedidnt24/status/2000673809632821481", "tags": ["Los Angeles Clippers", "Trade"]}, {"date": "", "archive_date": "2025-12-15", "text": "Austin Krell:Adem Bona and Justin Edwards have been assigned to the Delaware Blue Coats,per the Sixers.x.com", "quote": "Adem Bona and Justin Edwards have been assigned to the Delaware Blue Coats,", "outlet": "x.com", "source_url": "https://x.com/NBAKrell/status/2000672424509964593", "tags": ["Philadelphia 76ers", "G League", "Justin Edwards", "Adem Bona"]}, {"date": "", "archive_date": "2025-12-15", "text": "Mike Curtis: Asked Daniel Gafford about the balance of resting his ankle as much as he can, as opposed to playing even if he’s not 100%:“I just want to come back and be able to do the things I’m able to do & make an impact. I don’t want to be out there being a liability & hurting the team.”x.com", "quote": "“I just want to come back and be able to do the things I’m able to do & make an impact. I don’t want to be out there being a liability & hurting the team.”", "outlet": "x.com", "source_url": "https://x.com/MikeACurtis2/status/2000670717655052594", "tags": ["Dallas Mavericks", "Injuries", "Daniel Gafford"]}, {"date": "", "archive_date": "2025-12-15", "text": "The Utah Jazz provided the following injury update on forward Georges Niang:Niang (left foot, fourth metatarsal stress reaction) continues to progress through rehab. He will be re-evaluated in two weeks.NBA.com", "quote": "Niang (left foot, fourth metatarsal stress reaction) continues to progress through rehab. He will be re-evaluated in two weeks", "outlet": "NBA.com", "source_url": "https://www.nba.com/jazz/news/georges-niang-injury-update-5", "tags": ["Utah Jazz", "Injuries", "Georges Niang"]}, {"date": "", "archive_date": "2025-12-15", "text": "Dan Woike:The Los Angeles Lakers have assigned guard Dalton Knecht and forward Adou Thiero to the South Bay Lakers.I believe its Knecht’s first assignment this yearTwitter @DanWoikeSports", "quote": "The Los Angeles Lakers have assigned guard Dalton Knecht and forward Adou Thiero to the South Bay Lakers.", "outlet": "Twitter @DanWoikeSports", "source_url": "https://hoopshype.com/social/", "tags": ["Los Angeles Lakers", "G League", "Dalton Knecht", "Adou Thiero"]}, {"date": "", "archive_date": "2025-12-15", "text": "Phoenix Suns: OFFICIAL:The Suns have assigned Rasheer Fleming and Khaman Maluach to the Valley Suns of the NBA G League. @GLeagueSuns take on the Salt Lake City Stars tonight at 6PM on the road.Twitter @Suns", "quote": "The Suns have assigned Rasheer Fleming and Khaman Maluach to the Valley Suns of the NBA G League", "outlet": "Twitter @Suns", "source_url": "http://twitter.com/Suns/status/2000658585387458823", "tags": ["Phoenix Suns", "G League", "Khaman Maluach", "Rasheer Fleming"]}, {"date": "", "archive_date": "2025-12-15", "text": "“I practice. I'm in the gym a lot, so whatever shot I shoot, I've seen it before in workouts or in runs,” Shaedon Sharpe told RG pregame in Cleveland last week. For what Portland needs, Sharpe’s mindset is welcomed.“I never look at field goals. That's too vague,” Blazers acting head coach Tiago Splitter said to RG in his pregame press conference. “You've got to see what happens in the game. What was a bad shot? What was a good shot?Sometimes, if you take 30 shots in a game and they were good shots, that's fine. Sometimes, you make four shots, and they're all bad shots; that's not good. So, it doesn't say everything, the number of field goals. So you've got to be careful with that [when judging].”Responsible Gaming", "quote": "“I never look at field goals. That's too vague,” Blazers acting head coach Tiago Splitter said to RG in his pregame press conference. “You've got to see what happens in the game. What was a bad shot? What was a good shot?", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/shaedon-sharpe-career-year-steadies-blazers-amid-injuries", "tags": ["Portland Trail Blazers", "Tiago Splitter", "Coaching", "Shaedon Sharpe"]}, {"date": "", "archive_date": "2025-12-15", "text": "Splitter wants Sharpe to ambush the opposition, and the same applies to Deni Avdija and Jerami Grant. “Those guys have talent; we need them to be aggressive,” Splitter said. “So, I don't see just a number.I see the game, I see what they're doing, and if it's the right shot for that particular play.”Responsible Gaming", "quote": "Splitter wants Sharpe to ambush the opposition, and the same applies to Deni Avdija and Jerami Grant. “Those guys have talent; we need them to be aggressive,” Splitter said. “So, I don't see just a number.", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/shaedon-sharpe-career-year-steadies-blazers-amid-injuries", "tags": ["Portland Trail Blazers", "Tiago Splitter", "Coaching", "Jerami Grant", "Deni Avdija", "Shaedon Sharpe"]}, {"date": "", "archive_date": "2025-12-15", "text": "“I feel like we're a defensive-focused team, so really whatever I can do to help the team,” Sharpe said. “I feel like it came along pretty good.I've just got to get better at really guarding and being more focused, I guess. Film always helps with that, so just watching film and really studying what other guys like to do.”Responsible Gaming", "quote": "“I feel like we're a defensive-focused team, so really whatever I can do to help the team,” Sharpe said. “I feel like it came along pretty good.", "outlet": "Responsible Gaming", "source_url": "https://rg.org/news/basketball/shaedon-sharpe-career-year-steadies-blazers-amid-injuries", "tags": ["Portland Trail Blazers", "Shaedon Sharpe"]}, {"date": "", "archive_date": "2025-12-15", "text": "NBA G League:Elfrid Payton is back in the G League! The former NBA veteran has been acquired by the @Austin Spursfor his twelfth professional season.Twitter", "quote": "Elfrid Payton is back in the G League! The former NBA veteran has been acquired by the @Austin Spurs", "outlet": "Twitter", "source_url": "http://twitter.com/nbagleague/status/2000646957308735894", "tags": ["Free Agency", "G League", "Elfrid Payton"]}, {"date": "", "archive_date": "2025-12-15", "text": "Utah Jazz: Georges Niang Injury Update:Niang (left foot, fourth metatarsal stress reaction) continues to progress through rehab. He will be re-evaluated in two weeks. #TakeNoteTwitter @utahjazz", "quote": "Niang (left foot, fourth metatarsal stress reaction) continues to progress through rehab. He will be re-evaluated in two weeks", "outlet": "Twitter @utahjazz", "source_url": "http://twitter.com/utahjazz/status/2000645866814603701", "tags": ["Utah Jazz", "Injuries", "Georges Niang"]}, {"date": "", "archive_date": "2025-12-15", "text": "The Mavericks have downgraded Brandon Williams (right Achilles soreness) to questionablefor Monday’s game against Utah.HoopsHype", "quote": "The Mavericks have downgraded Brandon Williams (right Achilles soreness) to questionable", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/11/10/nba-injury-tracker-whos-not-available-right-now/86822180007/", "tags": ["Dallas Mavericks", "Injuries", "Brandon Williams"]}, {"date": "", "archive_date": "2025-12-15", "text": "The Golden State Warriors continue to waste the spectacular efforts of Stephen Curry, who has scored 87 points in two games since returning from a quad injury, but seen his team lose both to drop to 13-14 for the season.\"I'm not doing my job well this year,\" coach Steve Kerr told reporters in Portland after Curry made 12 3-pointers and scored 48 points in a 136-131 loss to the Trail Blazers on Sunday.ESPN", "quote": "\"I'm not doing my job well this year,\" coach Steve Kerr told reporters in Portland after Curry made 12 3-pointers and scored 48 points in a 136-131 loss to the Trail Blazers on Sunday", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47315088/steve-kerr-not-doing-my-job-well-warriors-continue-struggle", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Stephen Curry"]}, {"date": "", "archive_date": "2025-12-15", "text": "In those 737 minutes on the bench this season, the Warriors have a 107.1 offensive rating, lower than the league's worst offense (Indiana, 108.2). That's a departure from late last season when the Warriors survived offensively without Stephen Curry because of Jimmy Butler's arrival in February.\"I thought we did a better job last year putting him in position to attack and create shots for people,\" Kerr told reporters. \"We need to get back to that type of control of the game where we are going to him in the half court.\"ESPN", "quote": "\"I thought we did a better job last year putting him in position to attack and create shots for people,\" Kerr told reporters. \"We need to get back to that type of control of the game where we are going to him in the half court.\"", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47315088/steve-kerr-not-doing-my-job-well-warriors-continue-struggle", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Stephen Curry", "Jimmy Butler"]}, {"date": "", "archive_date": "2025-12-15", "text": "Brooklyn Nets PR:The Brooklyn Nets have assigned Ben Saraf and Nolan Traore to their NBA G League affiliate,the Long Island Nets.Twitter", "quote": "The Brooklyn Nets have assigned Ben Saraf and Nolan Traore to their NBA G League affiliate,", "outlet": "Twitter", "source_url": "http://twitter.com/BKN_NETSPR/status/2000645802528530717", "tags": ["Brooklyn Nets", "G League", "Nolan Traore", "Ben Saraf"]}, {"date": "", "archive_date": "2025-12-15", "text": "The Los Angeles Lakers and Lotus Communications announced today that KFWB 980 AM “La Mera Mera” will be the team’s new Spanish-language radio broadcast channel,moving from Lotus Communications’ affiliate station, KWKW 1330 AM.NBA.com", "quote": "The Los Angeles Lakers and Lotus Communications announced today that KFWB 980 AM “La Mera Mera” will be the team’s new Spanish-language radio broadcast channel,", "outlet": "NBA.com", "source_url": "https://www.nba.com/lakers/news/los-angeles-lakers-announce-kfwb-980-am-as-new-home-for-spanish-language-radio-broadcast-251215", "tags": ["Los Angeles Lakers", "Media"]}, {"date": "", "archive_date": "2025-12-15", "text": "The NBA Cup may be leaving Sin City.The league is openly considering the possibility of moving the championship game of its in-season tournament away from Las Vegas for next season,sources familiar with the situation told ESPN. That decision, which comes in the wake of the league announcing back in September that this would be the last season both the semifinals and championship game will be played at a neutral site, is a recognition that the neutral site approach has lacked the energy and enthusiasm, at least to this point, the league initially hoped it would.ESPN", "quote": "The league is openly considering the possibility of moving the championship game of its in-season tournament away from Las Vegas for next season,", "outlet": "ESPN", "source_url": "https://www.espn.com/nba/story/_/id/47314358/three-seasons-nba-cup-move-vegas", "tags": ["Las Vegas", "NBA 2K"]}, {"date": "", "archive_date": "2025-12-15", "text": "Andy Larsen:Oscar Tshiebwe has been called up and is available for the Jazz at center tonight.(Jusuf Nurkic resting.)Twitter @andyblarsen", "quote": "Oscar Tshiebwe has been called up and is available for the Jazz at center tonight.", "outlet": "Twitter @andyblarsen", "source_url": "https://hoopshype.com/social/", "tags": ["Utah Jazz", "G League", "Jusuf Nurkic", "Oscar Tshiebwe"]}, {"date": "", "archive_date": "2025-12-15", "text": "Golden State Warriors coachSteve Kerr made another passionate plea for more gun control restrictions in the wake of Saturday’s shooting at Brown University. Kerr, unprompted, spoke for three minutes as he finished up his pregame news conference ahead of Sunday’s game against the Portland Trail Blazers.New York Times", "quote": "Steve Kerr made another passionate plea for more gun control restrictions in the wake of Saturday’s shooting at Brown University", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6889873/2025/12/14/steve-kerr-gun-control-brown-warriors-comments/", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Politics", "Activism"]}, {"date": "", "archive_date": "2025-12-15", "text": "“I do want to say one thing,” Kerr began. “I was sitting here seven years ago after the Parkland shooting. We were in Portland that day, and I remember turning on the news and seeing the news.With what happened last night at Brown, it’s just a reminder to me that these shootings continue to happen, and there is something we can do about them.The loss that all of the people involved (Saturday) night, the loss that they’re feeling, is exactly the same loss as all the Parkland families, and every other mass shooting.”New York Times", "quote": "With what happened last night at Brown, it’s just a reminder to me that these shootings continue to happen, and there is something we can do about them.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6889873/2025/12/14/steve-kerr-gun-control-brown-warriors-comments/", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Politics", "Activism"]}, {"date": "", "archive_date": "2025-12-15", "text": "“The vast majority of gun owners in this country are responsible, law-abiding citizens,” Kerr continued. “They have every right to own a gun. But it’s on us to decide if we actually want to take action as a country, as citizens. We know, we know there are common-sense measures we can take that will save people’s lives. AndI just want people out there — it doesn’t matter if you’re Democrat or Republican, or gun owner, non-gun owner — I just want people thinking, ‘What if it were my child?’ What if it were my brother or sister? Would you be willing to stand up to your representatives and say, ‘You know what? Enough.I’m not gonna vote for you unless you are going to stand up for gun violence prevention through common sense laws that the vast majority of Americans agree on.'”New York Times", "quote": "I just want people out there — it doesn’t matter if you’re Democrat or Republican, or gun owner, non-gun owner — I just want people thinking, ‘What if it were my child?’ What if it were my brother or sister? Would you be willing to stand up to your representatives and say, ‘You know what? Enough.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6889873/2025/12/14/steve-kerr-gun-control-brown-warriors-comments/", "tags": ["Golden State Warriors", "Steve Kerr", "Coaching", "Politics", "Activism"]}, {"date": "", "archive_date": "2025-12-15", "text": "Jason Beede: NEWS:An MRI conducted Monday confirmed that #Magic guard Jalen Suggs suffered a left hip contusion Saturday against the Knicks,the @orlandosentinel.com has learned. His return will depend on how he responds to treatment, I’m told.Bluesky", "quote": "An MRI conducted Monday confirmed that #Magic guard Jalen Suggs suffered a left hip contusion Saturday against the Knicks,", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/jbeede.bsky.social/post/3ma25f567ms2d", "tags": ["Orlando Magic", "Injuries", "Jalen Suggs"]}, {"date": "", "archive_date": "2025-12-15", "text": "John Karalis:The Celtics have listed Payton Pritchard as questionable for tonightwith a right neck spasm.Bluesky", "quote": "The Celtics have listed Payton Pritchard as questionable for tonight", "outlet": "Bluesky", "source_url": "https://bsky.app/profile/johnkaralis.com/post/3ma24xucwsc2t", "tags": ["Boston Celtics", "Injuries", "Payton Pritchard"]}, {"date": "", "archive_date": "2025-12-15", "text": "A’Ja Wilson spoke about eventual marriage and starting a family. “That is always a dream,” Wilson said. “This is my life partner.” Over the four years of the relationship that bloomed during the 2021 Paris Olympics, Bam Adebayo largely had advocated for privacy. But the more the two were seen in public together, the more they shared in each others’ successes, the less there was a need to shy. “Nah, I mean we were never shy,” Adebayo said as he leaned against a door frame by the Heat’s practice court at Kaseya Center. “It was just with privacy you can actually build your foundation, work on making it solid and working towards when it gets public. We weren’t actually being secretive about it. We just know how to shut up.”South Florida Sun-Sentinel", "quote": "A’Ja Wilson spoke about eventual marriage and starting a family. “That is always a dream,” Wilson said. “This is my life partner.” Over the four years of the relationship that bloomed during the 2021 Paris Olympics, Bam Adebayo largely had advocated for privacy. But the more the two were seen in public together, the more they shared in each others’ successes, the less there was a need to shy", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/15/dpoy-still-the-work-goal-but-d-a-d-also-resonating-for-heats-adebayo-as-he-discusses-relationship-with-wnbas-wilson/", "tags": ["Miami Heat", "Bam Adebayo", "A'ja Wilson"]}, {"date": "", "archive_date": "2025-12-15", "text": "Now the comfort is such that Wilson, 29, is courtside at some Heat games, waiting outside the locker room at others. “Because,” Adebayo said, “we all know, you get on social media and ‘Clown#987’ is going to be on there like, ‘I don’t like you’all being together.’ It’s like any little thing in the beginning can fracture that.So take my advice, just be positive before you want to run your mouth.”South Florida Sun-Sentinel", "quote": "Now the comfort is such that Wilson, 29, is courtside at some Heat games, waiting outside the locker room at others. “Because,” Adebayo said, “we all know, you get on social media and ‘Clown#987’ is going to be on there like, ‘I don’t like you’all being together.’ It’s like any little thing in the beginning can fracture that.", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/15/dpoy-still-the-work-goal-but-d-a-d-also-resonating-for-heats-adebayo-as-he-discusses-relationship-with-wnbas-wilson/", "tags": ["Miami Heat", "Social Media", "Bam Adebayo", "A'ja Wilson"]}, {"date": "", "archive_date": "2025-12-15", "text": "As for what would follow eventually ringing in such a moment? Since Wilson put it out there, sure, Adebayo said, no need to remain reserved. “I mean, you look forward to having children,” he said with the type of lightness that seemingly would transcend any DPOY.“I’ve been blessed to be around a lot of guys that have kids, that are amazing dads. So having thought of having kids, I want to raise ’em in a certain way. I turned out to be a great child, so that makes me have a high belief that I can also raise great children.”South Florida Sun-Sentinel", "quote": "“I’ve been blessed to be around a lot of guys that have kids, that are amazing dads. So having thought of having kids, I want to raise ’em in a certain way. I turned out to be a great child, so that makes me have a high belief that I can also raise great children.”", "outlet": "South Florida Sun-Sentinel", "source_url": "https://www.sun-sentinel.com/2025/12/15/dpoy-still-the-work-goal-but-d-a-d-also-resonating-for-heats-adebayo-as-he-discusses-relationship-with-wnbas-wilson/", "tags": ["Miami Heat", "Bam Adebayo", "A'ja Wilson"]}, {"date": "", "archive_date": "2025-12-15", "text": "While the outside noise may have fans of opposing teams drooling about the potential of adding Giannis Antetokounmpo to their roster, league sources told The Athletic theBucks have told franchises they are looking to add to their roster in hopes of fortifying their struggling team in the week leading up to Dec. 15.That messaging could certainly change as the Feb. 5 trade deadline nears.New York Times", "quote": "Bucks have told franchises they are looking to add to their roster in hopes of fortifying their struggling team in the week leading up to Dec. 15.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6890775/2025/12/15/bucks-giannis-antetokounmpo-nba-trade-season/", "tags": ["Milwaukee Bucks", "Trade", "Giannis Antetokounmpo"]}, {"date": "", "archive_date": "2025-12-15", "text": "It should come as no surprise that, as The Athletic confirmed this week, they’ve done due diligence on the Sacramento Kings’ Zach LaVine recently(and have shown interest in him in the past). At minimum, that revelation shows that with their backs against the wall, the Bucks might once again be willing to take a more sizable swing than just adding around the periphery as they search for solutions.New York Times", "quote": "It should come as no surprise that, as The Athletic confirmed this week, they’ve done due diligence on the Sacramento Kings’ Zach LaVine recently", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6890775/2025/12/15/bucks-giannis-antetokounmpo-nba-trade-season/", "tags": ["Milwaukee Bucks", "Sacramento Kings", "Trade", "Zach LaVine"]}, {"date": "", "archive_date": "2025-12-15", "text": "Utah Jazz:We have recalled Taylor Hendricks and Cody Williams from the @Salt Lake City Stars#TakeNoteTwitter @utahjazz", "quote": "We have recalled Taylor Hendricks and Cody Williams from the @Salt Lake City Stars", "outlet": "Twitter @utahjazz", "source_url": "http://twitter.com/utahjazz/status/2000604820018000181", "tags": ["Utah Jazz", "G League", "Taylor Hendricks", "Cody Williams"]}, {"date": "", "archive_date": "2025-12-15", "text": "The nine paydays averaging $15.84 million began in October — filed away as monthly TV money — with the thought they would line the owners’ pockets. But at closer glance of the NBA’s 11-year, $77 billion national media rights deal from last summer, and the immediate impact on 30 franchises, the realities are more subtle and circumstantial— as in they won’t transform any of the teams’ near-term P&L. “Does the money help? Of course it does,” said one team executive. “But is anybody going to eat differently? No.”Sports Business Journal", "quote": "The nine paydays averaging $15.84 million began in October — filed away as monthly TV money — with the thought they would line the owners’ pockets. But at closer glance of the NBA’s 11-year, $77 billion national media rights deal from last summer, and the immediate impact on 30 franchises, the realities are more subtle and circumstantial", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/15/new-nba-media-rights-money-is-in-but-impact-is-not-in-plain-sight/", "tags": ["Media", "Business", "TV Rights"]}, {"date": "", "archive_date": "2025-12-15", "text": "After candid conversations with multiple franchises, this season’s media rights money — $142.56 million per team, paid out in equal monthly amounts from November through April and lower disparate amounts in October, May and June — is a roughly $40 million increase from last season and is being utilized by teams in mostly these conventional ways: (1) Player salaries; (2) capital expenditures; (3) recouping lost local TV money; (4) paying luxury tax penalties; (5) paying down debt; and (6) stashing the cash into the general pot of running team business.“We’ve never looked at it as, ‘Hey everybody, here’s an extra $40 million,’ and let’s ask our owner, ‘Where do you want to spend it?’” said another team executive. “In many ways, it’s part of the budget.”Sports Business Journal", "quote": "“We’ve never looked at it as, ‘Hey everybody, here’s an extra $40 million,’ and let’s ask our owner, ‘Where do you want to spend it?’” said another team executive. “In many ways, it’s part of the budget.”", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/15/new-nba-media-rights-money-is-in-but-impact-is-not-in-plain-sight/", "tags": ["Media", "Business", "TV Rights"]}, {"date": "", "archive_date": "2025-12-15", "text": "Considering the salary cap went from $140.59 million in 2024-25 to $154.65 million in 2025-26 (almost a 10% increase), teams need to account for that rise in player payroll, which is where one club said about half of its new media rights money is going.“That’s whose lives are going to change most from this new media deal — it’s the players,” said a team exec, referencing, in part, the basketball-related income (BRI) that’s divided roughly 50-50 with the player pool.Sports Business Journal", "quote": "“That’s whose lives are going to change most from this new media deal — it’s the players,” said a team exec, referencing, in part, the basketball-related income (BRI) that’s divided roughly 50-50 with the player pool", "outlet": "Sports Business Journal", "source_url": "https://www.sportsbusinessjournal.com/Articles/2025/12/15/new-nba-media-rights-money-is-in-but-impact-is-not-in-plain-sight/", "tags": ["Media", "Business", "TV Rights"]}, {"date": "", "archive_date": "2025-12-15", "text": "According to team sources The Athletic has spoken with, theMavericks are signaling a desire to be competitive for the rest of the season, even though Dallas’ 2026 first-round pick is the last of its own first-round picks it has outright control of until 2031.The Mavericks have won five of six games and, as it was pointed out to The Athletic, it would be difficult to meaningfully improve their lottery odds compared to where they are now because of the gulf in talent between Dallas’ roster and the NBA dregs populating the bottom of each conference.New York Times", "quote": "Mavericks are signaling a desire to be competitive for the rest of the season, even though Dallas’ 2026 first-round pick is the last of its own first-round picks it has outright control of until 2031.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6888689/2025/12/15/mavericks-nba-trade-deadline-anthony-davis/", "tags": ["Dallas Mavericks", "Trade", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-15", "text": "That doesn’t mean the Mavericks are unwilling to be sellers ahead of the Feb. 5 trade deadline. The team is expected to listen to offers on many of its veteran players, including Anthony Davis,league sources said. But the Mavericks are acting as though they are comfortable keeping the core of their roster intact through the rest of this season if there aren’t deals out there they feel good about.New York Times", "quote": "That doesn’t mean the Mavericks are unwilling to be sellers ahead of the Feb. 5 trade deadline. The team is expected to listen to offers on many of its veteran players, including Anthony Davis,", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6888689/2025/12/15/mavericks-nba-trade-deadline-anthony-davis/", "tags": ["Dallas Mavericks", "Trade", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-15", "text": "So what are the Mavericks supposed to do with their 10-time All-Star who turns 33 in March? Multiple NBA sources with rival teams believe the answer could be nothing — at least for now. The view in some corners of the league is the Mavericks might try to wait until this summer to deal him.The Mavericks could use the rest of this season to improve Davis’ trade value, which is low after he missed extended stretches in each of the last two seasons with an adductor strain and a calf strain.New York Times", "quote": "So what are the Mavericks supposed to do with their 10-time All-Star who turns 33 in March? Multiple NBA sources with rival teams believe the answer could be nothing — at least for now. The view in some corners of the league is the Mavericks might try to wait until this summer to deal him.", "outlet": "New York Times", "source_url": "https://www.nytimes.com/athletic/6888689/2025/12/15/mavericks-nba-trade-deadline-anthony-davis/", "tags": ["Dallas Mavericks", "Trade", "Anthony Davis"]}, {"date": "", "archive_date": "2025-12-15", "text": "Michael Grange:Raptors announce that RJ Barrett will return to basketball activities this week after having a PRP injection a week ago.Barrett has been out of the lineup with a knee sprain since Nov. 24th.Twitter @michaelgrange", "quote": "Raptors announce that RJ Barrett will return to basketball activities this week after having a PRP injection a week ago.", "outlet": "Twitter @michaelgrange", "source_url": "https://hoopshype.com/social/", "tags": ["Toronto Raptors", "Injuries", "RJ Barrett"]}, {"date": "", "archive_date": "2025-12-15", "text": "Billionaire investorMark Cuban and several current NBA stars have backed a $4m (£3m) fundraising round for Irish sports tech company Orreco. They join major-winning golfers Padraig Harrington and Graeme McDowell as investors in Orreco, which uses AI to analyse athletes’ movement for signs of injury susceptibility. “This is the first proactive approach to use AI to help reduce injury risk,” said Cuban, a co-owner of the Dallas Mavericks NBA team who made his billions as a tech founder and appears on US TV show Shark Tank. “It’s great today and only going to get better.”City A.M.", "quote": "Mark Cuban and several current NBA stars have backed a $4m (£3m) fundraising round for Irish sports tech company Orreco", "outlet": "City A.M.", "source_url": "https://www.cityam.com/mark-cuban-and-nba-stars-join-3m-raise-for-irish-sports-tech-firm/", "tags": ["Mark Cuban", "Business", "Technology"]}, {"date": "", "archive_date": "2025-12-15", "text": "Sam Smith: A lot of my colleagues, the media used it as a way to take shots at him, especially in the New York Times. I thought they used it a lot to say, well, this is his political philosophy, unlike these players today. And it was a lot different when LeBron James, Carmelo Anthony, and Chris Paul were making these stands about, and it was fine. I'm glad they were doing it. But doing it in 2010 was a lot different than saying something like that in 1988 or something. That got sort of smoothed over, andI always felt Michael was made a victim, and that I wanted to clear that up, that that was a joke that had nothing to do with political philosophy, and that was a classic out-of-context gotcha.We don't care what he meant, but it's a good story, so we're going to use it as a good story.HoopsHype", "quote": "I always felt Michael was made a victim, and that I wanted to clear that up, that that was a joke that had nothing to do with political philosophy, and that was a classic out-of-context gotcha.", "outlet": "HoopsHype", "source_url": "https://www.hoopshype.com/story/sports/nba/2025/12/15/sam-smith-qa-great-players-ran-away-from-jordan-shadow-kobe-bryant-ran-to-it/87750250007/", "tags": ["Chicago Bulls", "Michael Jordan", "Sam Smith"]}]